[{"slide_number": "1", "title": "Rig Veda vs Yajur Veda", "slide_type": "Title Slide", "content": "(No additional content for Title Slide)", "image_desc": "[Image Description in English only: An image depicting ancient Vedic rituals or scholars.]", "narration": "Welcome to this presentation exploring the differences between the Rig Veda and the Yajur Veda, two of the most important texts in Hinduism.", "image_url": "https://iiif.wellcomecollection.org/image/V0045839/full/full/0/default.jpg", "image_path": "data/videos/83eba6ec-ede8-4e86-9ab0-47660c2a7101/images/image_1.webp"}, {"slide_number": "2", "title": "The Rig Veda", "slide_type": "Image Left", "content": "Oldest of the four Vedas\nFocuses on hymns and prayers to deities\nContains 1028 hymns\nComposed in Sanskrit", "image_desc": "[Image Description in English only: An image of a manuscript of the Rig Veda.]", "narration": "The Rig Veda is considered the oldest of the four Vedas. It's a collection of hymns and prayers addressed to various deities. The Rig Veda contains 1028 hymns, all composed in Sanskrit.", "image_url": "https://www.namami.gov.in/sites/all/themes/namami/images/rigveda2.jpg", "image_path": "data/videos/83eba6ec-ede8-4e86-9ab0-47660c2a7101/images/image_2.webp"}, {"slide_number": "3", "title": "The Yajur Veda", "slide_type": "Image Right", "content": "Focuses on rituals and sacrifices\nContains formulas and instructions for performing rituals\nDivided into two branches: Black Yajur Veda and White Yajur Veda\nAlso composed in Sanskrit", "image_desc": "[Image Description in English only: An image depicting a Vedic ritual or sacrifice.]", "narration": "The Yajur Veda, on the other hand, focuses on rituals and sacrifices. It contains formulas and instructions for performing these rituals. The Yajur Veda is divided into two branches: the Black Yajur Veda and the White Yajur Veda. Both branches are composed in Sanskrit.", "image_url": "https://iiif.wellcomecollection.org/image/V0045839/full/full/0/default.jpg", "image_path": "data/videos/83eba6ec-ede8-4e86-9ab0-47660c2a7101/images/image_3.webp"}, {"slide_number": "4", "title": "Key Differences", "slide_type": "Two Columns", "content": "**Column 1: Rig Veda**\nHymns and prayers\nFocus on praising deities\nMore poetic and lyrical\nComposed in a more archaic form of Sanskrit\n**Column 2: Yajur Veda**\nRituals and sacrifices\nFocus on practical instructions\nMore prose-like and formulaic\nComposed in a more refined form of Sanskrit", "image_desc": "[Image Description in English only: A visual representation of the differences, perhaps using contrasting colors or symbols.]", "narration": "The key difference between the Rig Veda and the Yajur Veda lies in their focus. The Rig Veda is about praising deities through hymns and prayers, while the Yajur Veda focuses on practical instructions for performing rituals and sacrifices. The Rig Veda is more poetic and lyrical, composed in a more archaic form of Sanskrit, while the Yajur Veda is more prose-like and formulaic, composed in a more refined form of Sanskrit.", "image_url": "https://d2jv9003bew7ag.cloudfront.net/uploads/Color-Contras-in-Art.-Image-via-painting.aboutcom1.jpg", "image_path": "data/videos/83eba6ec-ede8-4e86-9ab0-47660c2a7101/images/image_4.webp"}, {"slide_number": "5", "title": "Significance", "slide_type": "Image with Caption", "content": "(No additional content for this slide)", "image_desc": "[Image Description in English only: An image of a Hindu temple or a group of people meditating.]", "narration": "Both the Rig Veda and the Yajur Veda are considered sacred texts in Hinduism. They provide insights into ancient Indian culture, beliefs, and practices. They are still studied and revered by Hindus today.", "image_url": "https://img.freepik.com/premium-photo/hindu-woman-meditating-temple-full-women_1036110-60.jpg", "image_path": "data/videos/83eba6ec-ede8-4e86-9ab0-47660c2a7101/images/image_5.webp"}, {"slide_number": "6", "title": "Conclusion", "slide_type": "Image Left", "content": "The Rig Veda and Yajur Veda are essential texts in Hinduism\nThey offer different perspectives on spirituality and practice\nUnderstanding their differences helps us appreciate the richness of Vedic tradition", "image_desc": "[Image Description in English only: An image of a person reading a Vedic text or a group of people discussing Vedic philosophy.]", "narration": "In conclusion, the Rig Veda and the Yajur Veda are essential texts in Hinduism, offering different perspectives on spirituality and practice. Understanding their differences helps us appreciate the richness and diversity of the Vedic tradition.", "image_url": "https://c8.alamy.com/comp/CFJJRK/man-reading-vedic-texts-tehri-garhwal-uttaranchal-india-asia-CFJJRK.jpg", "image_path": "data/videos/83eba6ec-ede8-4e86-9ab0-47660c2a7101/images/image_6.webp"}]