[{"slide_number": "1", "title": "What is the Sky?", "slide_type": "Title Slide", "content": "(No additional content for Title Slide)", "image_desc": "[Image Description in English only: A vast blue sky with fluffy white clouds.]", "narration": "Have you ever looked up at the sky and wondered what it is?  The sky is a vast expanse above us, and it's something we see every day. But what exactly is it?", "image_url": "https://img.freepik.com/premium-photo/vast-arid-desert-landscape-with-cracked-earth-dust-cloud-swirling-distance-clear-blue-sky-with-fluffy-white-clouds_885831-116964.jpg", "image_path": "data\\videos\\115ef1d0-40c8-43b5-be51-bdf0cee8ae54\\images\\image_1.webp"}, {"slide_number": "2", "title": "The Atmosphere", "slide_type": "Image Left", "content": "The sky is actually a part of Earth's atmosphere.\nThe atmosphere is a layer of gases that surrounds our planet.\nIt's made up of nitrogen, oxygen, and other gases.", "image_desc": "[Image Description in English only: A diagram of Earth with different layers of the atmosphere labeled.]", "narration": "The sky is actually a part of Earth's atmosphere. The atmosphere is a layer of gases that surrounds our planet. It's made up of nitrogen, oxygen, and other gases.", "image_url": "https://i.pinimg.com/originals/88/b3/c1/88b3c187d4ee84f20b607cb752c945a3.jpg", "image_path": "data\\videos\\115ef1d0-40c8-43b5-be51-bdf0cee8ae54\\images\\image_2.webp"}, {"slide_number": "3", "title": "How We See the Sky", "slide_type": "Image Right", "content": "We see the sky because sunlight scatters through the atmosphere.\nThe blue color we see is caused by the scattering of shorter wavelengths of light.\nAt sunrise and sunset, the sky appears red or orange because the sunlight has to travel through more of the atmosphere.", "image_desc": "[Image Description in English only: A photo of a sunset with the sky in shades of orange and red.]", "narration": "We see the sky because sunlight scatters through the atmosphere. The blue color we see is caused by the scattering of shorter wavelengths of light. At sunrise and sunset, the sky appears red or orange because the sunlight has to travel through more of the atmosphere.", "image_url": "https://www.spc.noaa.gov/publications/corfidi/sunset/picss1979nov26cjpgmedLABEL.jpg", "image_path": "data\\videos\\115ef1d0-40c8-43b5-be51-bdf0cee8ae54\\images\\image_3.webp"}, {"slide_number": "4", "title": "Clouds", "slide_type": "Image with Caption", "content": "(No additional content for this slide)", "image_desc": "[Image Description in English only: A photo of a variety of clouds in the sky, including cumulus, stratus, and cirrus clouds.]", "narration": "Clouds are made up of tiny water droplets or ice crystals that form in the atmosphere. They come in many different shapes and sizes, and they can be a beautiful sight to see.", "image_url": "https://www.thoughtco.com/thmb/XdFesVCkZn_4_7X4gwRA-O0hxmc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/types-of-clouds-recognize-in-the-sky-4025569-FINAL-12e9e256b33c48a5912dc80761bb6838.png", "image_path": "data\\videos\\115ef1d0-40c8-43b5-be51-bdf0cee8ae54\\images\\image_4.webp"}, {"slide_number": "5", "title": "The Sky at Night", "slide_type": "Image Left", "content": "At night, we can see stars and planets.\nThe darkness of the night sky is caused by the absence of sunlight.\nThe moon reflects sunlight, making it appear bright in the night sky.", "image_desc": "[Image Description in English only: A photo of a clear night sky with stars and the moon visible.]", "narration": "At night, we can see stars and planets. The darkness of the night sky is caused by the absence of sunlight. The moon reflects sunlight, making it appear bright in the night sky.", "image_url": "http://3.bp.blogspot.com/-jNijphq4xh8/VF1sVJtsD3I/AAAAAAAAAgo/k6y8c3B34nY/s1600/full-moon-in-the-starry-sky.jpg", "image_path": "data\\videos\\115ef1d0-40c8-43b5-be51-bdf0cee8ae54\\images\\image_5.webp"}]