[{"title": "Hypertension", "image_desc": "A diagram showing a blood pressure gauge with an elevated reading.", "content": ["- High blood pressure, also known as hypertension, is a common condition.", "It affects millions of people worldwide.", "It can lead to serious health problems if left untreated."], "narration": "Hypertension, or high blood pressure, is a serious condition affecting millions of people. It's important to understand the risks and how to manage it.\n\n#", "slide_number": "1", "image_url": "/data/videos/07c31bd5-cb62-4ba3-8758-6e4b4032e844/images/image_1.webp", "image_path": "data/videos/07c31bd5-cb62-4ba3-8758-6e4b4032e844/images/image_1.webp"}, {"title": "Causes of Hypertension", "image_desc": "A person exercising with a healthy diet on the side.", "content": ["- Genetics can play a role.", "Lifestyle factors like diet, exercise, and stress can contribute.", "Certain medical conditions can also cause hypertension."], "narration": "Hypertension can be caused by a combination of factors. Genetics can play a role, but lifestyle choices like diet, exercise, and stress management are crucial. \n\n#", "slide_number": "2", "image_url": "https://images.pexels.com/photos/6740775/pexels-photo-6740775.jpeg", "image_path": "data/videos/07c31bd5-cb62-4ba3-8758-6e4b4032e844/images/image_2.webp"}, {"title": "Symptoms of Hypertension", "image_desc": "A person with a worried expression, holding their head.", "content": ["- Often, there are no noticeable symptoms.", "Headaches, dizziness, and nosebleeds can be signs.", "Regular blood pressure checks are essential for early detection."], "narration": "Many people with hypertension don't experience any symptoms. However, headaches, dizziness, and nosebleeds can be warning signs. Regular blood pressure checks are vital for early detection.\n\n#", "slide_number": "3", "image_url": "https://img.freepik.com/premium-vector/person-with-worried-expression-holding-their-head-their-hands-symbolizing-their-anxiety_660230-143.jpg", "image_path": "data/videos/07c31bd5-cb62-4ba3-8758-6e4b4032e844/images/image_3.webp"}, {"title": "Hyperlipidemia", "image_desc": "A diagram showing a blood sample with high cholesterol levels.", "content": ["- High cholesterol, also known as hyperlipidemia, is another common condition.", "It involves high levels of lipids (fats) in the blood.", "It can contribute to heart disease and stroke."], "narration": "Hyperlipidemia, or high cholesterol, is a condition where there are high levels of fats in the blood. This can increase the risk of heart disease and stroke.\n\n#", "slide_number": "4", "image_url": "/data/videos/07c31bd5-cb62-4ba3-8758-6e4b4032e844/images/image_4.webp", "image_path": "data/videos/07c31bd5-cb62-4ba3-8758-6e4b4032e844/images/image_4.webp"}, {"title": "Causes of Hyperlipidemia", "image_desc": "A person eating a meal with a high amount of unhealthy fats.", "content": ["- Genetics can play a role.", "Diet high in saturated and trans fats can contribute.", "Lack of physical activity can also be a factor."], "narration": "Hyperlipidemia can be influenced by genetics, but lifestyle choices like diet and exercise are crucial. A diet high in saturated and trans fats can contribute to high cholesterol levels.\n\n#", "slide_number": "5", "image_url": "https://images.pexels.com/photos/6975534/pexels-photo-6975534.jpeg", "image_path": "data/videos/07c31bd5-cb62-4ba3-8758-6e4b4032e844/images/image_5.webp"}, {"title": "Symptoms of Hyperlipidemia", "image_desc": "A person getting a blood test at a doctor's office.", "content": ["- Often, there are no noticeable symptoms.", "Regular blood tests are essential for early detection.", "Early detection allows for timely intervention and management."], "narration": "Like hypertension, hyperlipidemia often doesn't have noticeable symptoms. Regular blood tests are crucial for early detection and management.\n\n#", "slide_number": "6", "image_url": "https://cdn-prod.medicalnewstoday.com/content/images/articles/326/326817/a-blood-tests-lying-on-top-of-a-document.jpg", "image_path": "data/videos/07c31bd5-cb62-4ba3-8758-6e4b4032e844/images/image_6.webp"}, {"title": "Management of Hypertension and Hyperlipidemia", "image_desc": "A person exercising, eating healthy food, and meditating.", "content": ["- Lifestyle modifications are key:\n    - Healthy diet\n    - Regular exercise\n    - Stress management", "Medications may be necessary in some cases.", "Regular monitoring and follow-up with a healthcare professional are essential."], "narration": "Managing hypertension and hyperlipidemia often involves lifestyle changes. A healthy diet, regular exercise, and stress management are crucial. In some cases, medication may be necessary. Regular monitoring and follow-up with a healthcare professional are essential for managing these conditions.", "slide_number": "7", "image_url": "https://images.pexels.com/photos/6933132/pexels-photo-6933132.jpeg", "image_path": "data/videos/07c31bd5-cb62-4ba3-8758-6e4b4032e844/images/image_7.webp"}]