[{"title": "The Problem with Traditional Attendance Systems", "content": ["- Manual sign-in and out processes", "Paperwork and administrative burden", "Human errors and inaccurate records", "Inefficient and time-consuming"], "image_desc": "A busy office with employees manually signing in and out on a clipboard, with a frustrated HR manager looking overwhelmed.", "narration": "In today's fast-paced work environment, traditional attendance systems are riddled with challenges.  Employees manually sign in and out, creating unnecessary paperwork.  Human errors are common, records can get misplaced, and maintaining accurate attendance logs becomes a major headache for HR teams.  This system isn't just tedious – it's inefficient.", "slide_number": "1", "image_url": "https://c8.alamy.com/comp/2KAHJX3/stress-headache-and-overwhelmed-worker-with-burnout-handed-office-paperwork-by-manager-and-employees-mental-health-anxiety-and-tired-worker-2KAHJX3.jpg", "image_path": "data/videos/b0aeaefb-666d-4f31-859b-92a8ee0e9fb7/images/image_1.webp"}, {"title": "Introducing GeoTrack: A Revolution in Attendance Tracking", "content": ["- Geolocation-based attendance tracking", "Automatic check-in and check-out", "Eliminates manual attendance processes", "Enhanced accuracy and efficiency"], "image_desc": "A smartphone displaying a map with a pin marking an office location, with a notification showing \"GeoTrack: Check-in Successful.\"", "narration": "But now, there's a better way.  Introducing GeoTrack, a cutting-edge geolocation-based attendance tracking app, designed specifically for GAIL India.  GeoTrack revolutionizes how attendance is managed, offering an easy, automatic solution.  With GeoTrack, the need for manual attendance is eliminated.", "slide_number": "2", "image_url": "https://img.freepik.com/premium-photo/smartphone-displaying-map-with-gps-pins-navigation_673955-585.jpg", "image_path": "data/videos/b0aeaefb-666d-4f31-859b-92a8ee0e9fb7/images/image_2.webp"}, {"title": "GeoTrack: How It Works", "content": ["- Geolocation-Based Check-In and Check-Out", "Automatic recording of check-in time and location", "200-meter radius for office entry and exit", "Manual Location Check-In and Check-Out for offsite employees"], "image_desc": "A smartphone displaying a map with a pin marking an office location, with a notification showing \"GeoTrack: Check-in Successful\" and a list of nearby locations for offsite employees.", "narration": "Using Geolocation-Based Check-In and Check-Out, the app records an employee's check-in time and location automatically when they enter within a 200-meter radius of the office.  The app does the same for check-out when they leave the premises, no matter how many times they enter or exit throughout the day.  For employees working offsite, GeoTrack offers a Manual Location Check-In and Check-Out option.  The app automatically suggests nearby relevant locations based on real-time GPS data, ensuring accurate check-ins even when they're away from the office.", "slide_number": "3", "image_url": "https://www.pngall.com/wp-content/uploads/5/Google-Maps-Location-Mark-PNG-Picture.png", "image_path": "data/videos/b0aeaefb-666d-4f31-859b-92a8ee0e9fb7/images/image_3.webp"}, {"title": "GeoTrack: Beyond Attendance Tracking", "content": ["- Automatic calculation of total working hours", "Live location tracking for active work hours", "Detection of time spent outside designated work locations", "Biometric authentication for GPS spoofing prevention"], "image_desc": "A smartphone displaying a timeline with check-in and check-out times, with a graph showing active work hours and a notification showing \"Biometric Authentication Successful.\"", "narration": "GeoTrack goes further by calculating total working hours automatically.  As it tracks the employee's live location, it calculates how long they were actively at their designated work location and even detects if they were passing time elsewhere.  To prevent GPS spoofing, GeoTrack uses biometric authentication, ensuring that each employee's location is genuine.", "slide_number": "4", "image_url": "http://cdn.techgyd.com/intro-7.png", "image_path": "data/videos/b0aeaefb-666d-4f31-859b-92a8ee0e9fb7/images/image_4.webp"}, {"title": "GeoTrack: Security and Validation", "content": ["- RFID card integration with employee ID", "Verification of employee proximity to their phone", "Prevention of proxy attendance", "Enhanced security and accountability"], "image_desc": "A close-up of an employee ID card with an embedded RFID chip, with a smartphone displaying a notification showing \"RFID Authentication Successful.\"", "narration": "What's more, the app's USP is the integration of an RFID card embedded in the employee's ID.  This card verifies the employee's proximity to their phone.  If the phone is more than 2 meters away from the ID card, the check-in won't be validated, preventing proxy attendance.", "slide_number": "5", "image_url": "https://res.cloudinary.com/kisi-kloud/image/upload/c_lfill,dpr_auto,f_auto,q_auto:good,w_2078/v1/products/access-methods/kisi-reader-pro-credentials-card", "image_path": "data/videos/b0aeaefb-666d-4f31-859b-92a8ee0e9fb7/images/image_5.webp"}, {"title": "GeoTrack: Employee Empowerment", "content": ["- Personalized calendar within the app", "Attendance records, work hours, deadlines, and leave days", "Enhanced work management and transparency", "Improved employee engagement and productivity"], "image_desc": "A smartphone displaying a calendar with check-in and check-out times, upcoming deadlines, and leave days, with a notification showing \"Your Attendance Summary.\"", "narration": "Each employee gets a personalized calendar within the app.  This calendar displays their attendance records, total work hours, upcoming deadlines, and even their leave days, making work management easier than ever before.", "slide_number": "6", "image_url": "https://thumbs.dreamstime.com/b/digital-electronic-calendar-event-appointment-digital-electronic-calendar-event-appointment-screen-245047060.jpg", "image_path": "data/videos/b0aeaefb-666d-4f31-859b-92a8ee0e9fb7/images/image_6.webp"}, {"title": "GeoTrack: Design and Functionality", "content": ["- Geofencing technology for automated check-ins", "Cloud sync for scalability and real-time data management", "Seamless integration with HR systems", "Cost-effective solution with strong ROI"], "image_desc": "A diagram showing a cloud server with data flowing from multiple smartphones, with a notification showing \"GeoTrack: Synced with HR System.\"", "narration": "GeoTrack's design ensures technical, financial, and environmental feasibility.  Geofencing technology enables automated check-ins, while cloud sync makes the app scalable.  The app integrates seamlessly with HR systems and is cost-effective, delivering strong ROI due to the efficiency it creates.", "slide_number": "7", "image_url": "https://www.conceptdraw.com/How-To-Guide/picture/manufacturingprocess-cloud-computing-diagram.png", "image_path": "data/videos/b0aeaefb-666d-4f31-859b-92a8ee0e9fb7/images/image_7.webp"}, {"title": "GeoTrack: Performance and Efficiency", "content": ["- Optimized GPS usage for minimal battery drain", "Smooth real-time syncing, even offline", "Scalable architecture for single or multiple locations", "Cloud-based management for real-time data and user handling"], "image_desc": "A smartphone displaying a map with a pin marking an office location, with a notification showing \"GeoTrack: Synced with HR System\" and a battery icon showing a high charge level.", "narration": "GeoTrack also optimizes GPS usage to minimize battery drain, ensuring smooth real-time syncing, even offline.  Whether it's a single location or multiple offices spread across the country, GeoTrack handles it all.  With its cloud-based architecture, it scales effortlessly, managing data and users in real-time.", "slide_number": "8", "image_url": "https://img.freepik.com/premium-photo/smartphone-displaying-3d-map-with-pins-gps-navigation-iconsillustrating-mobile-technology-fo_894218-8603.jpg", "image_path": "data/videos/b0aeaefb-666d-4f31-859b-92a8ee0e9fb7/images/image_8.webp"}, {"title": "GeoTrack: The Impact", "content": ["- Streamlined payroll processing", "Enhanced workplace security", "Time savings for employees and administrators", "Improved efficiency, accuracy, and security"], "image_desc": "A bar graph showing a significant decrease in payroll processing time, with a security camera icon and a clock icon, with a notification showing \"GeoTrack: Transforming Attendance.\"", "narration": "The impact of GeoTrack is significant.  By precisely tracking employee work hours, it streamlines payroll processing.  Real-time location tracking ensures enhanced workplace security, and the automated system saves valuable time for both employees and administrators.", "slide_number": "9", "image_url": "https://d138zd1ktt9iqe.cloudfront.net/media/seo_landing_files/mahak-bar-graph-06-1603272496.png", "image_path": "data/videos/b0aeaefb-666d-4f31-859b-92a8ee0e9fb7/images/image_9.webp"}, {"title": "GeoTrack: The Future of Attendance Management", "content": ["- Efficiency, accuracy, and security in one solution", "Transform your attendance system today", "Embrace the future of work with GeoTrack"], "image_desc": "A smartphone displaying the GeoTrack app logo with a tagline \"The Future of Attendance Management.\"", "narration": "GeoTrack—efficiency, accuracy, and security, all in one.  Transform your attendance system today.  Embrace the future of work with GeoTrack.", "slide_number": "10", "image_url": "https://play-lh.googleusercontent.com/7KetqgKRfy34KHhHAwxvlQaJr5_H4zjgRHQonJ0XWkpoPr4Fgwg_L0QL-cpZias0eHOk", "image_path": "data/videos/b0aeaefb-666d-4f31-859b-92a8ee0e9fb7/images/image_10.webp"}]