[{"title": "Introduction -  The Problem", "content": ["- Public transportation is crucial in Delhi.", "DTC faces challenges in managing bus operations.", "Manual scheduling and route planning are inefficient.", "Resulting in long processes, errors, and poor resource utilization."], "image_desc": "A busy street scene in Delhi with multiple buses in traffic", "narration": "Welcome to Delhi, a city bustling with life. Public transportation is the backbone of this metropolis, and the Delhi Transport Corporation (DTC) plays a vital role in keeping it moving. However, DTC faces significant challenges in managing its bus operations efficiently. Currently, manual scheduling and route planning create a bottleneck, leading to long, tedious processes, increased chances of human error, and poor resource utilization. This means more time and money spent, with buses often running inefficiently on congested or overlapping routes.", "slide_number": "1", "image_url": "https://thumbs.dreamstime.com/b/big-traffic-tuktuks-buses-people-new-delhi-india-163887584.jpg", "image_path": "data/videos/1dc2dc3a-0a0d-4309-b827-400933104422/images/image_1.webp"}, {"title": "Challenges DTC Faces", "content": ["- Manual scheduling is time-consuming and prone to errors.", "Resource mismanagement leads to redundant routes and overcrowding.", "Lack of real-time traffic adjustments causes delays and passenger dissatisfaction."], "image_desc": "A group of people waiting at a bus stop, looking frustrated", "narration": "Let's delve deeper into the problems. First, scheduling buses and crews manually is time-consuming and prone to mistakes. Schedulers spend hours trying to assign the right buses to the right routes, but with so many variables, it's easy to make errors. Additionally, resource mismanagement results in redundant routes, overcrowded buses during peak hours, and underutilized buses during off-peak times. And, of course, without real-time traffic adjustments, buses often get caught in traffic jams, causing delays and passenger dissatisfaction.", "slide_number": "2", "image_url": "https://thumbs.dreamstime.com/z/people-waiting-bus-stop-belgrade-serbia-october-130806666.jpg", "image_path": "data/videos/1dc2dc3a-0a0d-4309-b827-400933104422/images/image_2.webp"}, {"title": "Solution Overview - Introducing the Automated System", "content": ["- Introducing the Automated Bus Scheduling and Route Management System.", "Uses AI and GIS technology to automate DTC's core operations.", "Makes scheduling and route planning faster, smarter, and more efficient."], "image_desc": "A schematic diagram of a bus network with AI and GIS icons overlaid", "narration": "To tackle these issues, we've developed the Automated Bus Scheduling and Route Management System. This intelligent system automates DTC's core operations, using Artificial Intelligence and GIS technology to make scheduling and route planning faster, smarter, and more efficient.", "slide_number": "3", "image_url": "https://aicraze.net/wp-content/uploads/2023/07/What-is-bus-topology.webp", "image_path": "data/videos/1dc2dc3a-0a0d-4309-b827-400933104422/images/image_3.webp"}, {"title": "Key Features - Breaking Down the Solution", "content": ["- Linked and Unlinked Duty Scheduling:\n    - Linked: Single crew with a bus throughout the shift.\n    - Unlinked: Crews hand over buses seamlessly.", "Route Management:\n    - GIS integration for mapping and visualization.\n    - Identifies route overlaps and service gaps.", "AI-powered Demand Forecasting:\n    - Predicts passenger demand based on historical data and traffic patterns.\n    - Dynamically adjusts bus numbers.", "Real-time Route Optimization:\n    - Adjusts routes based on live traffic data.\n    - Reduces delays and improves punctuality."], "image_desc": "A split-screen showing a bus route map with real-time traffic data overlaid on one side and a dashboard with scheduling information on the other", "narration": "Let's take a closer look at what this system does. First, we have Linked and Unlinked Duty Scheduling. For linked duty, a single crew remains with a bus throughout the entire shift. In unlinked duty, the system allows crews to hand over buses seamlessly, ensuring proper management of rest periods and shifts. Next, Route Management: By integrating GIS technology, the system maps out existing bus routes and provides a clear visualization of the bus network. It also highlights route overlaps and service gaps, helping planners draw new routes and optimize coverage. Additionally, AI-powered demand forecasting allows the system to predict passenger demand based on historical data, traffic patterns, and special events. This enables the system to adjust the number of buses on the road dynamically, ensuring there are always enough buses during peak hours and fewer during quieter times. Finally, the system uses real-time route optimization to make dynamic adjustments based on live traffic data. When traffic jams or accidents occur, AI will suggest alternative routes, reducing delays and improving punctuality.", "slide_number": "4", "image_url": "https://www.aesys.com/aesysadmin/uploads/image/prodotti-e-soluzioni/autobus/sistema-informativo-multimediale/5.jpg", "image_path": "data/videos/1dc2dc3a-0a0d-4309-b827-400933104422/images/image_4.webp"}, {"title": "Technologies Used - Behind the Scenes", "content": ["- Python and Java for core algorithms and scheduling.", "React.js for user-friendly frontend interface.", "AI for demand forecasting:\n    - ARIMA and Prophet models.", "Reinforcement Learning and Genetic Algorithms for route optimization.", "PostGIS for spatial data management and visualization.", "Google Maps API for real-time traffic data.", "Cloud storage on AWS or Google Cloud Platform."], "image_desc": "A flowchart showing the different technologies used in the system, with icons representing each technology", "narration": "Behind the scenes, several key technologies power this system. We use Python and Java to build the core algorithms and manage scheduling. For the frontend interface, we use React.js to make it user-friendly for planners and schedulers. Artificial Intelligence plays a major role, with machine learning models like ARIMA and Prophet used for demand forecasting. Reinforcement Learning and Genetic Algorithms help optimize routes in real-time. To manage and visualize routes, we rely on PostGIS, which extends PostgreSQL for handling spatial data. We also integrate Google Maps API to pull in real-time traffic data, ensuring that routes are continuously optimized. All data is securely stored in the cloud using AWS or Google Cloud Platform, making the system scalable and reliable.", "slide_number": "5", "image_url": "https://www.someka.net/wp-content/uploads/2023/06/AI-Flowchart-Someka-Example-SS1.png", "image_path": "data/videos/1dc2dc3a-0a0d-4309-b827-400933104422/images/image_5.webp"}, {"title": "Benefits - Why This Solution Works", "content": ["- Reduced time and labor costs due to automation.", "Optimized operational costs through better resource allocation.", "Reliable service with dynamic adjustments for peak hours and special events.", "Data-driven decision-making for improved route coverage and congestion reduction."], "image_desc": "A bar graph showing a comparison of costs before and after implementing the automated system", "narration": "The benefits of this system are clear. Time and labor costs are drastically reduced by automating bus scheduling. Operational costs are optimized, thanks to better resource allocation, and the system's real-time adjustments mean buses spend less time in traffic. By predicting passenger demand and adjusting bus routes dynamically, this system ensures reliable service, even during rush hours or special events. Plus, by visualizing routes with GIS, planners can make data-driven decisions to reduce congestion and improve route coverage.", "slide_number": "6", "image_url": "https://i.stack.imgur.com/iAMa2.png", "image_path": "data/videos/1dc2dc3a-0a0d-4309-b827-400933104422/images/image_6.webp"}, {"title": "Conclusion - Final Thoughts", "content": ["- The Automated Bus Scheduling and Route Management System transforms DTC operations.", "Brings automation, AI, and real-time data into daily operations.", "Results in improved public transportation services for Delhi.", "A scalable solution for the city's growing transportation needs."], "image_desc": "A futuristic cityscape with buses moving smoothly on a network of routes", "narration": "In conclusion, the Automated Bus Scheduling and Route Management System transforms how DTC operates, bringing automation, AI, and real-time data into daily operations. With smarter scheduling, optimized routes, and a focus on efficiency, the result is improved public transportation services for the people of Delhi. And most importantly, it's a scalable solution that can grow with the city's transportation needs.", "slide_number": "7", "image_url": "https://thumbs.dreamstime.com/b/futuristic-electric-bus-speeding-past-futuristic-cityscape-against-night-sky-futuristic-electric-bus-speeding-past-futuristic-273592863.jpg", "image_path": "data/videos/1dc2dc3a-0a0d-4309-b827-400933104422/images/image_7.webp"}, {"title": "Closing Visual", "content": ["- Driving the future of urban mobility."], "image_desc": "A bus with a futuristic design, showcasing the potential for innovation in public transportation", "narration": "With this system, we're driving the future of urban mobility.", "slide_number": "8", "image_url": "https://img.freepik.com/premium-photo/futuristic-neonlit-bus-dark-setting-showcasing-modern-public-transportation-design_878954-2888.jpg", "image_path": "data/videos/1dc2dc3a-0a0d-4309-b827-400933104422/images/image_8.webp"}]