[{"slide_number": "1", "title": "Cognizant: A Global Leader in Technology Solutions", "slide_type": "Title Slide", "content": ["- (No additional content for Title Slide)"], "image_desc": "- Cognizant logo with a modern, tech-focused background.", "narration": "Welcome! This video will help you prepare for your Cognizant interview by providing insights into the company and its values.", "image_url": "https://c8.alamy.com/comp/2JCK9YJ/person-holding-smartphone-with-website-of-cognizant-technology-solutions-corporation-on-screen-in-front-of-logo-focus-on-center-of-phone-display-2JCK9YJ.jpg", "image_path": "data/videos/b290bf2f-00e4-4610-a0df-d4b50da11019/images/image_1.webp"}, {"slide_number": "2", "title": "Who is Cognizant?", "slide_type": "Image Right", "content": ["- Cognizant is a leading global technology solutions company.", "- We help businesses transform their operations and achieve their digital goals.", "- We have a diverse workforce of over 300,000 employees across the globe."], "image_desc": "- A diverse group of Cognizant employees working collaboratively on a project.", "narration": "Cognizant is a global leader in technology solutions, with a focus on helping businesses transform their operations and achieve their digital goals. We have a large and diverse workforce of over three hundred thousand employees across the globe, working together to deliver innovative solutions.", "image_url": "https://www.bareinternational.com/wp-content/uploads/2018/04/AdobeStock_182188781.jpeg", "image_path": "data/videos/b290bf2f-00e4-4610-a0df-d4b50da11019/images/image_2.webp"}, {"slide_number": "3", "title": "Cognizant's Core Values", "slide_type": "Image Left", "content": ["- **Client Focus:** We are committed to delivering exceptional value to our clients.", "- **Innovation:** We constantly strive to develop new and innovative solutions.", "- **Collaboration:** We believe in the power of teamwork and collaboration.", "- **Integrity:** We operate with the highest ethical standards.", "- **Respect:** We value diversity and respect all individuals."], "image_desc": "- A graphic representation of Cognizant's core values, with each value illustrated by a relevant image.", "narration": "Cognizant's success is built on a foundation of strong core values. These values guide our actions and shape our culture. We are client-focused, always striving to deliver exceptional value. We are committed to innovation, constantly developing new and innovative solutions. We believe in the power of teamwork and collaboration, fostering a culture of respect and inclusivity.", "image_url": "https://www.shutterstock.com/shutterstock/photos/1013309929/display_1500/stock-vector-simple-vector-infographic-for-core-values-template-isolated-on-blue-background-easy-to-use-for-1013309929.jpg", "image_path": "data/videos/b290bf2f-00e4-4610-a0df-d4b50da11019/images/image_3.webp"}, {"slide_number": "4", "title": "Cognizant's Services", "slide_type": "Two Columns", "content": ["- **Column 1:** Digital Business Solutions", "- Cloud Computing", "- Digital Engineering", "- Data Analytics", "- Artificial Intelligence", "- **Column 2:** Industry Solutions", "- Financial Services", "- Healthcare", "- Manufacturing", "- Retail"], "image_desc": "- A collage of images representing various Cognizant services, such as cloud computing, data analytics, and industry-specific solutions.", "narration": "Cognizant offers a wide range of services to meet the diverse needs of our clients. We provide digital business solutions, including cloud computing, digital engineering, data analytics, and artificial intelligence. We also offer industry-specific solutions tailored to the unique challenges of sectors like financial services, healthcare, manufacturing, and retail.", "image_url": "https://www.theconsultingreport.com/wp-content/uploads/2024/08/TCR-AI.jpg", "image_path": "data/videos/b290bf2f-00e4-4610-a0df-d4b50da11019/images/image_4.webp"}, {"slide_number": "5", "title": "Cognizant's Culture", "slide_type": "Image with Caption", "content": ["- Cognizant fosters a culture of innovation, collaboration, and respect.", "- We encourage employees to take ownership and contribute their unique talents.", "- We provide opportunities for professional growth and development."], "image_desc": "- An image of a Cognizant office space with employees collaborating and working on projects, showcasing a positive and inclusive environment.", "narration": "At Cognizant, we foster a culture of innovation, collaboration, and respect. We encourage employees to take ownership and contribute their unique talents. We provide opportunities for professional growth and development, empowering our employees to reach their full potential.", "image_url": "https://thumbs.dreamstime.com/b/inclusive-modern-office-environment-diverse-team-collaborating-features-employees-desks-person-wheelchair-space-306051429.jpg", "image_path": "data/videos/b290bf2f-00e4-4610-a0df-d4b50da11019/images/image_5.webp"}, {"slide_number": "6", "title": "Preparing for Your Interview", "slide_type": "Table of Contents", "content": ["- **Section 1:** Understanding Cognizant's Values", "- **Section 2:** Researching Cognizant's Services", "- **Section 3:** Preparing for Behavioral Questions", "- **Section 4:** Demonstrating Your Skills and Experience"], "image_desc": "- A visual representation of a checklist or a roadmap with steps for interview preparation.", "narration": "Now that you have a better understanding of Cognizant, let's talk about how to prepare for your interview. This video will guide you through key areas, including understanding Cognizant's values, researching our services, preparing for behavioral questions, and demonstrating your skills and experience.", "image_url": "https://cdn.sketchbubble.com/pub/media/catalog/product/optimized1/2/2/222693310e30abe0d67b09626718e8d4993a7af8abe18f4837d425d186d0cfbc/interview-steps-mc-slide1.png", "image_path": "data/videos/b290bf2f-00e4-4610-a0df-d4b50da11019/images/image_6.webp"}, {"slide_number": "7", "title": "Conclusion", "slide_type": "Image Right", "content": ["- We hope this video has provided you with valuable insights into Cognizant.", "- Remember to be confident, enthusiastic, and prepared.", "- We look forward to meeting you!"], "image_desc": "- A positive and encouraging image, such as a handshake or a group of people celebrating success.", "narration": "We hope this video has provided you with valuable insights into Cognizant. Remember to be confident, enthusiastic, and prepared. We look forward to meeting you!", "image_url": "https://thumbs.dreamstime.com/b/group-happy-business-people-celebrating-success-joyful-together-their-high-five-242616162.jpg", "image_path": "data/videos/b290bf2f-00e4-4610-a0df-d4b50da11019/images/image_7.webp"}]