[{"title": "SpaceX Starlink Launch", "content": ["SpaceX Starlink Launch\n\n[SpaceX is launching a Falcon 9 rocket carrying 21 Starlink satellites into low-Earth orbit.]", "The launch is scheduled for 3:48 a.m. EDT Wednesday from Launch Complex 40 at Cape Canaveral Space Force Station.", "The rocket's first-stage booster will target landing aboard a SpaceX drone ship out at sea."], "video_desc": "Time-lapse footage of a Falcon 9 rocket launching from a launchpad, followed by shots of the rocket ascending into the sky and the first-stage booster landing on a drone ship.", "narration": "Get ready for a spectacular launch! SpaceX is sending a Falcon 9 rocket into space, carrying 21 Starlink satellites. The launch is happening early Wednesday morning from Cape Canaveral.  The rocket will soar skyward, and its first-stage booster will attempt a landing on a drone ship out at sea.", "slide_number": "1", "video_url": "https://videos.pexels.com/video-files/7106577/7106577-sd_960_540_30fps.mp4", "video_path": "data\\videos\\86b0e38d-4626-4275-a1c5-487aa95104e5\\videos\\video_1.mp4"}, {"title": "Polaris Dawn Mission Delayed", "content": ["Polaris Dawn Mission Delayed\n\n[The Polaris Dawn mission, which was originally scheduled to launch Wednesday, has been delayed due to weather.]", "The mission will carry four crew members aboard a Falcon 9 rocket.", "The launch has been postponed due to unfavorable weather conditions in the Dragon capsule's splashdown area."], "video_desc": "Shots of a SpaceX Dragon capsule, followed by footage of stormy weather conditions over the ocean.", "narration": "The Polaris Dawn mission, which was supposed to launch today, has been pushed back due to weather.  The crew of four astronauts will have to wait for better conditions before they can blast off.", "slide_number": "2", "video_url": "https://videos.pexels.com/video-files/5112143/5112143-sd_640_360_30fps.mp4", "video_path": "data\\videos\\86b0e38d-4626-4275-a1c5-487aa95104e5\\videos\\video_2.mp4"}, {"title": "Stay Tuned for Updates", "content": ["Stay Tuned for Updates\n\n[Follow FLORIDA TODAY Space Team for live updates on the SpaceX Starlink launch.]", "We'll be providing live coverage of the launch and landing.", "Stay tuned for more updates on the Polaris Dawn mission."], "video_desc": "A montage of various SpaceX launch and landing footage, interspersed with shots of the FLORIDA TODAY Space Team logo.", "narration": "We'll be here with live updates on the Starlink launch and the Polaris Dawn mission.  Be sure to subscribe and follow us for all the latest space news!", "slide_number": "3", "video_url": "https://videos.pexels.com/video-files/3168117/3168117-sd_426_240_30fps.mp4", "video_path": "data\\videos\\86b0e38d-4626-4275-a1c5-487aa95104e5\\videos\\video_3.mp4"}]