[{"slide_number": "1", "title": "Atomic Structure", "slide_type": "Title Slide", "content": ["- (No additional content for Title Slide)"], "image_desc": "- A colorful illustration of an atom with a nucleus and orbiting electrons.", "narration": "Welcome to this video on atomic structure. We'll explore the fundamental building blocks of matter, the atom.", "image_url": "https://thumbs.dreamstime.com/b/illustration-atom-orbiting-electrons-colorful-nucleus-58188193.jpg", "image_path": "data/videos/24f2cec3-ddb5-46ea-8e31-49de439cf697/images/image_1.webp"}, {"slide_number": "2", "title": "The Atom: A Tiny World", "slide_type": "Image Left", "content": ["- Atoms are the smallest unit of an element that retains the chemical properties of that element.", "- They are incredibly small, about 100,000 times smaller than the width of a human hair.", "- Atoms are mostly empty space, with a dense, positively charged nucleus at the center."], "image_desc": "- A magnified image of an atom with a nucleus and orbiting electrons, emphasizing the vast empty space.", "narration": "Imagine a tiny, miniature solar system. That's what an atom is like. At the center, we have the nucleus, which is like the sun. It contains protons and neutrons, which are positively and neutrally charged particles, respectively.", "image_url": "https://thumbs.dreamstime.com/b/atomic-nucleus-electrons-neutrons-protons-model-shows-atom-mostly-empty-space-electrons-orbiting-atomic-nucleus-284547642.jpg", "image_path": "data/videos/24f2cec3-ddb5-46ea-8e31-49de439cf697/images/image_2.webp"}, {"slide_number": "3", "title": "The Nucleus: The Atom's Core", "slide_type": "Image Right", "content": ["- The nucleus is the dense, positively charged center of an atom.", "- It contains protons and neutrons, collectively called nucleons.", "- The number of protons in the nucleus defines the element."], "image_desc": "- A close-up illustration of the nucleus with protons and neutrons, highlighting their arrangement.", "narration": "The number of protons in the nucleus defines the element. For example, all carbon atoms have six protons, while all oxygen atoms have eight protons.", "image_url": "https://d1yqpar94jqbqm.cloudfront.net/styles/media_full/s3/images/7c45adfc64c83df97a28e2339c45504cede5c51f.jpg?itok=_kwfa8aK", "image_path": "data/videos/24f2cec3-ddb5-46ea-8e31-49de439cf697/images/image_3.webp"}, {"slide_number": "4", "title": "Electrons: Orbiting the Nucleus", "slide_type": "Two Columns", "content": ["- **Column 1**:", "- Electrons are negatively charged particles that orbit the nucleus.", "- They occupy specific energy levels called electron shells.", "- The number of electrons in an atom usually equals the number of protons, making the atom electrically neutral.", "- **Column 2**:", "- Electrons are much lighter than protons and neutrons.", "- They are constantly moving around the nucleus in a cloud-like pattern.", "- The arrangement of electrons determines an atom's chemical properties."], "image_desc": "- A diagram depicting electron shells around the nucleus, showing electrons orbiting in different energy levels.", "narration": "Surrounding the nucleus, we have electrons. These tiny particles are negatively charged and orbit the nucleus in specific energy levels called electron shells. The arrangement of these electrons determines how an atom interacts with other atoms, which is the basis of chemistry.", "image_url": "https://wou.edu/chemistry/files/2017/04/atomic-structure-1.png", "image_path": "data/videos/24f2cec3-ddb5-46ea-8e31-49de439cf697/images/image_4.webp"}, {"slide_number": "5", "title": "Atomic Structure: A Summary", "slide_type": "Image with Caption", "content": ["- (No additional content for this slide)"], "image_desc": "- A simplified diagram of an atom with a nucleus containing protons and neutrons, and electrons orbiting in shells around the nucleus.", "narration": "So, remember, atoms are the building blocks of everything around us. They consist of a dense nucleus containing protons and neutrons, surrounded by a cloud of negatively charged electrons orbiting in specific energy levels. This fundamental structure is the basis for all matter and the incredible diversity of the world we live in.", "image_url": "https://static.toiimg.com/thumb/msid-100615994,width-1070,height-580,imgsize-15252,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "image_path": "data/videos/24f2cec3-ddb5-46ea-8e31-49de439cf697/images/image_5.webp"}]