[{"slide_number": "1", "title": "Introduction to Microwave Engineering", "slide_type": "Title Slide", "content": ["- (No additional content for Title Slide)"], "image_desc": "- A close-up image of a microwave circuit board with various components.", "narration": "नमस्ते! आज हम माइक्रोवेव इंजीनियरिंग के बारे में जानेंगे। \n\n-", "image_url": "/data/videos/d771cace-cf45-4fb4-9ea7-fd7358d98003/images/image_1.webp", "image_path": "data/videos/d771cace-cf45-4fb4-9ea7-fd7358d98003/images/image_1.webp"}, {"slide_number": "2", "title": "What is Microwave Engineering?", "slide_type": "Image Left", "content": ["- RF and microwave engineering deals with alternating current signals with frequencies ranging from 100 MHz to 1000 GHz.", "- Microwave frequencies are typically between 3 and 300 GHz, with wavelengths between 10 cm and 1 mm.", "- Standard circuit theory is often not applicable at these high frequencies due to the short wavelengths and distributed element behavior."], "image_desc": "- A diagram showing the electromagnetic spectrum with the RF and microwave frequency bands highlighted.", "narration": "माइक्रोवेव इंजीनियरिंग रेडियो फ्रीक्वेंसी (RF) और माइक्रोवेव सिग्नल के साथ काम करता है, जिनकी फ्रीक्वेंसी 100 मेगाहर्ट्ज से 1000 गीगाहर्ट्ज तक होती है। माइक्रोवेव फ्रीक्वेंसी 3 से 300 गीगाहर्ट्ज के बीच होती है, जिसकी तरंगदैर्ध्य 10 सेंटीमीटर से 1 मिलीमीटर तक होती है। इन उच्च फ्रीक्वेंसी के कारण, पारंपरिक सर्किट थ्योरी का इस्तेमाल सीधे नहीं किया जा सकता है।\n\n-", "image_url": "https://images.pexels.com/photos/12003537/pexels-photo-12003537.jpeg", "image_path": "data/videos/d771cace-cf45-4fb4-9ea7-fd7358d98003/images/image_2.webp"}, {"slide_number": "3", "title": "Applications of Microwave Engineering", "slide_type": "Image Left", "content": "- **Applications**:,- Wireless Networking and Communications,- Radar Systems,- Environmental Remote Sensing,- Medical Systems,- Satellite Communications,- Wireless Security Systems,- Microwave Heating,- Scientific Research", "image_desc": "- A collage of images depicting various applications of microwave engineering, such as a cell phone, a radar dish, a satellite, and a medical imaging device.", "narration": "माइक्रोवेव इंजीनियरिंग का इस्तेमाल कई क्षेत्रों में होता है, जैसे कि वायरलेस नेटवर्किंग, रेडार सिस्टम, सैटेलाइट कम्युनिकेशन, मेडिकल इमेजिंग, और वैज्ञानिक अनुसंधान।\n\n-", "image_url": "https://images.pexels.com/photos/7723513/pexels-photo-7723513.jpeg", "image_path": "data/videos/d771cace-cf45-4fb4-9ea7-fd7358d98003/images/image_3.webp"}, {"slide_number": "4", "title": "A Short History of Microwave Engineering", "slide_type": "Image Left", "content": ["- James Clerk Maxwell formulated the foundations of electromagnetic theory in 1873.", "- Heinrich Hertz experimentally validated Maxwell's theory in the late 19th century.", "- Microwave technology saw significant development during World War II for radar applications.", "- The field continues to evolve with advancements in solid-state devices, integrated circuits, and computer-aided design techniques."], "image_desc": "- A portrait of James Clerk Maxwell.", "narration": "माइक्रोवेव इंजीनियरिंग का इतिहास 19वीं सदी में जेम्स क्लर्क मैक्सवेल के काम से शुरू होता है, जिन्होंने इलेक्ट्रोमैग्नेटिक थ्योरी की नींव रखी। हेनरिक हर्ट्ज ने 19वीं सदी के अंत में मैक्सवेल की थ्योरी को प्रयोगों के माध्यम से सिद्ध किया। द्वितीय विश्व युद्ध के दौरान रेडार के विकास के कारण माइक्रोवेव तकनीक में तेजी आई। आज भी, सॉलिड-स्टेट डिवाइस, इंटीग्रेटेड सर्किट, और कंप्यूटर-एडेड डिजाइन तकनीकों में प्रगति के कारण यह क्षेत्र विकसित हो रहा है।\n\n-", "image_url": "https://images.pexels.com/photos/9870218/pexels-photo-9870218.jpeg", "image_path": "data/videos/d771cace-cf45-4fb4-9ea7-fd7358d98003/images/image_4.webp"}, {"slide_number": "5", "title": "Conclusion", "slide_type": "Image with Caption", "content": ["- Microwave engineering plays a crucial role in modern technology.", "- Its applications are constantly expanding, driving innovation in various fields.", "- The future of microwave engineering holds exciting possibilities for further advancements and new applications."], "image_desc": "- A futuristic image of a city with advanced wireless communication networks and technologies.", "narration": "माइक्रोवेव इंजीनियरिंग आधुनिक तकनीक में एक महत्वपूर्ण भूमिका निभाता है। इसके अनुप्रयोग लगातार विस्तारित हो रहे हैं, विभिन्न क्षेत्रों में नवाचार को बढ़ावा दे रहे हैं। माइक्रोवेव इंजीनियरिंग का भविष्य आगे की प्रगति और नए अनुप्रयोगों के लिए रोमांचक संभावनाएं रखता है।", "image_url": "/data/videos/d771cace-cf45-4fb4-9ea7-fd7358d98003/images/image_5.webp", "image_path": "data/videos/d771cace-cf45-4fb4-9ea7-fd7358d98003/images/image_5.webp"}]