[{"title": "Who is Venkateswara?", "content": ["- Venkateswara is a Hindu deity, primarily worshipped in South India.", "He is considered an incarnation of Lord Vishnu.", "He is also known as Balaji, Srinivasa, and Venkatachalapati."], "image_desc": "A depiction of Lord Venkateswara in a temple setting.", "narration": "Venkateswara, ఆంధ్రప్రదేశ్ లో చాలా ప్రసిద్ధి చెందిన దేవుడు. ఆయన విష్ణువు యొక్క అవతారం అని నమ్ముతారు. ఆయనను బాలాజీ, శ్రీనివాస, వెంకటేశ్వర అని కూడా పిలుస్తారు. \n\n#", "slide_number": "1", "image_url": "https://www.templepurohit.com/wp-content/uploads/2015/12/5.jpg", "image_path": "data\\videos\\7a642c97-093b-4ff7-8b53-d7a575d1a434\\images\\image_1.webp"}, {"title": "Origin and Significance", "content": ["- Venkateswara is believed to have been born on the seventh day of the bright half of the month of Shravana (July-August).", "He is said to have appeared on the Tirumala Hills in Andhra Pradesh.", "His temple at Tirupati is one of the most visited pilgrimage sites in the world."], "image_desc": "A panoramic view of the Tirumala Hills with the Venkateswara temple.", "narration": "Venkateswara, శ్రావణ మాసంలో ఏడవ రోజున జన్మించాడని నమ్ముతారు. ఆయన ఆంధ్రప్రదేశ్ లోని తిరుమల కొండలపై కనిపించాడని చెబుతారు. తిరుపతిలోని ఆయన ఆలయం ప్రపంచంలోనే అత్యంత సందర్శించబడిన పుణ్యక్షేత్రాలలో ఒకటి.\n\n#", "slide_number": "2", "image_url": "https://1.bp.blogspot.com/-1f2MveiiNi4/X7eim-0lLUI/AAAAAAAADSg/6yHE04wg1F8uaIS4fb7Bv2N1YMjCkeOmwCLcBGAsYHQ/s2048/Tirumala+Hill+View.jpg", "image_path": "data\\videos\\7a642c97-093b-4ff7-8b53-d7a575d1a434\\images\\image_2.webp"}, {"title": "Importance and Beliefs", "content": ["- Venkateswara is worshipped for his blessings of wealth, prosperity, and success.", "He is also believed to grant peace, happiness, and fulfillment.", "Devotees offer prayers and perform rituals to seek his favor."], "image_desc": "A devotee offering prayers at the Venkateswara temple.", "narration": "Venkateswara, ధనం, సంపద, విజయం లాంటి వరాల కోసం పూజించబడతాడు. ఆయన శాంతి, సంతోషం, సంతృప్తిని కూడా ఇస్తాడని నమ్ముతారు. భక్తులు ఆయన అనుగ్రహం కోసం ప్రార్థనలు చేస్తారు మరియు కొన్ని కర్మలు చేస్తారు.\n\n#", "slide_number": "3", "image_url": "https://devdiscourse.blob.core.windows.net/devnews/08_06_2020_11_16_09_2945428.jpg", "image_path": "data\\videos\\7a642c97-093b-4ff7-8b53-d7a575d1a434\\images\\image_3.webp"}, {"title": "Cultural Impact", "content": ["- Venkateswara is a central figure in South Indian culture and tradition.", "His image and stories are depicted in art, literature, and music.", "His festivals are celebrated with great enthusiasm and fervor."], "image_desc": "A traditional South Indian painting depicting Venkateswara.", "narration": "Venkateswara, దక్షిణ భారతీయ సంస్కృతి మరియు సంప్రదాయాలలో కేంద్ర వ్యక్తి. ఆయన చిత్రాలు మరియు కథలు కళ, సాహిత్యం, సంగీతంలో చిత్రీకరించబడ్డాయి. ఆయన పండుగలు గొప్ప ఉత్సాహం మరియు ఉత్సాహంతో జరుపుకుంటారు.", "slide_number": "4", "image_url": "https://i.pinimg.com/originals/7e/d5/e1/7ed5e15eb83060d1ef15786a0afadc01.jpg", "image_path": "data\\videos\\7a642c97-093b-4ff7-8b53-d7a575d1a434\\images\\image_4.webp"}]