[{"slide_number": "1", "title": "India vs New Zealand 1st Test - Day 4", "slide_type": "Title Slide", "content": ["- (No additional content for Title Slide)"], "image_desc": "- A photo of the Indian and New Zealand cricket teams facing each other during the match.", "narration": "Welcome to the fourth day of the first Test match between India and New Zealand!  Let's recap the highlights and see what happened in this exciting day.", "image_url": "https://i.insider.com/670dc34ca70318649281c219?width=700", "image_path": "data\\videos\\95322853-9d17-480c-b907-0e03147faab9\\images\\image_1.webp"}, {"slide_number": "2", "title": "Sarfaraz Khan's Heroics", "slide_type": "Image Right", "content": ["- Sarfaraz Khan's crucial innings of 72 runs helped India secure a crucial lead.", "- He came in at a difficult time when India was struggling at 46/4.", "- His partnership with Ravindra Jadeja helped India recover and put up a respectable total."], "image_desc": "- A photo of Sarfaraz Khan batting during the match.", "narration": "The day started with India needing to build a substantial lead.  They were struggling at 46 for 4, but then Sarfaraz Khan came in and played a brilliant innings of 72 runs.  His partnership with Ravindra Jadeja helped India recover and put up a respectable total. ", "image_url": "https://imgresizer.eurosport.com/unsafe/1200x0/filters:format(jpeg)/origin-imgresizer.eurosport.com/2024/02/15/3886877-78970468-2560-1440.jpg", "image_path": "data\\videos\\95322853-9d17-480c-b907-0e03147faab9\\images\\image_2.webp"}, {"slide_number": "3", "title": "The \"46 All Out\"", "slide_type": "Image Left", "content": ["- New Zealand's batting collapse for 46 runs in the second innings was a major talking point.", "- The Indian bowlers were relentless, taking wickets at regular intervals.", "- This collapse gave India a massive lead and put them in a strong position to win the match."], "image_desc": "- A photo of the New Zealand batting lineup looking dejected after the collapse.", "narration": "However, the day was not without its surprises.  New Zealand's batting collapsed for 46 runs in the second innings, giving India a massive lead and putting them in a strong position to win the match.  The Indian bowlers were relentless, taking wickets at regular intervals.\n\n-", "image_url": "https://p.imgci.com/db/PICTURES/CMS/371200/371210.jpg", "image_path": "data\\videos\\95322853-9d17-480c-b907-0e03147faab9\\images\\image_3.webp"}, {"slide_number": "4", "title": "Social Media Reactions", "slide_type": "Two Columns", "content": ["- **Column 1: Praise for Sarfaraz Khan**", "-  Many fans praised Sarfaraz Khan for his crucial innings.", "-  His unorthodox style of batting was lauded by many.", "-  He was hailed as a hero by many Indian fans.", "- **Column 2: Reactions to the Collapse**", "-  Fans were shocked by New Zealand's collapse.", "-  Many were amused by the Indian bowlers' dominance.", "-  The \"46 all out\" became a trending topic on social media."], "image_desc": "- A collage of screenshots from social media showing various reactions to the match.", "narration": "Social media was abuzz with reactions to the day's events.  Many fans praised Sarfaraz Khan for his crucial innings, while others were shocked by New Zealand's collapse.  The \"46 all out\" became a trending topic on social media, with many fans amused by the Indian bowlers' dominance.\n\n-", "image_url": "https://images.pexels.com/photos/6070384/pexels-photo-6070384.jpeg", "image_path": "data\\videos\\95322853-9d17-480c-b907-0e03147faab9\\images\\image_4.webp"}, {"slide_number": "5", "title": "Looking Ahead", "slide_type": "Image with Caption", "content": ["- India is in a strong position to win the match.", "- New Zealand will need a miracle to come back into the game.", "- The final day promises to be an exciting one."], "image_desc": "- A photo of the Indian team celebrating a wicket during the match.", "narration": "With a massive lead, India is in a strong position to win the match.  New Zealand will need a miracle to come back into the game.  The final day promises to be an exciting one, so stay tuned for more updates!", "image_url": "https://images.pexels.com/photos/10987828/pexels-photo-10987828.jpeg", "image_path": "data\\videos\\95322853-9d17-480c-b907-0e03147faab9\\images\\image_5.webp"}]