[{"title": "11. The Law of Perspective", "content": ["- This chapter explains the short-term and long-term effects of marketing strategies.", "Short-term gains may not always translate to long-term success."], "image_desc": "A split screen showing a lively bar on one side and people sleeping on the streets on the other side.", "narration": "Dosto, aaj hum \"The 22 Immutable Laws of Marketing\" ke Chapter 11 - \"The Law of Perspective\" ke baare mein baat karenge. Yeh chapter humein samjhata hai ki marketing ke effects short-term mein kya dikhte hain aur long-term mein kya hote hain.", "slide_number": "1", "image_url": "https://i.ytimg.com/vi/KfnLueTaZ9I/maxresdefault.jpg", "image_path": "data/videos/52b222b8-1451-470a-a14b-221a2a6102ed/images/image_1.webp"}, {"title": "Short-Term vs. Long-Term Effects", "content": ["- Short-term gains can be misleading.", "Sales and discounts can boost sales in the short term but may harm the brand in the long run."], "image_desc": "A sale sign and a crowded retail store.", "narration": "Aapne dekha hoga ki Friday night ko bar mein log bahut hi mast aur energetic lagte hain. Aisa lagta hai jaise alcohol ek stimulant ho. Lekin, jab raat ke 4 baje aap kuch logon ko sadak par soye hue dekhte hain, toh lagta hai jaise alcohol ek depressant ho. Yeh ek interesting phenomenon hai! Chemical terms mein, alcohol ek depressant hai. Lekin short-term mein, jab yeh logon ki inhibitions ko kam karta hai, tab yeh stimulant ki tarah act karta hai.", "slide_number": "2", "image_url": "https://image.freepik.com/free-vector/crowd-with-wooden-sale-signs_42845-5.jpg", "image_path": "data/videos/52b222b8-1451-470a-a14b-221a2a6102ed/images/image_2.webp"}, {"title": "The Impact of Sales and Discounts", "content": ["- Sales and discounts can lead to customers expecting lower prices.", "This can negatively impact the brand's perception and profitability."], "image_desc": "Images of various sale signs and auto rebate ads.", "narration": "Marketing mein bhi kuch similar hota hai. Short-term mein, sale aur discounts aapke business ko bada dete hain. Lekin long-term mein, yeh actually aapke business ko nuqsan pahuncha sakte hain. Aapne dekha hoga ki sale ke baad customers kaise store ki regular prices se door ho jaate hain. Yeh ek marketing ka cycle hai.", "slide_number": "3", "image_url": "https://c8.alamy.com/comp/BJNCHR/car-sale-auto-market-incentive-rebate-low-financing-leasing-rate-demo-BJNCHR.jpg", "image_path": "data/videos/52b222b8-1451-470a-a14b-221a2a6102ed/images/image_4.webp"}, {"title": "The Reality of Auto Rebates", "content": ["- Auto rebate programs may seem effective but can lead to declining sales in the long run.", "This is a common trend where short-term gains result in long-term losses."], "image_desc": "Images of various sale signs and auto rebate ads.", "narration": "Ab baat karte hain auto rebate programs ki. Aapko lagta hai ki yeh sales ko increase karte hain, lekin reality yeh hai ki USA mein auto sales decline kar rahi hai. Yeh ek trend hai jismein short-term gains long-term mein losses ko lead karte hain.", "slide_number": "4", "image_url": "https://c8.alamy.com/comp/BJNCHR/car-sale-auto-market-incentive-rebate-low-financing-leasing-rate-demo-BJNCHR.jpg", "image_path": "data/videos/52b222b8-1451-470a-a14b-221a2a6102ed/images/image_4.webp"}, {"title": "The Cycle of Continuous Sales", "content": ["- Retail outlets often rely on continuous sales to maintain sales volume.", "This creates a dependency on promotions and can lead to a decline in sales when promotions stop."], "image_desc": "A retail store with continuous sale signs and a graph showing a decline.", "narration": "Retail outlets ko lagataar sales run karni padti hain kyunki agar woh stop karenge toh sales drop off ho jaati hain. Couponing bhi ek tarah ka drug hai – aap isse tab tak use karte hain jab tak withdrawal symptoms bearable hain. Jab aap couponing band kar dete hain, toh sales drop ho jaati hain.", "slide_number": "5", "image_url": "https://thumbs.dreamstime.com/b/3d-business-decline-graph-6508870.jpg", "image_path": "data/videos/52b222b8-1451-470a-a14b-221a2a6102ed/images/image_5.webp"}, {"title": "Everyday Low Prices: A Long-Term Strategy", "content": ["- Companies like Wal-Mart and K-Mart focus on everyday low prices, aiming for long-term success.", "This strategy avoids the need for frequent sales and discounts."], "image_desc": "Wal-Mart and K-Mart stores with ‘Everyday Low Prices' signs.", "narration": "Isi tarah se, ‘Everyday Low Prices' wale companies, jaise Wal-Mart aur K-Mart, market mein bahut successful hain. Yeh companies long-term success ko target karti hain bina kisi sales aur discounts ke.", "slide_number": "6", "image_url": "https://c8.alamy.com/comp/T23MMB/everyday-low-price-sign-in-us-walmart-T23MMB.jpg", "image_path": "data/videos/52b222b8-1451-470a-a14b-221a2a6102ed/images/image_6.webp"}, {"title": "The Impact of Line Extension", "content": ["- Line extension can boost sales initially but can dilute the brand's value in the long run.", "This can lead to a decline in sales for existing products."], "image_desc": "Historical data of beer sales with Miller, Michelob, and Coors.", "narration": "Aapne dekha hoga ki line extension ka short-term effect positive hota hai. Jaise Miller High Life ne 1970s mein bahut achhi growth dekhi, lekin jab Miller Lite introduce hua, toh High Life ki sales 13 saalon tak decline hoti rahi. Ye trend Miller Lite aur Michelob Light ke sath bhi dekha gaya.", "slide_number": "7", "image_url": "https://www.earnestanalytics.com/wp-content/uploads/2023/05/image-42.png", "image_path": "data/videos/52b222b8-1451-470a-a14b-221a2a6102ed/images/image_7.webp"}, {"title": "The Downside of Brand Extension", "content": ["- Extending a brand to multiple products can lead to a dilution of its value.", "This can result in a negative impact on the brand's overall success."], "image_desc": "A graph with rising and falling sales data.", "narration": "Yeh sab examples yeh show karte hain ki line extension se short-term mein sales zaroor badhati hain, lekin long-term mein woh negative impact dalti hain. Jab aap ek brand ko extend karte hain, toh yeh existing brand ki value ko dilute kar deti hai.", "slide_number": "8", "image_url": "https://thumbs.dreamstime.com/b/rise-fall-chart-financial-data-showing-rising-falling-trend-d-render-60471027.jpg", "image_path": "data/videos/52b222b8-1451-470a-a14b-221a2a6102ed/images/image_8.webp"}, {"title": "Donald Trump: A Case Study", "content": ["- Donald Trump's extensive brand extensions initially boosted his success but ultimately contributed to his financial struggles.", "This exemplifies the potential pitfalls of excessive brand extension."], "image_desc": "Donald Trump's various ventures and his debt status.", "narration": "Donald Trump ki story bhi similar hai. Unhone apne naam ko kai cheezon pe lagaya – hotels, casinos, airlines, aur kya nahi. Lekin line extension ne unki success ko short-term mein to increase kiya, lekin long-term mein yeh unki failure ka reason ban gaya. Aaj Trump $1.4 billion ke debt mein hain.", "slide_number": "9", "image_url": "https://static01.nyt.com/images/2016/06/03/us/00trumpbiz/00trumpbiz-superJumbo.jpg", "image_path": "data/videos/52b222b8-1451-470a-a14b-221a2a6102ed/images/image_9.webp"}, {"title": "Conclusion: Perspective in Marketing", "content": ["- Understanding the short-term and long-term effects of marketing strategies is crucial for success.", "It's essential to consider the impact of line extensions and sales discounts on the brand's overall value."], "image_desc": "A concluding message.", "narration": "Dosto, marketing koi aasan game nahi hai. Aapko short-term gains aur long-term losses ko samajhna zaroori hai. Line extension aur sales discounts ko samajhkar hi aap marketing mein successful ho sakte hain. Toh, agle chapter tak ke liye, apni marketing strategies ko perspective mein rakhein aur soch samajh kar decisions lein.", "slide_number": "10", "image_url": "https://www.immerse.education/wp-content/uploads/2023/02/How-To-End-A-Personal-Statement-Tips-1.jpg", "image_path": "data/videos/52b222b8-1451-470a-a14b-221a2a6102ed/images/image_10.webp"}, {"title": "Subscribe, Like, and Share", "content": ["- Subscribe to our channel for more marketing insights.", "Like and share this video with your friends."], "image_desc": "Subscribe, Like, and Share prompts appear on the screen.", "narration": "Agar aapko yeh video pasand aayi ho, toh like aur share zaroor karein aur hamare channel ko subscribe karna na bhoolein. Milte hain agle chapter mein, tab tak ke liye, khush rahiye aur smart marketing karte rahiye! Dhanyavaad!", "slide_number": "11", "image_url": "/data/videos/52b222b8-1451-470a-a14b-221a2a6102ed/images/image_11.webp", "image_path": "data/videos/52b222b8-1451-470a-a14b-221a2a6102ed/images/image_11.webp"}]