[{"slide_number": "1", "title": "Introduction to Microwave Engineering", "slide_type": "Title Slide", "content": ["- (No additional content for Title Slide)"], "image_desc": "- A colorful image of a microwave antenna dish pointing towards the sky.", "narration": "नमस्ते! आज हम माइक्रोवेव इंजीनियरिंग के बारे में जानेंगे। \n\n-", "image_url": "/data/videos/ad14f54a-341a-4c6d-9538-e93c149b910a/images/image_1.webp", "image_path": "data/videos/ad14f54a-341a-4c6d-9538-e93c149b910a/images/image_1.webp"}, {"slide_number": "2", "title": "What is Microwave Engineering?", "slide_type": "Image Left", "content": ["- Microwave engineering is the study of the behavior of electromagnetic waves in the microwave frequency range.", "- This frequency range is from 300 MHz to 300 GHz, with corresponding wavelengths from 1 meter to 1 millimeter.", "- Microwave engineering deals with the design, analysis, and application of microwave components and systems."], "image_desc": "- A close-up image of a microwave circuit board with various components.", "narration": "माइक्रोवेव इंजीनियरिंग, ये एक ऐसा क्षेत्र है जहाँ हम माइक्रोवेव फ्रीक्वेंसी रेंज में इलेक्ट्रोमैग्नेटिक वेव्स के व्यवहार का अध्ययन करते हैं। ये फ्रीक्वेंसी रेंज 300 MHz से 300 GHz तक होती है, जिसकी wavelength  1 मीटर से 1 मिलीमीटर तक होती है। माइक्रोवेव इंजीनियरिंग में माइक्रोवेव कंपोनेंट्स और सिस्टम के डिजाइन, analysis और application शामिल होते हैं।\n\n-", "image_url": "/data/videos/ad14f54a-341a-4c6d-9538-e93c149b910a/images/image_2.webp", "image_path": "data/videos/ad14f54a-341a-4c6d-9538-e93c149b910a/images/image_2.webp"}, {"slide_number": "3", "title": "Applications of Microwave Engineering", "slide_type": "Image Left", "content": "- Wireless Communications,- Radar Systems,- Satellite Communications,- Medical Imaging,- Microwave Heating,-  Remote Sensing,- Industrial Applications,- Scientific Research,- Security Systems,- High-speed Data Transmission", "image_desc": "- A collage of images showing various applications of microwave engineering, such as a smartphone, a radar dish, a satellite, a medical scanner, and a microwave oven.", "narration": "माइक्रोवेव इंजीनियरिंग के बहुत सारे उपयोग हैं।  जैसे वायरलेस कम्युनिकेशन, रेडार सिस्टम, सैटेलाइट कम्युनिकेशन, मेडिकल इमेजिंग, माइक्रोवेव हीटिंग, रिमोट सेंसिंग, इंडस्ट्रियल एप्लीकेशन, साइंटिफिक रिसर्च, सिक्योरिटी सिस्टम और हाई-स्पीड डेटा ट्रांसमिशन।\n\n-", "image_url": "https://images.pexels.com/photos/26859038/pexels-photo-26859038.jpeg", "image_path": "data/videos/ad14f54a-341a-4c6d-9538-e93c149b910a/images/image_3.webp"}, {"slide_number": "4", "title": "Importance of Microwave Engineering", "slide_type": "Image Right", "content": ["- Microwave engineering plays a crucial role in modern technology.", "- It enables high-speed data transmission, wireless communication, and advanced imaging techniques.", "- It is essential for various industries, including telecommunications, aerospace, healthcare, and defense."], "image_desc": "- A futuristic image of a city with numerous communication towers and satellites orbiting the Earth.", "narration": "माइक्रोवेव इंजीनियरिंग आधुनिक तकनीक में बहुत महत्वपूर्ण भूमिका निभाता है। यह हाई-स्पीड डेटा ट्रांसमिशन, वायरलेस कम्युनिकेशन और एडवांस्ड इमेजिंग तकनीकों को सक्षम करता है। यह टेलीकम्युनिकेशन, एयरोस्पेस, हेल्थकेयर और डिफेंस जैसे विभिन्न उद्योगों के लिए आवश्यक है।\n\n-", "image_url": "https://images.pexels.com/photos/17384797/pexels-photo-17384797.jpeg", "image_path": "data/videos/ad14f54a-341a-4c6d-9538-e93c149b910a/images/image_4.webp"}, {"slide_number": "5", "title": "Conclusion", "slide_type": "Image with Caption", "content": ["- Microwave engineering is a fascinating and rapidly evolving field.", "- It offers exciting opportunities for innovation and technological advancement.", "- As technology continues to advance, the importance of microwave engineering will only grow."], "image_desc": "- A close-up image of a person working on a microwave circuit board with a soldering iron.", "narration": "माइक्रोवेव इंजीनियरिंग एक रोमांचक और तेजी से विकसित हो रहा क्षेत्र है। यह नवाचार और तकनीकी प्रगति के लिए रोमांचक अवसर प्रदान करता है। जैसे-जैसे तकनीक आगे बढ़ती है, माइक्रोवेव इंजीनियरिंग का महत्व बढ़ता ही जाएगा।", "image_url": "https://thumbs.dreamstime.com/z/technician-using-soldering-iron-to-repair-circuit-board-277010488.jpg", "image_path": "data/videos/ad14f54a-341a-4c6d-9538-e93c149b910a/images/image_5.webp"}]