[{"slide_number": "1", "title": "Integrated Circuit Size and Complexity", "slide_type": "Title Slide", "content": "(No additional content for Title Slide)", "image_desc": "A microscopic image of a complex integrated circuit.", "narration": "Welcome to this presentation on the size and complexity of integrated circuits. We'll explore how these tiny devices have revolutionized technology.", "image_url": "http://www.magicdave.com/private/browse/2018-01-30-18.55.jpg", "image_path": "data/videos/9e6a2c13-c00c-4ead-9c07-6a137734d702/images/image_1.webp"}, {"slide_number": "2", "title": "Classification by Device Count", "slide_type": "Table of Contents", "content": "SSI (Small-Scale Integration)\nMSI (Medium-Scale Integration)\nLSI (Large-Scale Integration)\nVLSI (Very-Large-Scale Integration)\nULSI (Ultra-Large-Scale Integration)\nGSI (Giga-Scale Integration)", "image_desc": "A table showing the device count ranges for each integration level.", "narration": "First, let's look at how we classify integrated circuits based on the number of devices they contain.  We'll cover SSI, MSI, LSI, VLSI, ULSI, and GSI, each representing a significant jump in complexity and capability.", "image_url": "https://i.ytimg.com/vi/AUvcSrOkmwI/maxresdefault.jpg", "image_path": "data/videos/9e6a2c13-c00c-4ead-9c07-6a137734d702/images/image_2.webp"}, {"slide_number": "3", "title": "SSI, MSI, LSI", "slide_type": "Two Columns", "content": "**SSI & MSI**\nSSI:  Few transistors (tens)\nMSI: Hundreds of transistors\n**LSI & Beyond**\nLSI: Thousands of transistors\nVLSI: Millions of transistors\nULSI: Tens of millions to billions of transistors\nGSI: Billions of transistors and beyond", "image_desc": "A graphic comparing the relative sizes of chips representing SSI, MSI, and LSI.", "narration": "Small-Scale Integration (SSI) contained only a few tens of transistors, while Medium-Scale Integration (MSI) had hundreds.  Large-Scale Integration (LSI) brought us into the thousands.  This rapid increase in transistor density continued with Very Large-Scale Integration (VLSI), Ultra-Large-Scale Integration (ULSI), and now Giga-Scale Integration (GSI), each representing a monumental leap in processing power.", "image_url": "https://miro.medium.com/max/826/1*BbewHDAzA8oRR6TV-yjX7w.png", "image_path": "data/videos/9e6a2c13-c00c-4ead-9c07-6a137734d702/images/image_3.webp"}, {"slide_number": "4", "title": "Feature Size and Complexity", "slide_type": "Image Right", "content": "Minimum Feature Size:  Determines the smallest detail that can be manufactured on a chip.\nPitch: Twice the minimum feature size.\nEarly 1970s: 7-10 micrometers\nLate 1970s/Early 1980s: 5 micrometers\nLate 1980s: Under 2 micrometers", "image_desc": "A diagram showing the relationship between minimum feature size and pitch on an integrated circuit.", "narration": "The complexity isn't just about the number of transistors; it's also about the feature size.  The minimum feature size, often half the pitch, dictates how small the components can be.  Early chips had feature sizes of seven to ten micrometers, shrinking to five micrometers and then under two micrometers by the late 1980s.  This miniaturization has been crucial to the exponential growth in computing power.", "image_url": "https://image.slideserve.com/59716/slide4-l.jpg", "image_path": "data/videos/9e6a2c13-c00c-4ead-9c07-6a137734d702/images/image_4.webp"}, {"slide_number": "5", "title": "The City Analogy", "slide_type": "Title Slide", "content": "(No additional content for this slide type)", "image_desc": "A high-magnification image of an integrated circuit, visually resembling a city map.  The caption reads: \"The City Analogy:  A dense integrated circuit under a microscope resembles a city map, with interconnections like streets.\"", "narration": "To grasp the scale, think of an analogy:  a dense integrated circuit under a high-powered microscope looks like a city map.  The interconnections are like streets, and the pitch of the process is like the size of a city block.  This helps visualize the incredible density and complexity of modern integrated circuits.", "image_url": "https://docs.smartscope.org/usage/report/assets/hm_rating_colors.png", "image_path": "data/videos/9e6a2c13-c00c-4ead-9c07-6a137734d702/images/image_5.webp"}, {"slide_number": "6", "title": "Conclusion", "slide_type": "Table of Contents", "content": "Integrated circuits have dramatically increased in complexity over time.\nMiniaturization and increased transistor density are key factors.\nThe city analogy helps visualize the scale of modern chips.", "image_desc": "A photo of a modern smartphone, highlighting the vast computing power packed into a small device.", "narration": "In conclusion, the size and complexity of integrated circuits have grown exponentially.  Miniaturization and the relentless increase in transistor density have driven this progress, leading to the powerful devices we use every day.  The city analogy helps us appreciate the incredible engineering feat that is a modern integrated circuit.", "image_url": "https://thumbs.dreamstime.com/b/modern-technology-smartphone-23018633.jpg", "image_path": "data/videos/9e6a2c13-c00c-4ead-9c07-6a137734d702/images/image_6.webp"}]