[{"title": "What is IoT Network?", "content": ["- A network of physical objects or people (\"things\") embedded with software, electronics, network, and sensors.", "These objects collect and exchange data.", "Goal: Extend internet connectivity from standard devices (computer, mobile, tablet) to relatively dumb devices (toaster).", "Makes virtually everything \"smart\" by improving aspects of our life with the power of data collection, AI algorithms, and networks.", "Examples of \"things\" include a diabetes monitor implant, an animal with tracking devices, etc."], "image_desc": "A diagram showing various interconnected devices like a smartphone, a smart refrigerator, a smart thermostat, and a smart car, all connected to the internet through a cloud platform.", "narration": "Welcome to this presentation on the Internet of Things, or IoT.  Imagine a world where your appliances, your car, and even your pets are connected to the internet, sharing data and interacting with each other. This is the world of IoT. It's a network of physical objects, or \"things,\" that are embedded with sensors, software, and connectivity, allowing them to collect and exchange data. The goal of IoT is to extend the power of the internet beyond our computers and phones to everyday objects, making them \"smart\" and improving our lives.", "slide_number": "1", "image_url": "https://www.zywave.ca/wp-content/uploads/sites/10/2019/07/Interconnected-Smart-Devices-e1553624773348-768x512.jpg", "image_path": "data\\videos\\f3415d90-e9a1-4f4c-9c03-f2b3b4ce5251\\images\\image_1.webp"}, {"title": "How IoT Works", "content": ["- The IoT process starts with devices like smartphones, smartwatches, and electronic appliances.", "Four fundamental components of an IoT system:\n    - Sensors/Devices\n    - Connectivity\n    - Data Processing\n    - User Interface"], "image_desc": "A flowchart illustrating the four components of an IoT system, starting with sensors/devices collecting data, then transmitting it through connectivity to a cloud platform for data processing, and finally displaying the results to the user through a user interface.", "narration": "So how does this IoT magic happen? It all starts with the devices themselves - your smartphone, your smartwatch, your smart appliances. These devices are equipped with sensors that collect data about their surroundings. This data is then transmitted to a cloud platform through various communication mediums like Wi-Fi, Bluetooth, or cellular networks. Once the data reaches the cloud, software processes it, analyzing the information and making decisions based on pre-programmed rules. Finally, the results are presented to the user through a user interface, like an app on their phone or a notification on their smart speaker.", "slide_number": "2", "image_url": "https://cdn.educba.com/academy/wp-content/uploads/2020/01/Components-of-IoT.jpg", "image_path": "data\\videos\\f3415d90-e9a1-4f4c-9c03-f2b3b4ce5251\\images\\image_2.webp"}, {"title": "Sensors/Devices", "content": ["- Sensors are the key component that collect live data from the environment.", "Data can be simple (temperature) or complex (video feed).", "Devices can have multiple sensors performing different tasks.", "Example: A mobile phone is a device with multiple sensors (GPS, camera) but it doesn't \"sense\" these things on its own."], "image_desc": "A close-up image of a smartphone with various sensors highlighted, including a camera, microphone, GPS, and accelerometer.", "narration": "Let's dive deeper into the first component: Sensors/Devices. These are the heart of IoT, responsible for collecting data from the real world.  Sensors can be as simple as a temperature sensor or as complex as a video camera.  A single device can have multiple sensors, each performing a different task. For example, your smartphone has a camera, a GPS sensor, and an accelerometer, but it doesn't \"sense\" these things on its own. It's the software and the network that bring these sensors to life.", "slide_number": "3", "image_url": "https://4.bp.blogspot.com/-HmPGzPRwRZM/XEvTqHT9rvI/AAAAAAAAPN8/I-v_TDfkrsILdwJCGZuK38JLRCN8RauFACLcBGAs/s640/smartphone-sensors-2.jpg", "image_path": "data\\videos\\f3415d90-e9a1-4f4c-9c03-f2b3b4ce5251\\images\\image_3.webp"}, {"title": "Connectivity", "content": ["- Collected data is sent to a cloud infrastructure.", "Sensors connect to the cloud using various communication mediums:\n    - Mobile or satellite networks\n    - Bluetooth\n    - Wi-Fi\n    - WAN (Wide Area Network)"], "image_desc": "A diagram showing a sensor device connected to the cloud through various communication mediums like Wi-Fi, Bluetooth, and cellular networks.", "narration": "Once the sensors have collected data, it needs to be transmitted to a cloud platform for processing. This is where connectivity comes in.  Sensors can connect to the cloud using various communication mediums, including mobile or satellite networks, Bluetooth, Wi-Fi, and WAN (Wide Area Network).  The choice of communication medium depends on the specific application and the location of the sensor.", "slide_number": "4", "image_url": "https://static.electronicsweekly.com/wp-content/uploads/2018/08/30095157/Semtech-SmartParking-UseCaseDiagram.jpg", "image_path": "data\\videos\\f3415d90-e9a1-4f4c-9c03-f2b3b4ce5251\\images\\image_4.webp"}, {"title": "Data Processing", "content": ["- Software processes the collected data in the cloud.", "Processing can be simple (checking temperature) or complex (object identification using computer vision)."], "image_desc": "A diagram showing a cloud platform with data being processed and analyzed, with various algorithms and data visualization tools highlighted.", "narration": "The cloud platform is where the magic really happens.  Software on the cloud analyzes the data collected by the sensors, performing various calculations and making decisions based on pre-programmed rules. This processing can be as simple as checking the temperature of a room or as complex as identifying objects in a video feed using computer vision.", "slide_number": "5", "image_url": "https://d2908q01vomqb2.cloudfront.net/b6692ea5df920cad691c20319a6fffd7a4a766b8/2021/12/13/BDB-1638-image001-NEW.png", "image_path": "data\\videos\\f3415d90-e9a1-4f4c-9c03-f2b3b4ce5251\\images\\image_5.webp"}, {"title": "User Interface", "content": ["- Information is presented to the user through various interfaces:\n    - Phone alarms\n    - Email notifications\n    - Text messages\n    - Web interfaces", "Users can also interact with the IoT system and trigger actions."], "image_desc": "A smartphone screen displaying a user interface with various data points from an IoT system, including temperature readings, security camera feeds, and appliance status.", "narration": "Finally, the processed data needs to be presented to the user in a meaningful way. This is where the user interface comes in.  Information can be presented through phone alarms, email notifications, text messages, or web interfaces.  But it's not always one-way communication.  Depending on the application, users can also interact with the IoT system, triggering actions like adjusting the temperature of their thermostat or locking their smart door.", "slide_number": "6", "image_url": "https://img.freepik.com/premium-photo/smart-home-technology-user-touches-virtual-screen-manage-smart-home-features-including-security-lighting-temperature-smart-home-iot-concept_35148-10059.jpg", "image_path": "data\\videos\\f3415d90-e9a1-4f4c-9c03-f2b3b4ce5251\\images\\image_6.webp"}]