[{"slide_number": "1", "title": "Design Objectives of IoT Architecture", "slide_type": "Title Slide", "content": "(RGPV., Dec. 2020, Nov. 2022)  ", "image_desc": "[Image Description in English only: A futuristic city with interconnected devices and sensors, showcasing the concept of IoT.]", "narration": "Welcome to this presentation on the Discuss the design objectives of IOT ' architecture needed to target a horizontal system of real-world services. \n", "image_url": "https://thumbs.dreamstime.com/b/dynamic-world-internet-things-iot-showcasing-diverse-range-interconnected-devices-ai-generated-objects-seamlessly-278298412.jpg", "image_path": "data/videos/b39d4a15-4595-4223-96d4-746e38373ca9/images/image_1.webp"}, {"slide_number": "2", "title": "Focus on Value", "slide_type": "Image Right", "content": "User research and service design are crucial.\nDetermine valuable features relevant to target users.\nConsider early adopters and mainstream users.", "image_desc": "[Image Description in English only: A group of people using various smart devices, highlighting the importance of user research and understanding their needs in IoT.]", "narration": "The first objective is to focus on value. In the world of IoT, user research and service design are more important than ever. To decide on your feature set, you need to understand your target audience and what they find valuable. Features that might be appealing to early adopters may not be interesting to the majority of users, and vice versa.", "image_url": "https://thumbs.dreamstime.com/b/group-multiethnic-people-connected-digital-devices-concept-58365710.jpg", "image_path": "data/videos/b39d4a15-4595-4223-96d4-746e38373ca9/images/image_2.webp"}, {"slide_number": "3", "title": "Take a Holistic View", "slide_type": "Image Right", "content": "Design for the entire system, not just individual touchpoints.\nConsider the role of each device and service.\nUnderstand the user's perception and interaction with the system.", "image_desc": "[Image Description in English only: A diagram illustrating the interconnectedness of various IoT devices and services, emphasizing a holistic approach to design.]", "narration": "Next, it's crucial to take a holistic view. It's not enough to design one touchpoint well. You need to consider the entire system, the role of each device and service, and how the user understands and interacts with the system.", "image_url": "https://dgtlinfra.com/wp-content/uploads/2022/11/Layers-in-Internet-of-Things-IoT-Architecture.jpg", "image_path": "data/videos/b39d4a15-4595-4223-96d4-746e38373ca9/images/image_3.webp"}, {"slide_number": "4", "title": "Put Safety First", "slide_type": "Image Right", "content": "Prioritize data security and privacy.\nEnsure user trust in data protection.\nProtect against hacking and unauthorized access.", "image_desc": "[Image Description in English only: A padlock icon with a shield, symbolizing data security and privacy in IoT.]", "narration": "Safety is paramount in IoT. This means considering data security and privacy as key elements of the design. Users need to feel confident that their private data is safe, their homes and workplaces are secure, and their everyday objects cannot be hacked.", "image_url": "https://as1.ftcdn.net/v2/jpg/02/33/98/02/1000_F_233980257_Mwl74v9jnfrTel4WQmShfHF1CjwXXwXj.jpg", "image_path": "data/videos/b39d4a15-4595-4223-96d4-746e38373ca9/images/image_4.webp"}, {"slide_number": "5", "title": "Consider the Context", "slide_type": "Image Right", "content": "Account for unexpected events and real-world scenarios.\nDesign for different physical contexts and user needs.\nMinimize distractions and enhance user experience.", "image_desc": "[Image Description in English only: A person using a smart home device in different environments, highlighting the importance of contextual design in IoT.]", "narration": "Real-world contexts can be unpredictable. You need to design for unexpected events and different physical environments. For example, in a noisy environment, the goal might be to minimize distractions for the user.", "image_url": "https://www.frontiersin.org/files/Articles/1277976/fdata-06-1277976-HTML/image_m/fdata-06-1277976-g001.jpg", "image_path": "data/videos/b39d4a15-4595-4223-96d4-746e38373ca9/images/image_5.webp"}, {"slide_number": "6", "title": "Use Data Responsibly", "slide_type": "Image Right", "content": "Understand the potential of data science and analytics.\nLeverage data to improve user experience and services.\nEnsure ethical and responsible data collection and usage.", "image_desc": "[Image Description in English only: A data visualization chart with insights derived from IoT data, emphasizing the responsible use of data in IoT.]", "narration": "Finally, IoT solutions can generate a vast amount of data. Designers need to understand the possibilities of data science and how to make sense of this data. Understanding what data is available and how it can be used to improve the user experience is crucial for designing successful IoT services.", "image_url": "https://iot-analytics.com/wp/wp-content/uploads/2022/03/Enterprise-IoT-market-2019–2027-min.png", "image_path": "data/videos/b39d4a15-4595-4223-96d4-746e38373ca9/images/image_6.webp"}, {"slide_number": "7", "title": "Conclusion", "slide_type": "Image with Caption", "content": "(No additional content for this slide)", "image_desc": "[Image Description in English only: A stylized image representing a connected world with IoT devices, emphasizing the potential and importance of well-designed IoT systems.]", "narration": "By focusing on these design objectives, we can create IoT systems that are valuable, user-centric, secure, and adaptable to real-world contexts. This will pave the way for a future where IoT seamlessly enhances our lives and empowers us with new possibilities.", "image_url": "https://img.freepik.com/premium-photo/interconnected-world-iot-visualizing-network-nodes-devices-connections-generative-ai_825385-205.jpg?w=2000", "image_path": "data/videos/b39d4a15-4595-4223-96d4-746e38373ca9/images/image_7.webp"}]