[{"title": "Govardhanadhārī, Giridhārī, Lord Kṛṣṇa", "content": ["- Today is the day Lord Kṛṣṇa lifted the mountain Govardhana.", "This event is known as Govardhana-pūjā.", "This day is celebrated annually to commemorate this event."], "image_desc": "A depiction of Lord Kṛṣṇa lifting the Govardhana Hill, with cowherds and cows around him.", "narration": "Govardhana Puja Lecture by srila Prabhupada. Today, we celebrate the day Lord Kṛṣṇa, also known as Giridhārī, lifted the mountain Govardhana. This event is known as Govardhana-pūjā, and it is celebrated annually to commemorate this miraculous event.", "slide_number": "1", "image_url": "http://2.bp.blogspot.com/-z4D6-Bgpc-Y/VA16FOfzgNI/AAAAAAAAD2k/yt6OBmFwVgM/s1600/Krishna+lifting+Govardhan+Hill+and+giving+shelter+to+Vrajwasi.jpg", "image_path": "data\\videos\\4c6f63b4-e9a4-41c1-95d0-0612ae9d64e5\\images\\image_1.webp"}, {"title": "The Story of Govardhana-puja", "content": ["- According to Vedic literature, there are many demigods who control various aspects of the material world.", "Indra, the king of heaven, controls the rain.", "The people of Vṛndāvana, where Kṛṣṇa lived, performed an annual sacrifice to Indra to ensure good rains."], "image_desc": "A depiction of Indra riding on his elephant, Airavata, in the heavens.", "narration": "According to Vedic literature, there are many demigods who control various aspects of the material world. For example, Indra, the king of heaven, controls the rain. The people of Vṛndāvana, where Kṛṣṇa lived, were farmers and depended on good rains for their crops. Therefore, they performed an annual sacrifice to Indra to ensure good rains.", "slide_number": "2", "image_url": "https://thumbs.dreamstime.com/b/lord-indra-king-devas-puts-garland-given-to-him-sage-durvasa-his-elephant-airavat-lord-indra-his-elephant-166466444.jpg", "image_path": "data\\videos\\4c6f63b4-e9a4-41c1-95d0-0612ae9d64e5\\images\\image_2.webp"}, {"title": "Kṛṣṇa's Questioning", "content": ["- Kṛṣṇa, although a young boy, was the Supreme Personality of Godhead.", "He knew everything, but He pretended to be ignorant and questioned His father, Nanda Mahārāja, about the sacrifice.", "Kṛṣṇa asked His father about the purpose, the beneficiary, and the method of the sacrifice."], "image_desc": "A depiction of young Kṛṣṇa sitting with His father, Nanda Mahārāja, and other elders, asking them questions about the sacrifice.", "narration": "Kṛṣṇa, although a young boy, was the Supreme Personality of Godhead. He knew everything, but He pretended to be ignorant and questioned His father, Nanda Mahārāja, about the sacrifice. Kṛṣṇa asked His father about the purpose, the beneficiary, and the method of the sacrifice.", "slide_number": "3", "image_url": "https://i.pinimg.com/474x/ef/18/93/ef1893fd2ffb04b6c141f4f08dd04d0a--hindu-deities-lord-krishna.jpg", "image_path": "data\\videos\\4c6f63b4-e9a4-41c1-95d0-0612ae9d64e5\\images\\image_3.webp"}, {"title": "Nanda Mahārāja's Explanation", "content": ["- Nanda Mahārāja explained that the sacrifice was to appease Indra, the rain god.", "He said that Indra controls the rain, which is essential for agriculture and life.", "He emphasized the importance of following the Vedic tradition of offering sacrifices to the demigods."], "image_desc": "A depiction of Nanda Mahārāja explaining the importance of the sacrifice to Indra to Kṛṣṇa and the other cowherds.", "narration": "Nanda Mahārāja explained that the sacrifice was to appease Indra, the rain god. He said that Indra controls the rain, which is essential for agriculture and life. He emphasized the importance of following the Vedic tradition of offering sacrifices to the demigods.", "slide_number": "4", "image_url": "https://c8.alamy.com/comp/G8C604/nanda-and-other-cowherds-moving-to-vrindavana-based-on-the-story-of-G8C604.jpg", "image_path": "data\\videos\\4c6f63b4-e9a4-41c1-95d0-0612ae9d64e5\\images\\image_4.webp"}, {"title": "Kṛṣṇa's Atheistic Argument", "content": ["- Kṛṣṇa presented an atheistic argument, similar to the karma-mimāṁsā philosophy.", "He argued that everyone is born and dies according to their karma, and that even if there is a God, He is obliged to give results based on our actions.", "He questioned the need to appease Indra, suggesting that we should focus on our own work and duties."], "image_desc": "A depiction of Kṛṣṇa explaining His atheistic argument to His father and the other cowherds.", "narration": "Kṛṣṇa presented an atheistic argument, similar to the karma-mimāṁsā philosophy. He argued that everyone is born and dies according to their karma, and that even if there is a God, He is obliged to give results based on our actions. He questioned the need to appease Indra, suggesting that we should focus on our own work and duties.", "slide_number": "5", "image_url": "http://www.photodharma.net/Indonesia/26-Krishnas-Story/images/B-007-Krishna-amongst-the-Cowherds-Thumb.jpg", "image_path": "data\\videos\\4c6f63b4-e9a4-41c1-95d0-0612ae9d64e5\\images\\image_5.webp"}, {"title": "The Importance of Dharma", "content": ["- Kṛṣṇa emphasized the importance of following one's dharma, or natural duty.", "He said that everyone is controlled by the modes of nature and should perform their work according to their nature.", "He condemned those who abandon their own profession and take up others, comparing them to unchaste women."], "image_desc": "A depiction of Kṛṣṇa explaining the importance of dharma to His father and the other cowherds.", "narration": "Kṛṣṇa emphasized the importance of following one's dharma, or natural duty. He said that everyone is controlled by the modes of nature and should perform their work according to their nature. He condemned those who abandon their own profession and take up others, comparing them to unchaste women.", "slide_number": "6", "image_url": "http://www.prabhupadaconnect.com/Krishna-Balarama-and-cowherd-boys.jpg", "image_path": "data\\videos\\4c6f63b4-e9a4-41c1-95d0-0612ae9d64e5\\images\\image_6.webp"}, {"title": "The Sāṅkhya Philosophy", "content": ["- Kṛṣṇa presented the sāṅkhya philosophy, which states that the universe is created and maintained by the interaction of the three modes of material nature: goodness, passion, and ignorance.", "He argued that rain is caused by the heat and evaporation of water, and that there is no need to worship Indra."], "image_desc": "A depiction of Kṛṣṇa explaining the sāṅkhya philosophy to His father and the other cowherds.", "narration": "Kṛṣṇa presented the sāṅkhya philosophy, which states that the universe is created and maintained by the interaction of the three modes of material nature: goodness, passion, and ignorance. He argued that rain is caused by the heat and evaporation of water, and that there is no need to worship Indra.", "slide_number": "7", "image_url": "http://www.photodharma.net/Indonesia/26-Krishnas-Story/images/B-007-Krishna-amongst-the-Cowherds-Thumb.jpg", "image_path": "data\\videos\\4c6f63b4-e9a4-41c1-95d0-0612ae9d64e5\\images\\image_7.webp"}, {"title": "The Worship of Govardhana", "content": ["- Kṛṣṇa's arguments convinced His father and the other cowherds to stop the sacrifice to Indra.", "Kṛṣṇa suggested that they should worship Govardhana Hill, where He herded His cows.", "This act of worship is symbolic of our dependence on the natural world and our need to respect and protect it."], "image_desc": "A depiction of Kṛṣṇa and the cowherds worshipping Govardhana Hill.", "narration": "Kṛṣṇa's arguments convinced His father and the other cowherds to stop the sacrifice to Indra. Kṛṣṇa suggested that they should worship Govardhana Hill, where He herded His cows. This act of worship is symbolic of our dependence on the natural world and our need to respect and protect it.", "slide_number": "8", "image_url": "https://back2godhead.com/wp-content/uploads/2013/01/129_1977_12-11-34.jpg", "image_path": "data\\videos\\4c6f63b4-e9a4-41c1-95d0-0612ae9d64e5\\images\\image_8.webp"}, {"title": "Indra's Wrath", "content": ["- Indra, angered by the cancellation of the sacrifice, sent torrential rains upon Vṛndāvana.", "The people of Vṛndāvana were in distress, and they turned to Kṛṣṇa for protection.", "Kṛṣṇa lifted Govardhana Hill, sheltering the people and their cows from the rain for seven days."], "image_desc": "A depiction of Indra sending torrential rains upon Vṛndāvana, with Kṛṣṇa lifting Govardhana Hill to protect the people.", "narration": "Indra, angered by the cancellation of the sacrifice, sent torrential rains upon Vṛndāvana. The people of Vṛndāvana were in distress, and they turned to Kṛṣṇa for protection. Kṛṣṇa lifted Govardhana Hill, sheltering the people and their cows from the rain for seven days.", "slide_number": "9", "image_url": "http://2.bp.blogspot.com/-z4D6-Bgpc-Y/VA16FOfzgNI/AAAAAAAAD2k/yt6OBmFwVgM/s1600/Krishna+lifting+Govardhan+Hill+and+giving+shelter+to+Vrajwasi.jpg", "image_path": "data\\videos\\4c6f63b4-e9a4-41c1-95d0-0612ae9d64e5\\images\\image_9.webp"}, {"title": "The Significance of Govardhana-pūjā", "content": ["- Govardhana-pūjā celebrates Kṛṣṇa's victory over Indra and His protection of the people of Vṛndāvana.", "It teaches us the importance of respecting the natural world and protecting it from harm.", "It reminds us that Kṛṣṇa is the Supreme Lord, who can protect us from all dangers."], "image_desc": "A depiction of Kṛṣṇa lifting Govardhana Hill, with the people of Vṛndāvana worshipping Him and offering Him prayers.", "narration": "Govardhana-pūjā celebrates Kṛṣṇa's victory over Indra and His protection of the people of Vṛndāvana. It teaches us the importance of respecting the natural world and protecting it from harm. It reminds us that Kṛṣṇa is the Supreme Lord, who can protect us from all dangers.", "slide_number": "10", "image_url": "http://krishnalilas.com/images/ch25/krishna-saves.jpg", "image_path": "data\\videos\\4c6f63b4-e9a4-41c1-95d0-0612ae9d64e5\\images\\image_10.webp"}]