[{"title": "Propositional Logic: A Very Simple Logic", "content": ["- Propositional logic is a formal system for reasoning about propositions.", "It uses symbols to represent propositions and logical connectives to combine them.", "Its syntax defines the structure of sentences, while its semantics determines the truth of sentences."], "image_desc": "A diagram showing the basic components of propositional logic, including proposition symbols, logical connectives, and sentences.", "narration": "Welcome to the world of propositional logic! This simple yet powerful logic system allows us to reason about propositions, which are statements that can be either true or false. We'll explore its syntax, which defines the structure of sentences, and its semantics, which determines their truth values.", "slide_number": "1", "image_url": "https://global-uploads.webflow.com/5ef788f07804fb7d78a4127a/6229a5686a28ab31cd0c7798_Properties-of-propositional-logic+(1).jpg", "image_path": "data/videos/f13c5b0c-92f5-43bd-9146-b939ba1d7237/images/image_1.webp"}, {"title": "Syntax of Propositional Logic", "content": ["- **Atomic Sentences:** These are the simplest sentences, consisting of a single proposition symbol.", "**Proposition Symbols:** These represent propositions and start with an uppercase letter, e.g., P, Q, R, W1,3.", "**Logical Connectives:** These combine atomic sentences to form complex sentences:\n    - **Negation (¬):**  e.g., ¬W1,3 (not W1,3)\n    - **Conjunction (∧):** e.g., W1,3 ∧ P3,1 (W1,3 and P3,1)\n    - **Disjunction (∨):** e.g., (W1,3 ∧ P3,1) ∨ W2,2 ((W1,3 and P3,1) or W2,2)\n    - **Implication (→):** e.g., (W1,3 ∧ P3,1) → ¬W2,2 ((W1,3 and P3,1) implies not W2,2)\n    - **Biconditional (↔):** e.g., W1,3 ↔ ¬W2,2 (W1,3 if and only if not W2,2)"], "image_desc": "A table showing the five logical connectives and their symbols, along with examples of their use.", "narration": "Now, let's dive into the syntax of propositional logic. Atomic sentences are the building blocks, represented by proposition symbols like P, Q, or W1,3. These symbols stand for propositions that can be either true or false. We then use logical connectives to combine these atomic sentences into more complex statements.  We have negation, which negates a sentence, conjunction, which combines sentences with \"and,\" disjunction, which combines sentences with \"or,\" implication, which represents \"if-then,\" and biconditional, which means \"if and only if.\"", "slide_number": "2", "image_url": "https://www.mathmindsacademy.com/uploads/1/0/0/0/100057076/logical-connectives_orig.jpg", "image_path": "data/videos/f13c5b0c-92f5-43bd-9146-b939ba1d7237/images/image_2.webp"}, {"title": "Semantics of Propositional Logic", "content": ["- **Truth Values:** Propositions can be either true (T) or false (F).", "**Truth Tables:** These tables show the truth values of complex sentences based on the truth values of their component atomic sentences.", "**Entailment:** A sentence A entails another sentence B if B is true whenever A is true."], "image_desc": "A truth table showing the truth values of a simple propositional logic sentence, such as \"P ∧ Q.\"", "narration": "The semantics of propositional logic deals with the truth values of sentences. Each proposition can be either true or false. We use truth tables to determine the truth values of complex sentences based on the truth values of their components.  A crucial concept is entailment, where one sentence logically implies another. If a sentence A entails another sentence B, then whenever A is true, B must also be true.", "slide_number": "3", "image_url": "https://i.ytimg.com/vi/_5Z_0824RHw/maxresdefault.jpg", "image_path": "data/videos/f13c5b0c-92f5-43bd-9146-b939ba1d7237/images/image_3.webp"}, {"title": "Example: Wumpus World", "content": ["- **Propositions:**  W1,3 (Wumpus in [1,3]), P3,1 (Pit in [3,1]), etc.", "**Sentences:**  ¬W1,3 (The Wumpus is not in [1,3]), W1,3 ∧ P3,1 (The Wumpus is in [1,3] and there's a pit in [3,1]), etc.", "**Inference:**  Using logical rules, we can infer new knowledge from existing knowledge."], "image_desc": "A map of the Wumpus world, showing the locations of the Wumpus, pits, and gold.", "narration": "Let's apply propositional logic to the Wumpus world. We can represent propositions like \"The Wumpus is in [1,3]\" as W1,3. We can then form sentences like \"The Wumpus is not in [1,3]\" (¬W1,3) or \"The Wumpus is in [1,3] and there's a pit in [3,1]\" (W1,3 ∧ P3,1).  By applying logical rules, we can infer new knowledge from existing knowledge. For example, if we know that there's a stench in a square, we can infer that the Wumpus is in a neighboring square.", "slide_number": "4", "image_url": "https://0901.static.prezi.com/preview/v2/7kkytuen5mitu3bjhxt2l2q3mh6jc3sachvcdoaizecfr3dnitcq_3_0.png", "image_path": "data/videos/f13c5b0c-92f5-43bd-9146-b939ba1d7237/images/image_4.webp"}, {"title": "A Simple Inference Algorithm", "content": ["- **Modus Ponens:**  If we know P → Q and P, then we can infer Q.", "**Modus Tollens:**  If we know P → Q and ¬Q, then we can infer ¬P.", "**Resolution:**  A more general inference rule that combines two clauses with complementary literals."], "image_desc": "A diagram illustrating the modus ponens and modus tollens inference rules.", "narration": "We can use inference rules to derive new knowledge from existing knowledge.  One common rule is modus ponens, which states that if we know P implies Q and we know P is true, then we can infer that Q is true. Another rule is modus tollens, which states that if we know P implies Q and we know Q is false, then we can infer that P is false.  Resolution is a more general inference rule that combines clauses with complementary literals.", "slide_number": "5", "image_url": "https://image2.slideserve.com/3960787/slide45-l.jpg", "image_path": "data/videos/f13c5b0c-92f5-43bd-9146-b939ba1d7237/images/image_5.webp"}, {"title": "Summary", "content": ["- Propositional logic is a powerful tool for reasoning about propositions.", "Its syntax and semantics provide a formal framework for representing and manipulating knowledge.", "Inference rules allow us to derive new knowledge from existing knowledge."], "image_desc": "A diagram showing the key components of propositional logic, including syntax, semantics, and inference rules.", "narration": "In conclusion, propositional logic is a powerful tool for reasoning about propositions. Its syntax and semantics provide a formal framework for representing and manipulating knowledge. Inference rules allow us to derive new knowledge from existing knowledge.  We've just scratched the surface of this fascinating logic system.  There's much more to explore, including its applications in various fields like artificial intelligence and computer science.", "slide_number": "6", "image_url": "https://global-uploads.webflow.com/5ef788f07804fb7d78a4127a/6229a5686a28ab31cd0c7798_Properties-of-propositional-logic+(1).jpg", "image_path": "data/videos/f13c5b0c-92f5-43bd-9146-b939ba1d7237/images/image_6.webp"}]