[{"title": "Half-Subtractor", "content": ["- A half-subtractor is a combinational circuit that subtracts two single-bit binary numbers.", "It has two inputs: minuend (A) and subtrahend (B).", "It produces two outputs: difference (D) and borrow (Bo).", "The difference output represents the result of the subtraction.", "The borrow output indicates whether a borrow is needed from the next higher bit position.", "The Boolean expressions for the half-subtractor are:\n    - D = A'B + AB' (XOR gate)\n    - Bo = A'B (AND gate with complemented A)"], "image_desc": "A logic diagram of a half-subtractor with inputs A and B, and outputs D and Bo.", "narration": "A half-subtractor is a fundamental building block in digital circuits used for binary subtraction. It takes two single-bit inputs, the minuend and subtrahend, and produces two outputs: the difference and the borrow. The difference output represents the result of the subtraction, while the borrow output indicates whether a borrow is needed from the next higher bit position. The logic diagram shows how the half-subtractor is implemented using XOR and AND gates.", "slide_number": "1", "image_url": "https://image.shutterstock.com/z/stock-vector-vector-diagram-of-half-subtractor-logic-circuit-1776412655.jpg", "image_path": "data\\videos\\075b7d23-e51c-4096-b1fd-ca34d4e7be5b\\images\\image_1.webp"}, {"title": "Full Subtractor", "content": ["- A full subtractor is a combinational circuit that subtracts two single-bit binary numbers, taking into account a borrow from the previous bit position.", "It has three inputs: minuend (A), subtrahend (B), and borrow-in (Cin).", "It produces two outputs: difference (D) and borrow-out (Bout).", "The difference output represents the result of the subtraction.", "The borrow-out output indicates whether a borrow is needed for the next higher bit position."], "image_desc": "A truth table showing the inputs and outputs of a full subtractor.", "narration": "A full subtractor is an extension of the half-subtractor, capable of handling subtractions involving a borrow from the previous bit position. It has three inputs: the minuend, subtrahend, and borrow-in, and produces two outputs: the difference and the borrow-out. The truth table illustrates how the full subtractor operates for all possible input combinations.", "slide_number": "2", "image_url": "https://grdp.co/cdn-cgi/image/f=auto/https://gs-post-images.grdp.co/2022/5/4-10-img1653043399521-29.jpg-rs-high-webp.jpg?noResize=1", "image_path": "data\\videos\\075b7d23-e51c-4096-b1fd-ca34d4e7be5b\\images\\image_2.webp"}, {"title": "Full Subtractor Logic Diagram", "content": ["- The Boolean expressions for the full subtractor are:\n    - D = A'B'Cin + A'BCin' + AB'Cin' + ABCin\n    - Bout = A'B'Cin + A'BCin' + A'BC + ABC"], "image_desc": "A logic diagram of a full subtractor with inputs A, B, and Cin, and outputs D and Bout.", "narration": "The logic diagram of the full subtractor shows how the difference and borrow-out outputs are generated using a combination of XOR, AND, and NOT gates. The Boolean expressions for the outputs are derived from the truth table and represent the logical relationships between the inputs and outputs.", "slide_number": "3", "image_url": "https://electricalvoice.com/wp-content/uploads/2018/05/full-subtractor-block-diagram.jpg", "image_path": "data\\videos\\075b7d23-e51c-4096-b1fd-ca34d4e7be5b\\images\\image_3.webp"}]