[{"title": "The Technology Behind IoT", "content": ["- Identification", "Sensing", "Communication", "Data Collection and Analysis"], "image_desc": "A diagram showing the different components of an IoT system, including sensors, devices, and a cloud server.", "narration": "The Internet of Things (IoT) is a network of physical devices, vehicles, buildings, and other items embedded with electronics, software, sensors, actuators, and network connectivity that enable these objects to collect and exchange data. Several technologies are involved in making the Internet of Things possible. First is identification. Since there will be billions of devices that will connect to the Internet, each one requires a unique identification. This is only possible if they're IPv6 enabled, as the current IPv4 network has depleted its universe of IP addresses. An IoT device needs to sense, which is possible by putting sensors that measure various aspects of an object. The object needs to have the ability to communicate what it has measured with the outside world. This world could be the Internet, or other similar objects around it. A central server where data from all the objects will be collected for analysis. It could be an application or an appliance that can download all data, and allow the user to control, manage, and analyze it.", "slide_number": "1", "image_url": "https://tacunasystems.com/wp-content/uploads/IoT-Block-Diagram.png", "image_path": "data/videos/25f97937-bffb-445b-9209-8e9ca5b2d378/images/image_1.webp"}, {"title": "Identification Technology for IoT", "content": ["- Radio Frequency Identification (RFID)", "Quick Response Code (QR Code)"], "image_desc": "A close-up image of an RFID tag and a QR code.", "narration": "Let's take a closer look at the identification technologies used in IoT. Radio Frequency Identification (RFID) is a technology that uses radio waves to accomplish communication between the data from an electronic device for the objective of identifying and also to locate and sense the environment around. Short for QR code, this is a machine-readable visual label that contains information about things to which it is affixed. It uses 4 standardized encoding modes viz. numeric, alpha numeric, byte/binary to effectively store information about those things. A QR Code on any device/things consists of black segments organized in a rectangle which can be read by QR software. Nowadays smartphones act as QRcode readers, which interpret the code and extract information from it. QR codes can also be used to track where the thing has been scanned and find its location.", "slide_number": "2", "image_url": "https://c8.alamy.com/comp/2WD1YP0/rfid-qr-code-barcode-line-icon-set-price-tag-scanner-label-reader-identification-microchip-vector-illustration-simple-outline-signs-retail-2WD1YP0.jpg", "image_path": "data/videos/25f97937-bffb-445b-9209-8e9ca5b2d378/images/image_2.webp"}, {"title": "Communication Protocols Used", "content": ["- Message Queue Telemetry Transport (MQTT)", "Extensible Messaging and Presence Protocol (XMPP)", "Data Distribution Service (DDS)", "Advanced Message Queuing Protocol (AMQP)", "Constrained Application Protocol (CoAP)"], "image_desc": "A diagram showing different communication protocols used in IoT, with arrows connecting devices and servers.", "narration": "Things must communicate with each other. Data then must be collected and sent to a remote server, indicating device information or the environment around it which if required is sent back to devices with other information to trigger various decisions or actions. For this purpose, various protocols are used. **Message Queue Telemetry Transport (MQTT)** is a protocol to gather device data and communicate it to the IT infrastructure and servers. Large networks of devices can be controlled or monitored with it. The protocol works on top of TCP providing a reliable stream of data flow. Extensible **Messaging and Presence Protocol (XMPP)** is a protocol used for connecting devices to people. It's an alternative to the D2D protocol, as people are connected to servers. XMPP provides a great way for example, to connect your home heater to a Web server so that you can monitor it from your smartphone. This protocol is ideal for consumer-oriented IoT applications. **Data Distribution Service (DDS)** is a device-to-device communication protocol. It shares device data with other devices over a network. DDS provides effective ways to filter and choose exactly which information goes where. **Advanced Message Queuing Protocol (AMQP)** is a queuing protocol used to link web servers to each other. In IoT, AMPQ is suited for server-based functions. **Constrained Application Protocol (CoAP)** is a protocol developed to be used in electronics devices allowing them to communicate interactively over the Internet. It is primarily focused on low power sensors, switches, valves, and similar components that need to be controlled or accessed remotely, through standard Internet networks. CoAP works on the application layer to be used in resource-constrained internet devices, such as Wireless Sensor Networks and WSN nodes.", "slide_number": "3", "image_url": "https://i.ytimg.com/vi/J0EfiB2uSxY/maxresdefault.jpg", "image_path": "data/videos/25f97937-bffb-445b-9209-8e9ca5b2d378/images/image_3.webp"}]