[{"title": "Internet of Things (IoT)", "image_desc": "A diagram showing various devices connected to the internet, including a smartphone, a smart home appliance, and a car.", "content": ["- The Internet of Things (IoT) is a concept that enables communication between internetworking devices and applications.", "Physical objects or \"things\" communicate through the Internet.", "The concept of IoT began with things classified as identity communication devices."], "narration": "नमस्ते! आज हम Internet of Things (IoT) के बारे में जानेंगे। IoT एक ऐसा कॉन्सेप्ट है जो इंटरनेट के ज़रिए डिवाइस और एप्लिकेशन को आपस में जोड़ता है। इस कॉन्सेप्ट में, भौतिक वस्तुएं या \"चीजें\" इंटरनेट के ज़रिए एक-दूसरे से बातचीत करती हैं। IoT की शुरुआत \"चीजों\" को पहचानने वाले संचार उपकरणों के रूप में हुई। \n'''\n\n'''", "slide_number": "1", "image_url": "https://cdn4.vectorstock.com/i/1000x1000/70/53/smart-home-iot-internet-of-things-control-comfort-vector-21927053.jpg", "image_path": "data/videos/d9f996b7-4147-4019-8cb0-83994fb3c16c/images/image_1.webp"}, {"title": "IoT Definition", "image_desc": "A globe with various devices connected to it, representing the internet.", "content": ["- The Internet is a vast global network of connected servers, computers, tablets, and mobiles governed by standard protocols.", "It enables sending, receiving, or communication of information, connectivity with remote servers, cloud, and analytics platforms.", "\"Thing\" in English refers to a physical object, an action or idea, a situation or activity."], "narration": "इंटरनेट एक विशाल वैश्विक नेटवर्क है जो सर्वर, कंप्यूटर, टैबलेट और मोबाइल को आपस में जोड़ता है। यह मानक प्रोटोकॉल द्वारा नियंत्रित होता है और जानकारी भेजने, प्राप्त करने या संचार करने, दूरस्थ सर्वर, क्लाउड और विश्लेषण प्लेटफॉर्म से कनेक्टिविटी प्रदान करता है। \"चीज\" शब्द का मतलब एक भौतिक वस्तु, एक क्रिया या विचार, एक स्थिति या गतिविधि हो सकता है।\n'''\n\n'''", "slide_number": "2", "image_url": "https://thumbs.dreamstime.com/z/global-network-internet-things-iot-as-illustration-earth-globe-dotted-map-line-connections-devices-52056799.jpg", "image_path": "data/videos/d9f996b7-4147-4019-8cb0-83994fb3c16c/images/image_2.webp"}, {"title": "IoT Definition", "image_desc": "A diagram showing various interconnected devices, including sensors, actuators, and a cloud platform.", "content": ["- The definition of IoT can be explained as a network of physical things (objects) sending, receiving, or communicating information using the Internet or other communication technologies.", "This enables monitoring, coordinating, or controlling processes across the Internet or another data network.", "Another definition of IoT is a network of physical objects or \"things\" embedded with electronics, software, sensors, and connectivity to enable greater value and service by exchanging data."], "narration": "IoT की परिभाषा को इस तरह समझा जा सकता है: IoT भौतिक चीजों (वस्तुओं) का एक नेटवर्क है जो इंटरनेट या अन्य संचार तकनीकों का उपयोग करके जानकारी भेजता है, प्राप्त करता है या संचार करता है। यह इंटरनेट या किसी अन्य डेटा नेटवर्क पर निगरानी, समन्वय या नियंत्रण प्रक्रियाओं को सक्षम बनाता है। IoT की एक और परिभाषा है: IoT भौतिक वस्तुओं या \"चीजों\" का एक नेटवर्क है जिसमें इलेक्ट्रॉनिक्स, सॉफ्टवेयर, सेंसर और कनेक्टिविटी एम्बेडेड होती है ताकि डेटा का आदान-प्रदान करके अधिक मूल्य और सेवा प्रदान की जा सके।\n'''\n\n'''", "slide_number": "3", "image_url": "https://tacunasystems.com/wp-content/uploads/IoT-Block-Diagram-1024x546.png", "image_path": "data/videos/d9f996b7-4147-4019-8cb0-83994fb3c16c/images/image_3.webp"}, {"title": "IoT Vision", "image_desc": "A futuristic city with various smart devices, including self-driving cars, smart homes, and connected streetlights.", "content": ["- IoT is a vision where things (wearable watches, alarm clocks, home devices, surrounding objects) become \"smart\" and function like living entities.", "This is achieved by sensing, computing, and communicating through embedded devices that interact with remote objects (servers, clouds, applications, services, and processes) or persons through the Internet or Near-Field Communication (NFC)."], "narration": "IoT एक ऐसा विजन है जहां चीजें (पहनने योग्य घड़ियाँ, अलार्म घड़ियाँ, घरेलू उपकरण, आसपास की वस्तुएँ) \"स्मार्ट\" बन जाती हैं और जीवित प्राणियों की तरह काम करती हैं। यह एम्बेडेड उपकरणों के माध्यम से संवेदन, कंप्यूटिंग और संचार करके प्राप्त किया जाता है जो इंटरनेट या नियर-फील्ड कम्युनिकेशन (NFC) के माध्यम से दूरस्थ वस्तुओं (सर्वर, क्लाउड, एप्लिकेशन, सेवाएँ और प्रक्रियाएँ) या व्यक्तियों के साथ बातचीत करते हैं।\n'''\n\n'''", "slide_number": "4", "image_url": "/data/videos/d9f996b7-4147-4019-8cb0-83994fb3c16c/images/image_4.webp", "image_path": "data/videos/d9f996b7-4147-4019-8cb0-83994fb3c16c/images/image_4.webp"}, {"title": "Examples of IoT", "image_desc": "Two images side-by-side. The first image shows an umbrella with a small embedded device connected to the internet. The second image shows a network of streetlights connected to a central control station.", "content": ["- Example 1.1: An umbrella can be made to function like a living entity by installing a tiny embedded device that interacts with a web-based weather service and the device owner through the Internet.", "Example 1.2: Streetlights in a city can be made to function like living entities through sensing and computing using tiny embedded devices that communicate and interact with a central control-and-command station through the Internet."], "narration": "IoT के कुछ उदाहरण देखते हैं। उदाहरण 1.1: एक छाता को एक छोटा एम्बेडेड डिवाइस लगाकर जीवित प्राणी की तरह काम करने के लिए बनाया जा सकता है जो इंटरनेट के माध्यम से वेब-आधारित मौसम सेवा और डिवाइस के मालिक के साथ बातचीत करता है। उदाहरण 1.2: एक शहर में स्ट्रीटलाइट को छोटे एम्बेडेड उपकरणों का उपयोग करके संवेदन और कंप्यूटिंग के माध्यम से जीवित प्राणियों की तरह काम करने के लिए बनाया जा सकता है जो इंटरनेट के माध्यम से एक केंद्रीय नियंत्रण और कमांड स्टेशन के साथ संचार और बातचीत करते हैं।\n'''\n\n'''", "slide_number": "5", "image_url": "https://open.lib.umn.edu/app/uploads/sites/4/2015/03/f4a26aa095033a4440497b169f3f90f5.jpg", "image_path": "data/videos/d9f996b7-4147-4019-8cb0-83994fb3c16c/images/image_5.webp"}, {"title": "Smart and Hyperconnected Devices", "image_desc": "A diagram showing a general framework for IoT, including smart devices, edge computing units, applications, servers, and various communication technologies.", "content": ["- Hyperconnectivity means the use of multiple systems and devices to remain constantly connected to social networks and streams of information.", "Smart devices are devices with computing and communication capabilities that can constantly connect to networks.", "A general framework for IoT using smart and hyperconnected devices, edge computing, and applications is shown in Figure 1.2."], "narration": "स्मार्ट और हाइपरकनेक्टेड डिवाइस के बारे में जानते हैं। हाइपरकनेक्टिविटी का मतलब है कई सिस्टम और उपकरणों का उपयोग करके सोशल नेटवर्क और सूचनाओं की धाराओं से लगातार जुड़े रहना। स्मार्ट डिवाइस ऐसे उपकरण हैं जिनमें कंप्यूटिंग और संचार क्षमताएँ होती हैं जो लगातार नेटवर्क से जुड़ सकते हैं। चित्र 1.2 में स्मार्ट और हाइपरकनेक्टेड उपकरणों, एज कंप्यूटिंग और एप्लिकेशन का उपयोग करके IoT के लिए एक सामान्य ढाँचा दिखाया गया है।\n'''", "slide_number": "6", "image_url": "/data/videos/d9f996b7-4147-4019-8cb0-83994fb3c16c/images/image_6.webp", "image_path": "data/videos/d9f996b7-4147-4019-8cb0-83994fb3c16c/images/image_6.webp"}]