[{"title": "Wireless Sensor Networks", "content": ["- A group of spatially dispersed sensors for monitoring and recording environmental conditions.", "Collect data on temperature, sound, pollution levels, humidity, wind, etc.", "Rely on wireless connectivity and spontaneous network formation.", "Similar to wireless ad hoc networks.", "Modern networks are bi-directional, enabling both data collection and control of sensor activity.", "Motivated by military applications like battlefield surveillance.", "Used in industrial and consumer applications like process monitoring, machine health monitoring, etc."], "image_desc": "A schematic diagram of a wireless sensor network with sensors deployed in a field, connected wirelessly to a central hub.", "narration": "Wireless sensor networks (WSNs) are like a team of tiny spies, scattered across an area, gathering information about the environment around them. These sensors can measure things like temperature, sound, and pollution levels, and then send this data wirelessly to a central location. Think of them as the eyes and ears of a smart city, helping us understand and manage our surroundings.", "slide_number": "1", "image_url": "https://microcontrollerslab.com/wp-content/uploads/2015/08/WIRELESS-SENSOR-NETWORKS.png", "image_path": "data/videos/f2a1d408-773e-4322-aea0-95c01c340487/images/image_1.webp"}, {"title": "Participatory Sensing Technology", "content": ["- Relies on the idea of participatory sensing.", "A system that gathers data about personal experiences and urban environments.", "Users voluntarily share contextual information using portable devices.", "Users decide how, when, what, and where to share data.", "Enables real-time monitoring of city conditions and collective behavior.", "Popular due to the widespread use of smartphones and social media.", "Users act as \"social sensors,\" providing data on their experiences.", "Data can be obtained through embedded sensors (GPS, accelerometer, microphone) or human observations.", "Provides access to global-scale sensing data, improving decision-making processes."], "image_desc": "A group of people in a city, using their smartphones to collect data about their surroundings, like traffic, noise levels, and air quality.", "narration": "Participatory sensing technology takes things a step further. It harnesses the power of people and their smartphones to gather data about the world around them. Imagine a network of people walking around a city, using their phones to collect information about traffic, noise levels, or even air quality. This data can be used to improve city planning, traffic management, and even public safety. It's like having a massive, distributed sensor network powered by everyday people.", "slide_number": "2", "image_url": "https://www.photocase.de/fotos/2311854-multi-ethnische-gruppe-junger-menschen-die-smartphones-benutzen-punkt-photocase-stock-foto-gross.jpeg", "image_path": "data/videos/f2a1d408-773e-4322-aea0-95c01c340487/images/image_2.webp"}]