[{"title": "Understanding Dielectrics", "content": ["- Solids with an energy gap of 3eV or more are called insulators.", "It's nearly impossible to excite electrons from the valence band to the conduction band in these materials using an applied field.", "Dielectrics are often referred to as insulators, meaning they are poor conductors of electricity.", "However, at extremely high temperatures, some electrons can move, leading to a small current flow.", "Dielectrics are non-metallic materials with high specific resistance (ρ), a negative temperature coefficient of resistance (-α), and large insulation resistance.", "Factors like moisture, temperature, applied electric field, and age can affect insulation resistance."], "image_desc": "A diagram showing the energy bands of a dielectric material, with a large energy gap between the valence band and the conduction band.", "narration": "Dielectrics ke baare mein jaane.  Insulators,  3eV se zyada energy gap hote hain.  Electrons valence band se conduction band mein jaa nahi sakte.  Dielectrics ko insulators bhi kaha jaata hai,  electricity conduct nahi karte.  High temperature pe,  electrons move kar sakte hain,  current flow hota hai.  Dielectrics non-metallic materials hain,  high specific resistance (ρ),  negative temperature coefficient of resistance (-α),  aur large insulation resistance.  Moisture,  temperature,  electric field,  aur age se insulation resistance affect hota hai.", "slide_number": "1", "image_url": "https://energyeducation.ca/wiki/images/thumb/f/f1/2000px-Band_gap_comparison.svg.png/1560px-2000px-Band_gap_comparison.svg.png", "image_path": "data/videos/767e71f2-dd40-4134-9b60-6a141cb14f19/images/image_1.webp"}, {"title": "Properties of Dielectrics", "content": ["- Generally, dielectrics are non-metallic materials with high resistivity.", "They have a large energy gap (greater than 3eV).", "All electrons in dielectrics are tightly bound to their parent nucleus.", "Since there are no free electrons to carry current, the electrical conductivity of dielectrics is very low.", "They have a negative temperature coefficient of resistance and high insulation resistance."], "image_desc": "A microscopic view of a dielectric material, showing the tightly bound electrons within the atoms.", "narration": "Dielectrics ke properties kya hain?  Non-metallic materials,  high resistivity.  Energy gap bada hota hai,  3eV se zyada.  Electrons nucleus se tightly bound hote hain.  Free electrons nahi hote,  electricity conduct nahi karte.  Negative temperature coefficient of resistance aur high insulation resistance.", "slide_number": "2", "image_url": "http://atomsociety.org.uk/wp/wp-content/uploads/2019/04/ElectronMicroscope.jpg", "image_path": "data/videos/767e71f2-dd40-4134-9b60-6a141cb14f19/images/image_2.webp"}, {"title": "Fundamental Definitions and Properties: Electric Dipole", "content": ["- A system with two equal and opposite charges (+q, -q) separated by a distance (d) is called an electric dipole.\n\n**DIPOLE MOMENT (P)**", "The product of the charge magnitude (q) and the distance between the charges (d) is called the dipole moment.", "Dipole moment P = qd (coulomb-metre)"], "image_desc": "A diagram of an electric dipole, showing two opposite charges separated by a distance.", "narration": "Electric dipole kya hai?  Do equal and opposite charges (+q, -q) distance (d) pe hote hain.  Dipole moment kya hai?  Charge magnitude (q) aur distance (d) ka product.  Dipole moment P = qd (coulomb-metre).", "slide_number": "3", "image_url": "/data/videos/767e71f2-dd40-4134-9b60-6a141cb14f19/images/image_3.webp", "image_path": "data/videos/767e71f2-dd40-4134-9b60-6a141cb14f19/images/image_3.webp"}, {"title": "Fundamental Definitions and Properties: Electric Dipole (Continued)", "content": ["**PERMITTIVITY (ε)**", "Permittivity represents the dielectric property of a medium. It indicates the ease of polarization of the material. Its unit is farad/metre.\n\n**DIELECTRIC CONSTANT (εr)**", "The dielectric constant determines a material's dielectric characteristic. It measures the polarization of the dielectrics.\n\n**Definition**", "It's the ratio of the absolute permittivity of the medium (ε) to the permittivity of free space (εo).", "Dielectric constant = Absolute permittivity (ε) / Permittivity of free space (εo)", "εr = ε / εo"], "image_desc": "A diagram showing the electric field lines around a dielectric material, illustrating the concept of permittivity.", "narration": "Permittivity kya hai?  Dielectric property of a medium.  Polarization kaise hota hai,  ye batata hai.  Farad/metre unit hota hai.  Dielectric constant kya hai?  Dielectric characteristic,  polarization measure karta hai.  Absolute permittivity (ε) aur permittivity of free space (εo) ka ratio hota hai.  Dielectric constant = Absolute permittivity (ε) / Permittivity of free space (εo).  εr = ε / εo.", "slide_number": "4", "image_url": "https://www.doitpoms.ac.uk/tlplib/dielectrics/images/dielectric-constant.jpg", "image_path": "data/videos/767e71f2-dd40-4134-9b60-6a141cb14f19/images/image_4.webp"}, {"title": "Fundamental Definitions and Properties: Polarization", "content": ["**Definition**", "The process of producing electric dipoles inside a dielectric by applying an external electrical field is called polarization in dielectrics.\n\n**POLARISABILITY (α)**", "It's observed that the average dipole moment is proportional to the applied electric field (E).", "μ = α E", "Where (α) is the polarisability.", "α = μ / E", "Polarisability is defined as the ratio of the average dipole moment to the applied electric field. Its unit is farad m2."], "image_desc": "A diagram showing a dielectric material being polarized by an external electric field, with induced dipoles forming within the material.", "narration": "Polarization kya hai?  External electric field se dielectric material mein electric dipoles banate hain.  Polarisability kya hai?  Average dipole moment aur applied electric field ka ratio.  μ = α E.  α = μ / E.  Farad m2 unit hota hai.", "slide_number": "5", "image_url": "/data/videos/767e71f2-dd40-4134-9b60-6a141cb14f19/images/image_5.webp", "image_path": "data/videos/767e71f2-dd40-4134-9b60-6a141cb14f19/images/image_5.webp"}, {"title": "Active and Passive Dielectrics", "content": ["- Dielectric materials can be classified into active and passive dielectrics.\n\n**i. Active Dielectrics**", "When a dielectric material is placed in an external electric field, if it actively accepts electricity, it's known as an active dielectric material.", "Active dielectrics easily adapt to store electrical energy.\n\n**ii. Passive Dielectrics**", "Passive dielectrics restrict the flow of electrical energy. They act as insulators.\n\n**Examples:** All insulating materials like glass, mica, rubber, etc."], "image_desc": "A diagram showing the difference between active and passive dielectrics, with active dielectrics storing electrical energy and passive dielectrics blocking it.", "narration": "Active and passive dielectrics kya hain?  Active dielectrics,  external electric field mein electricity accept karte hain.  Electrical energy store karte hain.  Passive dielectrics,  electricity flow restrict karte hain.  Insulators ki tarah kaam karte hain.  Glass,  mica,  rubber,  etc.  examples hain.", "slide_number": "6", "image_url": "/data/videos/767e71f2-dd40-4134-9b60-6a141cb14f19/images/image_6.webp", "image_path": "data/videos/767e71f2-dd40-4134-9b60-6a141cb14f19/images/image_6.webp"}]