[{"slide_number": "1", "title": "5 Powerful Prompting Techniques to Get the Best Responses from AI", "slide_type": "Title Slide", "content": "No Content", "image_desc": "No Image Description", "video_desc": "AI prompting", "narration": "Hello and welcome In this video we'll explore five powerful prompting techniques to help you get the best responses from AI models like ChatGPT. Mastering these techniques can significantly improve the quality and relevance of AIgenerated content.", "image_url": "", "image_path": "", "video_url": "https://videos.pexels.com/video-files/3141208/3141208-sd_426_240_25fps.mp4", "video_path": "data\\videos\\2f6ba084-b87c-4347-b265-d5d6ca35ddaa\\images\\video_1.mp4"}, {"slide_number": "2", "title": "Why Prompting Matters", "slide_type": "Image Right", "content": "AI models respond to prompts.\nQuality of response depends on prompt quality.\nWell-structured prompts yield better results.", "image_desc": "AI brain processing information. Type: illustration", "video_desc": "", "narration": "AI models are only as good as the prompts they receive. A vague or poorly worded prompt can lead to generic or even incorrect responses. By learning how to craft effective prompts you can unlock the full potential of AI for research content creation and problemsolving.", "image_url": "https://miro.medium.com/v2/resize:fit:938/1*p27vn3B2KIeevh9rB9BbmQ.png", "image_path": "data\\videos\\2f6ba084-b87c-4347-b265-d5d6ca35ddaa\\images\\image_2.webp", "video_url": "", "video_path": ""}, {"slide_number": "3", "title": "Technique 1: Provide Clear Instructions", "slide_type": "Image Left", "content": "Be explicit and straightforward.\nAvoid ambiguity.\nExample:\n❌ Ambiguous: \"Tell me about the moon.\"\n✅ Clear: \"Give me a brief summary of the moon's composition, atmosphere, and role in Earth's tides.\"", "image_desc": "A lightbulb illuminating a clear path. Type: illustration", "video_desc": "", "narration": "The first technique is to provide clear instructions. AI models respond best when given explicit and straightforward instructions. Ambiguity can lead to vague or incorrect answers so always be as specific as possible in your prompts.", "image_url": "/data/videos/2f6ba084-b87c-4347-b265-d5d6ca35ddaa/images/image_3.webp", "image_path": "/data/videos/2f6ba084-b87c-4347-b265-d5d6ca35ddaa/images/image_3.webp", "video_url": "", "video_path": ""}, {"slide_number": "4", "title": "Clear Instructions - Example Output", "slide_type": "Image Right", "content": "ChatGPT Output (with clear instruction):\n\"The moon is composed primarily of rock and metal. It has no atmosphere, and its gravitational pull is responsible for the tides on Earth.\"", "image_desc": "ChatGPT interface showing a response about the moon. Type: screenshot", "video_desc": "", "narration": "Here's an example of how a clear instruction leads to a better response. Instead of asking Tell me about the moon a more specific prompt like Give me a brief summary of the moon's composition atmosphere and role in Earth's tides yields a concise and informative answer.", "image_url": "https://images.ctfassets.net/lzny33ho1g45/4UHZCwaqdWPotMBwSu6IsK/e46f84854a63f50291fb95e703e7659b/Screen_Shot_2024-11-06_at_5.17.41_PM.png?w=1400", "image_path": "data\\videos\\2f6ba084-b87c-4347-b265-d5d6ca35ddaa\\images\\image_4.webp", "video_url": "", "video_path": ""}, {"slide_number": "5", "title": "Technique 2: Adopt a Persona", "slide_type": "Image Left", "content": "Encourage AI to take on a role.\nExamples: expert, historical figure, professional.\nExample:\n❌ Without persona: \"Explain quantum physics.\"\n✅ With persona: \"As a quantum physicist, explain the concept of superposition in simple terms.\"", "image_desc": "A person wearing different hats representing various professions. Type: illustration", "video_desc": "", "narration": "The second technique is to adopt a persona. Encouraging the AI to take on a specific role such as an expert or historical figure helps generate more precise and authoritative responses. This technique adds depth and credibility to the AI's output.", "image_url": "/data/videos/2f6ba084-b87c-4347-b265-d5d6ca35ddaa/images/image_5.webp", "image_path": "/data/videos/2f6ba084-b87c-4347-b265-d5d6ca35ddaa/images/image_5.webp", "video_url": "", "video_path": ""}, {"slide_number": "6", "title": "Adopt a Persona - Example Output", "slide_type": "Image Right", "content": "ChatGPT Output (with persona):\n\"As a quantum physicist, superposition refers to the ability of a quantum system to exist in multiple states at the same time until it is measured. Think of it like a coin spinning in the air, being both heads and tails until it lands.\"", "image_desc": "ChatGPT interface showing a response about quantum physics from a physicist's perspective. Type: screenshot", "video_desc": "", "narration": "By prompting the AI to respond as a quantum physicist the explanation of superposition becomes more insightful and easier to understand. This approach provides a unique perspective that enhances the learning experience.", "image_url": "https://us1.discourse-cdn.com/openai1/original/4X/b/c/0/bc028ded9e2fae1b50483c5161b115cb626ce5da.jpeg", "image_path": "data\\videos\\2f6ba084-b87c-4347-b265-d5d6ca35ddaa\\images\\image_6.webp", "video_url": "", "video_path": ""}, {"slide_number": "7", "title": "Technique 3: Specify the Format", "slide_type": "Image Left", "content": "Specify the desired format.\nExamples: list, bullet points, essay, comparison.\nExample:\n❌ Without format: \"Tell me about the causes of climate change.\"\n✅ With format: \"List five main causes of climate change and explain each in a sentence.\"", "image_desc": "Different document formats like lists, essays, and charts. Type: illustration", "video_desc": "", "narration": "The third technique is to specify the format. AIgenerated responses are more structured and useful when you specify the desired format such as a list bullet points or an essay. This helps organize the information in a way that is easy to digest.", "image_url": "https://www.scribbr.com/wp-content/uploads/2014/10/example-list-of-abbreviations.png", "image_path": "data\\videos\\2f6ba084-b87c-4347-b265-d5d6ca35ddaa\\images\\image_7.webp", "video_url": "", "video_path": ""}, {"slide_number": "8", "title": "Specify the Format - Example Output", "slide_type": "Table of Contents", "content": "ChatGPT Output (with format):\nBurning Fossil Fuels: Releases carbon dioxide, a greenhouse gas, into the atmosphere.\nDeforestation: Reduces the Earth's ability to absorb COtwo.\nIndustrial Agriculture: Contributes to methane emissions from livestock.\nWaste Production: Landfills release methane, a potent greenhouse gas.\nTransportation: Cars and airplanes burn fossil fuels, releasing pollutants into the air.", "image_desc": "ChatGPT interface showing a list of causes of climate change. Type: screenshot", "video_desc": "", "narration": "By requesting a list of five main causes of climate change the AI provides a structured response that is easy to read and understand. This format helps to quickly grasp the key points and their explanations.", "image_url": "/data/videos/2f6ba084-b87c-4347-b265-d5d6ca35ddaa/images/image_8.webp", "image_path": "/data/videos/2f6ba084-b87c-4347-b265-d5d6ca35ddaa/images/image_8.webp", "video_url": "", "video_path": ""}, {"slide_number": "9", "title": "Technique 4: Avoid Leading the Answer", "slide_type": "Image Left", "content": "Use neutral wording.\nAvoid biased questions.\nExample:\n❌ Leading question: \"Why is exercise important for health?\"\n✅ Non-leading question: \"What are the benefits of regular exercise?\"", "image_desc": "A balanced scale representing neutral questioning. Type: illustration", "video_desc": "", "narration": "The fourth technique is to avoid leading the answer. Leading questions can create biased responses or limit the depth of answers. Neutral wording allows for a more open and informative response ensuring you get unbiased information.", "image_url": "https://media.springernature.com/lw685/springer-static/image/art%3A10.1038%2Fs41598-024-63156-y/MediaObjects/41598_2024_63156_Fig2_HTML.png", "image_path": "data\\videos\\2f6ba084-b87c-4347-b265-d5d6ca35ddaa\\images\\image_9.webp", "video_url": "", "video_path": ""}, {"slide_number": "10", "title": "Avoid Leading the Answer - Example Output", "slide_type": "Image Right", "content": "ChatGPT Output (non-leading):\n\"Regular exercise can improve cardiovascular health, increase strength, enhance mood, and help with weight management.\"", "image_desc": "ChatGPT interface showing the benefits of regular exercise. Type: screenshot", "video_desc": "", "narration": "By asking What are the benefits of regular exercise instead of Why is exercise important for health the AI provides a comprehensive list of benefits without being influenced by a preconceived notion. This ensures a more objective and informative response.", "image_url": "https://content.wolfram.com/sites/43/2023/03/chatGPT-hero4.png", "image_path": "data\\videos\\2f6ba084-b87c-4347-b265-d5d6ca35ddaa\\images\\image_10.webp", "video_url": "", "video_path": ""}, {"slide_number": "11", "title": "Technique 5: Limit the Scope", "slide_type": "Image Left", "content": "Narrow the focus of the prompt.\nAvoid broad, generalized questions.\nExample:\n❌ Broad question: \"Tell me about artificial intelligence.\"\n✅ Limited scope: \"What are the ethical concerns related to the use of artificial intelligence in healthcare?\"", "image_desc": "A magnifying glass focusing on a specific area. Type: illustration", "video_desc": "", "narration": "The fifth technique is to limit the scope. Narrowing the focus of a prompt helps ensure a more precise and relevant response rather than a broad generalized answer. This helps to get specific information on a particular aspect of a topic.", "image_url": "https://media.newyorker.com/photos/65176cea9fb4ab1471471345/master/w_2560%2Cc_limit/231009_r43126_rd.jpg", "image_path": "data\\videos\\2f6ba084-b87c-4347-b265-d5d6ca35ddaa\\images\\image_11.webp", "video_url": "", "video_path": ""}, {"slide_number": "12", "title": "Limit the Scope - Example Output", "slide_type": "Image Right", "content": "ChatGPT Output (limited scope):\n\"Ethical concerns regarding AI in healthcare include issues of patient privacy, bias in decision-making, the transparency of algorithms, and the potential for replacing human jobs in medical fields.\"", "image_desc": "ChatGPT interface showing ethical concerns of AI in healthcare. Type: screenshot", "video_desc": "", "narration": "By focusing on the ethical concerns of AI in healthcare the AI provides a detailed response specific to that area. This targeted approach helps to gain deeper insights into a particular subject.", "image_url": "/data/videos/2f6ba084-b87c-4347-b265-d5d6ca35ddaa/images/image_12.webp", "image_path": "/data/videos/2f6ba084-b87c-4347-b265-d5d6ca35ddaa/images/image_12.webp", "video_url": "", "video_path": ""}, {"slide_number": "13", "title": "Bonus: AI Can Hallucinate!", "slide_type": "Image with Caption", "content": "AI models sometimes generate information that seems convincing but is entirely made up.\nNarration:\nAI models can sometimes hallucinate, generating information that seems convincing but is entirely fabricated. Always double-check the information provided by AI, especially when dealing with critical topics.", "image_desc": "A modern kitchen with a smart refrigerator that has a seventeenth-century painting on it. Type: digital art", "video_desc": "", "narration": "AI models can sometimes hallucinate generating information that seems convincing but is entirely fabricated. Always doublecheck the information provided by AI especially when dealing with critical topics.", "image_url": "https://images.bestwestern.com/bwi/brochures/33102/photos/1024/27035853.jpg", "image_path": "data\\videos\\2f6ba084-b87c-4347-b265-d5d6ca35ddaa\\images\\image_13.webp", "video_url": "", "video_path": ""}, {"slide_number": "14", "title": "Conclusion", "slide_type": "Image with Caption", "content": "By applying these five prompting techniques, you can significantly enhance the quality of responses from AI.\nNarration:\nBy mastering these five prompting techniques, you can significantly enhance the quality of responses from AI, making it a more effective tool for research, content creation, and problem-solving. Thank you for watching!", "image_desc": "A person successfully using AI on a laptop. Type: stock photo", "video_desc": "", "narration": "By mastering these five prompting techniques you can significantly enhance the quality of responses from AI making it a more effective tool for research content creation and problemsolving. Thank you for watching", "image_url": "https://cdn.prod.website-files.com/61a05ff14c09ecacc06eec05/6763829a23e86f70bf87bf74_ai-note-taker-for-in-person-meetings.jpg", "image_path": "data\\videos\\2f6ba084-b87c-4347-b265-d5d6ca35ddaa\\images\\image_14.webp", "video_url": "", "video_path": ""}]