[{"title": "Design Principles for Connected Devices", "content": ["- Interoperability", "Information Transparency", "Technical Assistance", "Decentralized Decisions"], "image_desc": "A diagram showing the interconnectedness of various devices and systems within an IoT ecosystem.", "narration": "Welcome to this presentation on Design Principles for Connected Devices. We'll explore the fundamental principles that guide the development of these interconnected systems, including interoperability, information transparency, technical assistance, and decentralized decision-making.", "slide_number": "1", "image_url": "https://content.altexsoft.com/media/2020/08/iot-connectivity.png", "image_path": "data/videos/6b92b6dd-ca7a-4208-adf6-cfda09af2db2/images/image_1.webp"}, {"title": "Interoperability", "content": ["- Enables communication and data exchange between sensors, machines, equipment, and sites.", "Essential for creating functional and seamless connected systems."], "image_desc": "A network diagram illustrating the flow of data between various connected devices.", "narration": "Interoperability is the cornerstone of any connected system. It ensures that different devices, regardless of their manufacturer or specifications, can communicate and exchange data effectively. This seamless communication is crucial for creating a cohesive and functional IoT ecosystem.", "slide_number": "2", "image_url": "https://www.conceptdraw.com/solution-park/resource/images/solutions/computer_and_networks/Computer-Network-Diagrams-Computer-Network-Diagram.png", "image_path": "data/videos/6b92b6dd-ca7a-4208-adf6-cfda09af2db2/images/image_2.webp"}, {"title": "Information Transparency", "content": ["- Bridges the gap between the physical and digital worlds.", "Creates a \"Digital Twin\" by recording and storing physical processes virtually."], "image_desc": "A split-screen image showing a physical factory floor on one side and a digital representation of the same floor with data visualizations on the other side.", "narration": "The rapid growth of connected devices necessitates a bridge between the physical and digital realms. Information transparency achieves this by recording and storing physical processes virtually, creating a \"Digital Twin.\" This digital representation provides valuable insights into real-time operations and facilitates data-driven decision-making.", "slide_number": "3", "image_url": "https://cdn.canadianmetalworking.com/import/2016/09/DashboardControls_PortCNCShopDisplay.jpg", "image_path": "data/videos/6b92b6dd-ca7a-4208-adf6-cfda09af2db2/images/image_3.webp"}, {"title": "Technical Assistance", "content": ["- Connected systems provide data to aid in operational decision-making and problem-solving.", "IoT-enabled devices assist with labor-intensive tasks, enhancing productivity and safety."], "image_desc": "A technician using a tablet to access real-time data from a connected machine, allowing for proactive maintenance and troubleshooting.", "narration": "Technical assistance is a key benefit of IoT. Connected systems provide valuable data that empowers users to make informed decisions and resolve issues quickly. Furthermore, IoT-enabled devices can assist with labor-intensive tasks, improving productivity and ensuring a safer working environment.", "slide_number": "4", "image_url": "https://thumbs.dreamstime.com/b/professional-male-technician-engineer-using-tablet-checking-controlling-machine-manufacturing-factory-269475351.jpg", "image_path": "data/videos/6b92b6dd-ca7a-4208-adf6-cfda09af2db2/images/image_4.webp"}, {"title": "Decentralized Decisions", "content": ["- Connected systems go beyond data exchange and assistance.", "They can make decisions and execute actions based on predefined logic."], "image_desc": "A flowchart depicting a decision-making process within an IoT system, where data is analyzed and actions are triggered based on predefined rules.", "narration": "The ultimate goal of connected systems is to move beyond simple data exchange and assistance. They should be capable of making decisions and executing actions based on predefined logic. This level of autonomy enables efficient and responsive operations, optimizing processes and improving overall system performance.", "slide_number": "5", "image_url": "https://c8.alamy.com/comp/DWEEE6/decision-making-process-word-circle-concept-with-great-terms-such-DWEEE6.jpg", "image_path": "data/videos/6b92b6dd-ca7a-4208-adf6-cfda09af2db2/images/image_5.webp"}, {"title": "IoT/M2M Systems Layers and Design Standardization", "content": ["- The Internet Engineering Task Force (IETF) is responsible for designing and standardizing IoT/M2M systems.", "IETF proposes specifications like the modified OSI model for IoT and M2M."], "image_desc": "A diagram illustrating the modified OSI model for IoT and M2M, highlighting the different layers and their functionalities.", "narration": "To ensure interoperability and seamless communication within the IoT ecosystem, the Internet Engineering Task Force (IETF) plays a crucial role in designing and standardizing these systems. One of the key specifications proposed by IETF is the modified OSI model for IoT and M2M, which provides a framework for understanding the different layers involved in communication and data exchange.", "slide_number": "6", "image_url": "https://dgtlinfra.com/wp-content/uploads/2022/11/Layers-in-Internet-of-Things-IoT-Architecture.jpg", "image_path": "data/videos/6b92b6dd-ca7a-4208-adf6-cfda09af2db2/images/image_6.webp"}, {"title": "Modified OSI Model for IoT and M2M", "content": ["- Consists of six layers.", "Layer 6 includes new applications and services.", "Layer 5 facilitates client-server interaction using protocols like CoAP.", "Layer 4 includes data adaptation and gateway functionalities.", "Layer 3 handles network communication.", "Layer 2 manages data link protocols.", "Layer 1 deals with physical transmission."], "image_desc": "A detailed diagram of the modified OSI model for IoT and M2M, showcasing each layer and its associated protocols and functionalities.", "narration": "The modified OSI model for IoT and M2M consists of six layers, each responsible for specific functionalities. Layer 6 introduces new applications and services, while Layer 5 handles client-server interaction using protocols like CoAP. Layer 4 includes data adaptation and gateway functionalities, enabling communication between devices and the web. Layers 3, 2, and 1 handle network communication, data link protocols, and physical transmission, respectively.", "slide_number": "7", "image_url": "https://dgtlinfra.com/wp-content/uploads/2022/11/Layers-in-Internet-of-Things-IoT-Architecture.jpg", "image_path": "data/videos/6b92b6dd-ca7a-4208-adf6-cfda09af2db2/images/image_7.webp"}, {"title": "Communication Technologies", "content": ["- Wi-Fi: Uses IEEE 802.11 protocol for wireless local area networks (WLANs).", "RF Transceivers and RF Modules: Simple circuits for transmitting and receiving radio frequency signals.", "GPRS/GPS Cellular Networks: Provide data connectivity and location services."], "image_desc": "A collage of icons representing Wi-Fi, RF transceivers, and cellular network technologies.", "narration": "Various communication technologies are employed in IoT systems to enable data exchange and connectivity. Wi-Fi, using the IEEE 802.11 protocol, provides wireless connectivity for local area networks. RF transceivers and modules are simple circuits that transmit and receive radio frequency signals, enabling communication between devices. GPRS/GPS cellular networks offer data connectivity and location services, extending the reach of IoT systems.", "slide_number": "8", "image_url": "https://thumbs.dreamstime.com/b/wi-fi-collage-triangle-elements-different-sizes-shapes-vector-polygons-arranged-wi-fi-composition-geometric-119925447.jpg", "image_path": "data/videos/6b92b6dd-ca7a-4208-adf6-cfda09af2db2/images/image_8.webp"}, {"title": "Data Enrichment and Consolidation", "content": ["- Data consolidation: Integrating data from multiple sources into a single destination.", "Data enrichment: Enhancing, refining, or improving raw data.", "Benefits: Reduced data duplication, improved data analysis, and increased data value."], "image_desc": "A data pipeline diagram showing data from various sources being consolidated and enriched, resulting in a more comprehensive and insightful data set.", "narration": "Data enrichment and consolidation are crucial processes in managing and leveraging data within IoT systems. Data consolidation involves integrating data from multiple sources into a single destination, reducing redundancy and facilitating analysis. Data enrichment enhances the quality and value of raw data by refining, correcting, or adding information, making it more insightful and actionable.", "slide_number": "9", "image_url": "https://daxg39y63pxwu.cloudfront.net/images/blog/data-pipeline-definition-architecture-examples/Data_Pipeline_Architecture.png", "image_path": "data/videos/6b92b6dd-ca7a-4208-adf6-cfda09af2db2/images/image_9.webp"}, {"title": "Ease of Designing", "content": ["- Design for connected devices for IoT applications, services, and business processes.", "Consider ease of designing physical, data link, adaptation layers, and gateways.", "Availability of sensors, actuators, controllers, and IoT devices.", "Low-cost hardware and open-source software components.", "Secure connectivity with the internet."], "image_desc": "A designer working on a computer, surrounded by various IoT devices and components, illustrating the ease of designing connected devices.", "narration": "Designing connected devices requires a focus on ease of implementation. Designers should consider the availability of sensors, actuators, controllers, and IoT devices, as well as the use of low-cost hardware and open-source software components. Ensuring secure connectivity with the internet is also paramount for reliable and protected operation.", "slide_number": "10", "image_url": "https://cdn.educba.com/academy/wp-content/uploads/2020/01/Components-of-IoT.jpg", "image_path": "data/videos/6b92b6dd-ca7a-4208-adf6-cfda09af2db2/images/image_10.webp"}, {"title": "Affordability of IoT Devices", "content": ["- The \"card\": An embedded microcontroller, memory, OS, NFC peripheral interfaces, access point based device activation, RF module, and transceiver at a low cost.", "Wireless sensors use Motes (mobile terminals).", "Motes: Low-cost devices with open-source OS (Tiny OS) and software components.", "Provides ease and affordability in WSN networks."], "image_desc": "A close-up image of a small, affordable IoT device, highlighting its key components and functionalities.", "narration": "Affordability is a key factor in the widespread adoption of IoT devices. The \"card\" concept offers a low-cost solution by integrating essential components like a microcontroller, memory, OS, and RF modules. Wireless sensors often utilize Motes, which are low-cost devices with open-source operating systems and software components, enabling the creation of affordable and scalable WSN networks.", "slide_number": "11", "image_url": "https://cdn.educba.com/academy/wp-content/uploads/2020/01/Components-of-IoT.jpg", "image_path": "data/videos/6b92b6dd-ca7a-4208-adf6-cfda09af2db2/images/image_11.webp"}, {"title": "Future of IoT", "content": ["- Three core sectors: Enterprise, home, and government.", "Enterprise IoT (EIoT) is the largest sector.", "By 2019, EIoT is estimated to account for 9.1 billion devices."], "image_desc": "A bar graph showing the projected growth of IoT devices across different sectors, with EIoT dominating the landscape.", "narration": "The future of IoT is bright, with significant growth expected across various sectors. Enterprise IoT (EIoT) is currently the largest sector, and by 2019, it is estimated to account for a staggering 9.1 billion devices. This growth highlights the transformative potential of IoT in revolutionizing business processes, improving efficiency, and creating new opportunities.", "slide_number": "12", "image_url": "https://iotdesignpro.com/sites/default/files/inline-images/IoT-Devices-Growth-Graph.jpg", "image_path": "data/videos/6b92b6dd-ca7a-4208-adf6-cfda09af2db2/images/image_12.webp"}]