[{"title": "What is Birdology?", "content": ["- Birdology is the study of birds.", "It encompasses their behavior, ecology, evolution, and conservation."], "image_desc": "A colorful image of various bird species in their natural habitats.", "narration": "\"Assalam o Alaikum! Aaj hum baat karenge birdology ki. Birdology kya hai?  Birdology, yeh parindon ka ilm hai. Is mein hum parindon ke  behavior, ecology, evolution aur conservation ke baare mein seekhte hain.\" \n\n#", "slide_number": "1", "image_url": "https://img.freepik.com/premium-photo/photography-birds-their-natural-habitats-with-different-species_883586-15012.jpg", "image_path": "data\\videos\\59eff11a-7f3c-435a-89f5-78d1fca41397\\images\\image_1.webp"}, {"title": "Why Study Birds?", "content": ["- Birds are important indicators of environmental health.", "They play vital roles in ecosystems, such as pollination and seed dispersal.", "Studying birds helps us understand biodiversity and conservation efforts."], "image_desc": "A close-up image of a bird feeding its young in a nest.", "narration": "\"Parindon ki study karna kyun important hai?  Parinde environment ki health ke indicators hote hain.  Yeh ecosystems mein important roles nibhate hain, jaise pollination aur seed dispersal.  Parindon ki study se hum biodiversity aur conservation efforts ko samajh sakte hain.\"\n\n#", "slide_number": "2", "image_url": "https://thumbs.dreamstime.com/z/close-up-bird-feeding-its-young-nest-created-generative-ai-289286469.jpg", "image_path": "data\\videos\\59eff11a-7f3c-435a-89f5-78d1fca41397\\images\\image_2.webp"}, {"title": "Birding as a Hobby", "content": ["- Birding is a popular hobby for people of all ages.", "It involves observing birds in their natural habitats.", "It can be enjoyed in parks, forests, and even backyards."], "image_desc": "A person with binoculars observing birds in a forest.", "narration": "\"Birding ek popular hobby hai jo har umr ke logon ko pasand hai.  Is mein hum parindon ko unke natural habitats mein observe karte hain.  Yeh parks, forests aur apne backyards mein bhi enjoy kiya ja sakta hai.\"", "slide_number": "3", "image_url": "https://www.billjacksons.com/wp-content/uploads/2020/02/iStock-955975002-1024x673.jpg", "image_path": "data\\videos\\59eff11a-7f3c-435a-89f5-78d1fca41397\\images\\image_3.webp"}]