[{"slide_number": "1", "title": "Star Delta Connection Explained", "slide_type": "Title Slide", "content": "(No additional content for Title Slide)", "image_desc": "A diagram showing both star and delta configurations side-by-side.", "narration": "Welcome to this video explaining star and delta connections.  We'll explore the differences and applications of these common electrical configurations.", "image_url": "https://www.electricaltechnology.org/wp-content/uploads/2014/09/Difference-between-Star-and-Delta-Connections.png", "image_path": "data/videos/14696889-c0a1-43f4-a043-7c26a0e38d76/images/image_1.webp"}, {"slide_number": "2", "title": "What is a Star Connection?", "slide_type": "Image Left", "content": "Three-phase windings connected at a common point (neutral).\nEach winding is connected to one phase.\nOften used in motors and generators.", "image_desc": "A diagram of a star connected three-phase system, clearly showing the common neutral point.", "narration": "Let's start with the star connection.  Notice how the three windings are connected at a single point, called the neutral point. Each winding connects to one phase of the supply. This configuration is frequently used in motors and generators.", "image_url": "https://studyelectrical.com/wp-content/uploads/2014/11/star-star-transformer.jpg", "image_path": "data/videos/14696889-c0a1-43f4-a043-7c26a0e38d76/images/image_2.webp"}, {"slide_number": "3", "title": "What is a Delta Connection?", "slide_type": "Image Right", "content": "Three-phase windings connected in a closed loop.\nNo neutral point.\nOften used in transformers and power distribution.", "image_desc": "A diagram of a delta connected three-phase system, showing the closed loop configuration.", "narration": "Now, let's look at the delta connection.  Here, the three windings form a closed loop, there's no neutral point.  This configuration is commonly found in transformers and power distribution systems.", "image_url": "https://i.ytimg.com/vi/jRq3ULJuoIY/hqdefault.jpg", "image_path": "data/videos/14696889-c0a1-43f4-a043-7c26a0e38d76/images/image_3.webp"}, {"slide_number": "4", "title": "Star vs. Delta: Key Differences", "slide_type": "Two Columns", "content": "**Column 1: Star Connection**\nNeutral point present\nLower voltage per phase\nHigher line voltage\n**Column 2: Delta Connection**\nNo neutral point\nHigher voltage per phase\nLower line voltage", "image_desc": "A comparative table summarizing the key differences between star and delta connections.", "narration": "The main differences lie in the presence of a neutral point and the voltage relationships.  A star connection has a neutral point, lower voltage per phase, but a higher line voltage.  A delta connection lacks a neutral point, has a higher voltage per phase, but a lower line voltage.", "image_url": "https://www.electricaltechnology.org/wp-content/uploads/2014/09/Difference-between-Star-and-Delta-Connections.png", "image_path": "data/videos/14696889-c0a1-43f4-a043-7c26a0e38d76/images/image_4.webp"}, {"slide_number": "5", "title": "Applications of Star and Delta Connections", "slide_type": "Image with Caption", "content": "(No additional content needed for this slide type)", "image_desc": "An image showing various applications of star and delta connections, such as motors, transformers, and power distribution systems.", "narration": "Star and delta connections find applications in a wide range of electrical systems, including motors, generators, transformers, and power distribution networks. The choice between them depends on the specific requirements of the application.", "image_url": "https://i.ytimg.com/vi/MfLi949b1Qg/maxresdefault.jpg", "image_path": "data/videos/14696889-c0a1-43f4-a043-7c26a0e38d76/images/image_5.webp"}, {"slide_number": "6", "title": "Conclusion", "slide_type": "Image Right", "content": "Star and delta connections are fundamental three-phase configurations.\nUnderstanding their differences is crucial for electrical engineers.\nChoosing the right connection depends on the specific application.", "image_desc": "A final image summarizing the key takeaways of the video, perhaps a simple graphic of both connections.", "narration": "In summary, star and delta connections are fundamental three-phase configurations with distinct characteristics. Understanding their differences is essential for electrical engineers and technicians when designing and troubleshooting electrical systems.  Thanks for watching!", "image_url": "https://nulivo.s3.us-east-2.amazonaws.com/media/users/umuto/products/1470/screenshots/Key-Takeaways-PowerPoint-Template-13.jpg?v=1", "image_path": "data/videos/14696889-c0a1-43f4-a043-7c26a0e38d76/images/image_6.webp"}]