[{"title": "Positional Vectors", "image_desc": "A diagram showing a coordinate system with an origin and a point marked in space. A vector arrow starts at the origin and points to the marked point.", "content": ["-  Positional vectors are used to represent the position of a point in space relative to a fixed origin.", "They are directed line segments that start at the origin and end at the point."], "narration": "Let's talk about positional vectors.  Imagine you have a map, and you want to describe where a specific location is. You could use directions like \"go north two blocks, then east one block.\" But a positional vector is a more direct way to describe the location. It's like a straight line drawn from the starting point (the origin) to the location you want to describe.", "slide_number": "1", "image_url": "https://www.media4math.com/sites/default/files/library_asset/images/Definition--CoordinateSystems--CartesianCoordinateSystem.png", "image_path": "data/videos/5a6408ec-0cda-4b6f-ae29-e55d9f6af9c4/images/image_1.webp"}, {"title": "Components of a Positional Vector", "image_desc": "A 3D coordinate system with the x, y, and z axes labeled. A vector arrow is drawn from the origin to a point in space, with the components of the vector shown as projections onto each axis.", "content": ["-  A positional vector in a 3D space can be represented using three components:\n    -  x-component:  The distance along the x-axis.\n    -  y-component:  The distance along the y-axis.\n    -  z-component:  The distance along the z-axis."], "narration": "To describe a positional vector in 3D space, we use three numbers, called components. These represent how far you need to move along each axis (x, y, and z) to reach the point.  Think of it like giving someone directions to a specific place in a city. You tell them how many blocks to go north, how many blocks to go east, and how many floors to go up in a building.", "slide_number": "2", "image_url": "https://cdn5.vectorstock.com/i/1000x1000/47/14/3d-coordinate-axis-vector-7814714.jpg", "image_path": "data/videos/5a6408ec-0cda-4b6f-ae29-e55d9f6af9c4/images/image_2.webp"}, {"title": "Representing Positional Vectors", "image_desc": "A diagram showing a vector arrow with its components labeled as x, y, and z.  Below the diagram are the three different ways to represent the vector: using angle brackets, using unit vectors, and using a combination of both.", "content": ["-  Positional vectors can be represented in different ways:\n    -  Using angle brackets:  '<x, y, z>'\n    -  Using unit vectors:  'x*i + y*j + z*k'\n    -  Using a combination of both:  'x*i + y*j + z*k = <x, y, z>'"], "narration": "We can write positional vectors in a few different ways. One way is using angle brackets, where we list the x, y, and z components inside the brackets. Another way is using unit vectors, which are vectors of length one along each axis. We can then multiply these unit vectors by the components of the vector to represent it.  We can also combine both methods.", "slide_number": "3", "image_url": "https://bowsguide.com/wp-content/uploads/2021/05/Parts-of-an-Arrows.jpg", "image_path": "data/videos/5a6408ec-0cda-4b6f-ae29-e55d9f6af9c4/images/image_3.webp"}, {"title": "Applications of Positional Vectors", "image_desc": "A collage of images showing applications of positional vectors in physics, engineering, and computer graphics. For example, a diagram of a projectile trajectory, a blueprint of a building, and a 3D model of a car.", "content": ["-  Positional vectors are used in various fields, including:\n    -  Physics:  Describing the position and motion of objects.\n    -  Engineering:  Designing structures and systems.\n    -  Computer graphics:  Creating and manipulating 3D models."], "narration": "Positional vectors are very useful tools in many different fields.  In physics, they help us understand how objects move and interact. In engineering, they are essential for designing structures and systems. And in computer graphics, they are used to create and manipulate 3D models.", "slide_number": "4", "image_url": "https://i.ytimg.com/vi/uFGNLcjHaFQ/maxresdefault.jpg", "image_path": "data/videos/5a6408ec-0cda-4b6f-ae29-e55d9f6af9c4/images/image_4.webp"}]