[{"slide_number": "1", "title": "Emerging Best Practices for AI in College Writing", "slide_type": "Title Slide", "content": "(No additional content for Title Slide)", "image_desc": "A stylized image of a brain with interconnected nodes, representing AI and human collaboration in learning.  The background could be a college campus scene.", "narration": "Welcome. Today, we'll explore emerging best practices for integrating AI into college-level writing classrooms, based on the experiences of Associate Professor Ethan Mollick at The Wharton School.", "image_url": "https://img.freepik.com/premium-photo/brain-composed-interconnected-network-lines-symbolizing-power-neural-connections_978035-3407.jpg?w=2000", "image_path": "data/videos/7c46c30a-7f6b-4d7b-939b-283cd07ebe20/images/image_1.webp"}, {"slide_number": "2", "title": "Mollick's Approach: Embracing AI in the Classroom", "slide_type": "Table of Contents", "content": "Focus on *how* students use AI, not just *if* they use it.\nBetter learning outcomes and happier students.\nGraduates better prepared for an AI-driven world.", "image_desc": "A photo of Ethan Mollick, Associate Professor at The Wharton School, smiling and looking at a laptop.", "narration": "Professor Mollick fully embraced AI in his classes, requiring students to use AI tools in various ways.  His focus was on how students utilized the technology, not simply whether they did. And He found this approach led to improved learning and student satisfaction.", "image_url": "https://www.sifma.org/wp-content/uploads/2018/12/Mollick-Ethan-2019-Headshot-500x500-c-default.jpg", "image_path": "data/videos/7c46c30a-7f6b-4d7b-939b-283cd07ebe20/images/image_2.webp"}, {"slide_number": "3", "title": "Mollick's Experiment: Three Class Approaches", "slide_type": "Image Right", "content": "**Extensive AI Use**\nRequired AI for idea generation, writing, app creation, image generation, etc.\n**Optional & Suggested AI Use**\nAI use required in some assignments, optional in others.  AI tools introduced and suggested, but not mandated.", "image_desc": "A split image showing a student working on a laptop on one side and a group of students brainstorming on the other.", "narration": "Professor Mollick experimented with three different approaches across his classes. One class extensively used AI across all assignments, another incorporated AI in some assignments and offered it as an option in others, and the final class was introduced to AI tools with suggestions for their use.", "image_url": "https://learnsafe.com/wp-content/uploads/2018/06/students-looking-at-computer.jpg", "image_path": "data/videos/7c46c30a-7f6b-4d7b-939b-283cd07ebe20/images/image_3.webp"}, {"slide_number": "4", "title": "The Importance of Prompt Engineering", "slide_type": "Image Right", "content": "Initial AI attempts often yield mediocre results.\nEffective prompting requires iterative refinement and co-editing.\nTraining in basic prompt engineering is crucial.", "image_desc": "A graphic illustrating different types of prompts, ranging from simple to complex and iterative, showing the improvement in output quality.", "narration": "Professor Mollick discovered that initial attempts at using AI often produce subpar results due to poor prompting.  He found that a co-editing approach, where students iteratively refine prompts based on AI output, yielded the best results and fostered deeper learning.  The Training in prompt engineering techniques is vital for success.", "image_url": "https://c8.alamy.com/comp/2BW0BG0/agile-methodology-life-cycle-diagram-scheme-infographics-with-analysis-planning-design-development-testing-review-and-launch-2BW0BG0.jpg", "image_path": "data/videos/7c46c30a-7f6b-4d7b-939b-283cd07ebe20/images/image_4.webp"}, {"slide_number": "5", "title": "Three Prompting Approaches: A Comparison", "slide_type": "Table of Contents", "content": "**Approach 1 (Ineffective): Minor Variations**\nMinimal changes to prompts, relying solely on AI.\n**Approach 3 (Effective): Co-editing**\nIterative refinement, treating AI as a collaborative partner.", "image_desc": "A comparison chart showing the three approaches with their respective strengths and weaknesses.", "narration": "He identified three main approaches students took.  Minor variations in prompts proved ineffective, while a co-editing approach, where students actively collaborated with the AI, produced significantly better results and deeper learning.", "image_url": "https://global-uploads.webflow.com/59e16042ec229e00016d3a66/5eaa025d185baea6c9a0fde7_Slide+11+(3).jpeg", "image_path": "data/videos/7c46c30a-7f6b-4d7b-939b-283cd07ebe20/images/image_5.webp"}, {"slide_number": "6", "title": "Addressing AI's Limitations: Accuracy and Bias", "slide_type": "Image with Caption", "content": "(Image caption below the image)  Students quickly learned to critically evaluate AI output, recognizing its limitations regarding accuracy and potential biases.", "image_desc": "An image depicting a student carefully reviewing an AI-generated text, highlighting sections and making notes.", "narration": "Contrary to some concerns, students readily understood the limitations of AI, including its propensity for inaccuracies and biases.  They actively fact-checked the AI's output, turning potential pitfalls into valuable learning opportunities.", "image_url": "https://img.freepik.com/premium-photo/online-tutoring-illustration-depicting-student-ai-generated_950873-1463.jpg", "image_path": "data/videos/7c46c30a-7f6b-4d7b-939b-283cd07ebe20/images/image_6.webp"}, {"slide_number": "7", "title": "Conclusion: AI's Ubiquitous Presence", "slide_type": "Image Left", "content": "AI is already prevalent in classrooms, even without explicit integration.\nImproved project outcomes and student engagement observed.\nNew challenges emerge, requiring adaptation in teaching strategies.", "image_desc": "An image showing diverse students collaborating on a project, using various technological tools, including laptops and tablets.", "narration": "Even without formal integration, AI is already prevalent in classrooms.  Professor Mollick observed improved project outcomes and student engagement.  However, new challenges arise, demanding adjustments in teaching methods to effectively navigate this evolving landscape.  Thank you.", "image_url": "https://img.freepik.com/premium-photo/group-students-collaborating-digital-project-using-tablets-laptops_1007506-6930.jpg", "image_path": "data/videos/7c46c30a-7f6b-4d7b-939b-283cd07ebe20/images/image_7.webp"}]