[{"title": "Stereotactic Body Radiation Therapy (SBRT)", "content": ["- **What is SBRT?** Stereotactic body radiation therapy (SBRT) is a highly precise form of radiation therapy that delivers high doses of radiation to a small, well-defined tumor.", "**How does it work?** SBRT uses advanced imaging techniques to pinpoint the tumor's location and shape. The radiation beams are then precisely aimed at the tumor, minimizing damage to surrounding healthy tissue.", "**Benefits of SBRT:**\n    - **High tumor control rates:** SBRT can effectively destroy tumors with fewer treatments than traditional radiation therapy.\n    - **Minimally invasive:** SBRT is a non-surgical treatment option, with minimal side effects.\n    - **Short treatment time:** SBRT treatments are typically completed in a few days or weeks.\n    - **Suitable for various cancers:** SBRT can be used to treat a wide range of cancers, including lung, liver, prostate, and brain tumors."], "image_desc": "A medical illustration depicting a patient receiving SBRT treatment, with a clear visualization of the radiation beams targeting a tumor.", "narration": "Welcome to our presentation on Stereotactic Body Radiation Therapy, or SBRT.  SBRT is a cutting-edge treatment that uses highly focused radiation beams to target tumors with pinpoint accuracy.  This allows us to deliver high doses of radiation to the tumor while minimizing damage to surrounding healthy tissue.  SBRT offers a number of advantages over traditional radiation therapy, including higher tumor control rates, shorter treatment times, and fewer side effects.  It's a minimally invasive treatment option that can be used to treat a wide range of cancers.  Let's delve deeper into the details of SBRT and explore its potential benefits for patients.", "slide_number": "1", "image_url": "https://radiotherapysingapore.com/wp-content/uploads/2022/06/a-lung-cancer-patient-going-through-sbrt-radiotherapy.jpg", "image_path": "data/videos/ea3ecefd-c6c1-4bd8-9942-f48747e70b4a/images/image_1.webp"}]