[{"title": "Microsoft Shifts User Guide", "content": ["- **Microsoft Shifts** is a powerful tool for managing schedules and assignments within your organization.", "This guide will walk you through the key features of Shifts, enabling you to effectively manage your team's work schedules."], "image_desc": "A screenshot of the Microsoft Teams app with the Shifts icon highlighted.", "narration": "Welcome to the Microsoft Shifts User Guide! This guide will provide you with a comprehensive overview of the Shifts app, empowering you to effectively manage your team's schedules and assignments within Microsoft Teams.", "slide_number": "1", "image_url": "/data/videos/91d143a0-efce-4836-bb10-e12b87af1562/images/image_1.webp", "image_path": "data/videos/91d143a0-efce-4836-bb10-e12b87af1562/images/image_1.webp"}, {"title": "Add Shifts on Teams", "content": ["- To access the Shifts app, click on the **more options** (...) icon on the left navigation bar of your Teams app.", "Select **Shifts** from the list of available apps.", "To ensure easy access, right-click on the Shifts icon and select **Pin to Teams left nav**."], "image_desc": "A screenshot showing the \"more options\" icon in Teams and the Shifts app selection.", "narration": "Let's begin by adding the Shifts app to your Teams environment. Simply click on the \"more options\" icon, located on the left navigation bar of your Teams app. From the list of available apps, select \"Shifts.\" For convenient access, right-click on the Shifts icon and choose \"Pin to Teams left nav.\"", "slide_number": "2", "image_url": "/data/videos/91d143a0-efce-4836-bb10-e12b87af1562/images/image_2.webp", "image_path": "data/videos/91d143a0-efce-4836-bb10-e12b87af1562/images/image_2.webp"}, {"title": "Reorder and View Shifts App", "content": ["- Click on **More** at the bottom of the Teams app screen.", "Select **Reorder** to move the Shifts app into your visible navigation bar.", "Click **Save** to pin the Shifts app in your navigation.", "Click on the pinned Shifts app to view upcoming shifts and access all available options."], "image_desc": "A screenshot showing the \"More\" option in Teams, the \"Reorder\" option, and the pinned Shifts app.", "narration": "To ensure the Shifts app is readily accessible, click on \"More\" at the bottom of your Teams app screen. Select \"Reorder\" to reposition the Shifts app within your visible navigation bar. Click \"Save\" to secure its position. Now, you can easily access the Shifts app by clicking on its pinned icon. This will display your upcoming shifts and provide you with a range of options for managing your schedule.", "slide_number": "3", "image_url": "/data/videos/91d143a0-efce-4836-bb10-e12b87af1562/images/image_3.webp", "image_path": "data/videos/91d143a0-efce-4836-bb10-e12b87af1562/images/image_3.webp"}, {"title": "Create a Schedule", "content": ["- Each Teams team has a single **Schedule** within the Shifts app.", "Multiple **groups** can be created within a schedule to manage separate shift assignments.", "To create a schedule, click on the team name in the top left corner of the Shifts app.", "Select **New schedule** and choose the desired team.", "Ensure the **time zone** is correct for your shifts.", "Click **Create** to finalize the schedule.", "Review the **Settings** to confirm all desired options are enabled."], "image_desc": "A screenshot showing the \"New schedule\" option in the Shifts app and the settings menu.", "narration": "Now, let's create a schedule for your team. Each Teams team has a dedicated schedule within the Shifts app. You can create multiple groups within a schedule to manage separate shift assignments. To create a schedule, click on the team name in the top left corner of the Shifts app. Select \"New schedule\" and choose the team for which you want to create a schedule. Ensure the time zone is correct for your shifts and click \"Create.\" Finally, review the settings to confirm all desired options are enabled.", "slide_number": "4", "image_url": "/data/videos/91d143a0-efce-4836-bb10-e12b87af1562/images/image_4.webp", "image_path": "data/videos/91d143a0-efce-4836-bb10-e12b87af1562/images/image_4.webp"}, {"title": "Create a Group and Add Members", "content": "- Select the desired schedule by clicking on the three horizontal bar menu icon in the top left corner of Shifts.,Click **Add group** in the top right corner of the selected schedule.", "image_desc": "A placeholder image for a video thumbnail, depicting a person creating a schedule on a computer.", "narration": "To create a group within your schedule, select the relevant schedule by clicking on the three horizontal bar menu icon in the top left corner of Shifts. Click \"Add group\" in the top right corner of the selected schedule.", "slide_number": "5", "image_url": "/data/videos/91d143a0-efce-4836-bb10-e12b87af1562/images/image_5.webp", "image_path": "data/videos/91d143a0-efce-4836-bb10-e12b87af1562/images/image_5.webp"}, {"title": "Create a Group and Add Members", "content": "- Add members to the new group by clicking **Add people** below the date line.,Search for team members within the Teams site who should be included in the group.", "image_desc": "A screenshot showing the \"Add group\" option in the Shifts app and the \"Add people\" option.", "narration": "To add members to the new group, click \"Add people\" below the date line. Search for team members within the Teams site who should be included in the group.", "slide_number": "6", "image_url": "/data/videos/91d143a0-efce-4836-bb10-e12b87af1562/images/image_6.webp", "image_path": "data/videos/91d143a0-efce-4836-bb10-e12b87af1562/images/image_6.webp"}, {"title": "Add Open Shifts and Prepare for Assignments", "content": ["- Click on any open slot in the **Open shifts** row for each date to add settings for the shift.", "Only Team owners can create new open shifts.", "To duplicate a set of time slots for multiple days, right-click on an existing slot, select **Copy**, click within the open date slot, and right-click **Paste**.", "After creating all open shifts or completing a schedule, click **Share with team** in the top right corner to make slots available for assignment.", "Team owners can assign members to open shifts.", "If members assign shifts to themselves, owners must approve those assignments on the **Requests** tab."], "image_desc": "A screenshot showing the \"Open shifts\" section in the Shifts app, the \"Copy\" and \"Paste\" options, and the \"Share with team\" button.", "narration": "Now, let's add open shifts to your schedule. Click on any open slot in the \"Open shifts\" row for each date to add settings for the shift. Only Team owners have the authority to create new open shifts. To duplicate a set of time slots for multiple days, right-click on an existing slot, select \"Copy,\" click within the open date slot, and right-click \"Paste.\" Once you have created all open shifts or completed a schedule, click \"Share with team\" in the top right corner to make slots available for assignment. Team owners can assign members to open shifts. If members assign shifts to themselves, owners must approve those assignments on the \"Requests\" tab.", "slide_number": "7", "image_url": "https://www.shifts.com/wp-content/themes/shifts/src/assets/images/pages/home/emp-graphic1.png", "image_path": "data/videos/91d143a0-efce-4836-bb10-e12b87af1562/images/image_7.webp"}, {"title": "Duplicate Weekly Schedules", "content": ["- To duplicate a weekly shift set, click **Copy schedule**.", "The default setting copies the schedule to the next week.", "You can extend the duplication up to three weeks."], "image_desc": "A screenshot showing the \"Copy schedule\" option in the Shifts app.", "narration": "To streamline your scheduling process, you can duplicate a weekly shift set. Click \"Copy schedule\" to duplicate the current week's schedule. By default, the schedule will be copied to the next week. However, you can extend the duplication up to three weeks.", "slide_number": "8", "image_url": "/data/videos/91d143a0-efce-4836-bb10-e12b87af1562/images/image_8.webp", "image_path": "data/videos/91d143a0-efce-4836-bb10-e12b87af1562/images/image_8.webp"}, {"title": "Requests (Time Off, Swap, Offers)", "content": ["- All requests are managed under the **Requests** tab.", "You can request **Time off** (separate from official PTO requests).", "You can set up a **Swap** for a shift.", "You can **Offer** your shift to a colleague."], "image_desc": "A screenshot showing the \"Requests\" tab in the Shifts app, with options for \"Time off,\" \"Swap,\" and \"Offer.\"", "narration": "The \"Requests\" tab is your central hub for managing shift-related requests. Here, you can request time off, which is separate from official PTO requests. You can also set up a swap for a shift, exchanging your shift with a colleague. Additionally, you can offer your shift to a colleague if you are unable to work it.", "slide_number": "9", "image_url": "/data/videos/91d143a0-efce-4836-bb10-e12b87af1562/images/image_9.webp", "image_path": "data/videos/91d143a0-efce-4836-bb10-e12b87af1562/images/image_9.webp"}, {"title": "Approve Requests", "content": ["- Team site owners are responsible for approving requests under the **Requests** tab.", "Approve **Time off** requests.", "Approve **self-assignment** requests for open shifts.", "**Swaps** and **offers** will be visible to the relevant team members and do not require owner approval."], "image_desc": "A screenshot showing the \"Requests\" tab in the Shifts app, with options for approving \"Time off,\" \"self-assignment,\" \"Swaps,\" and \"Offers.\"", "narration": "Team site owners have the responsibility of approving requests under the \"Requests\" tab. Approve time off requests and self-assignment requests for open shifts. Swaps and offers will be visible to the relevant team members and do not require owner approval.", "slide_number": "10", "image_url": "/data/videos/91d143a0-efce-4836-bb10-e12b87af1562/images/image_10.webp", "image_path": "data/videos/91d143a0-efce-4836-bb10-e12b87af1562/images/image_10.webp"}, {"title": "Microsoft Shifts Video Guides", "content": "- Explore the **collegites AI video generator tool** for creating detailed instructions and visual demonstrations effortlessly.\n\n**Use Case:**\n\n**Online Learning:** Instructors can quickly create video lessons to explain complex topics with visuals and narration.\n\n**Project Presentations:** Students can make interactive videos to showcase their projects, enhancing appeal.\n\n**Tutorials:** Users can design step-by-step tutorials for software or concepts, improving understanding.\n\n**Team Collaboration:** Teams can produce clear guides for projects, boosting communication and teamwork.", "image_desc": "A placeholder image for a video thumbnail, depicting a person watching a video tutorial on a computer.", "narration": "Thanks for joining us! The Collegites AI Video Generator makes it super easy to create awesome instruction videos. Ready to get started? Try it out and make your content shine! ", "slide_number": "11", "image_url": "/data/videos/91d143a0-efce-4836-bb10-e12b87af1562/images/image_11.webp", "image_path": "data/videos/91d143a0-efce-4836-bb10-e12b87af1562/images/image_11.webp"}]