[{"slide_number": "1", "title": "Introduction to AI", "slide_type": "Title Slide", "content": "(No additional content for Title Slide)", "image_desc": "A futuristic cityscape with glowing holographic displays showing data streams and interconnected networks, symbolizing the interconnected nature of AI and its impact on modern life. Type: illustration\n\n### Video Suggestion:\nA stock footage video showing a fast-paced montage of technological advancements, including AI-related imagery like robots, data visualizations, and neural networks.", "narration": "Welcome to this short introduction to Artificial Intelligence.  In this video, we'll briefly explore what AI is and some of its key applications.", "image_url": "https://thumbs.dreamstime.com/z/futuristic-cityscape-interconnected-smart-buildings-big-data-connection-technology-concept-generative-ai-279826982.jpg", "image_path": "data/videos/9ba7201e-57d8-4845-8706-bae3d2676292/images/image_1.webp"}, {"slide_number": "2", "title": "AI Applications", "slide_type": "Two Columns", "content": "**Column 1: Everyday AI**\nPersonalized recommendations (e.g., Netflix, Spotify)\nSpam filters in email\nVirtual assistants (e.g., Siri, Alexa)\n**Column 2: Advanced AI**\nMedical diagnosis and treatment\nSelf-driving cars\nClimate change modeling", "image_desc": "A split image showing two distinct scenarios: one side depicts a person using a smartphone with personalized recommendations, and the other side shows a futuristic self-driving car navigating a city street. Type: illustration\n\n### Video Suggestion:\nN/A", "narration": "AI is already integrated into many aspects of our daily lives, from personalized recommendations on streaming services to spam filters protecting our inboxes.  But AI's potential extends far beyond these everyday applications.  Advanced AI is being used to revolutionize fields like medicine, transportation, and environmental science, offering solutions to complex problems and driving innovation across various sectors.  This is just a glimpse into the world of AI, and its future applications are truly limitless.", "image_url": "https://im.indiatimes.in/content/2020/Jan/3_5e22997e96aa9.jpg", "image_path": "data/videos/9ba7201e-57d8-4845-8706-bae3d2676292/images/image_2.webp"}]