[{"title": "What is Photosynthesis?", "content": ["- Photosynthesis is the process by which plants and some other organisms use sunlight to synthesize foods with the help of carbon dioxide and water.", "The word \"photosynthesis\" comes from the Greek words \"phos\" (light) and \"synthesis\" (combining together).", "This means \"combining together with the help of light.\""], "image_desc": "A close-up image of a green leaf with sunlight shining on it.", "narration": "Photosynthesis kya hai? Ye ek process hai jisme plants aur kuchh aur organisms sunlight ka use karke carbon dioxide aur water se apna khana banate hain. \"Photosynthesis\" shabd Greek shabdo \"phos\" (light) aur \"synthesis\" (combining together) se aaya hai. Iska matlab hai \"light ki madad se combine karna\".", "slide_number": "1", "image_url": "https://thumbs.dreamstime.com/z/close-up-green-leaves-sunlight-shining-created-generative-ai-274215734.jpg", "image_path": "data/videos/6001720b-644c-46e6-8ed9-7de6be35366b/images/image_1.webp"}, {"title": "Organisms that Photosynthesize", "content": ["- Green plants are the most common organisms that perform photosynthesis.", "Other organisms that perform photosynthesis include:\n    - Cyanobacteria\n    - Purple bacteria\n    - Green sulfur bacteria"], "image_desc": "A microscopic image of cyanobacteria.", "narration": "Green plants sabse zyada photosynthesis karte hain. Iske alawa kuchh aur organisms bhi hain jo photosynthesis karte hain, jaise ki cyanobacteria, purple bacteria aur green sulfur bacteria.", "slide_number": "2", "image_url": "https://microbewiki.kenyon.edu/images/1/10/CyanobacteriaMicroscope.jpeg", "image_path": "data/videos/6001720b-644c-46e6-8ed9-7de6be35366b/images/image_2.webp"}, {"title": "The Process of Photosynthesis", "content": ["- Photosynthesis occurs in chloroplasts, which are organelles found in plant cells.", "Chloroplasts contain chlorophyll, a green pigment that absorbs light energy.", "The process can be summarized as follows:\n    - Light energy is absorbed by chlorophyll.\n    - This energy is used to split water molecules, releasing oxygen as a by-product.\n    - Carbon dioxide is taken in from the air.\n    - The energy from light is used to combine carbon dioxide and water to form glucose (a sugar)."], "image_desc": "A diagram showing the process of photosynthesis inside a chloroplast.", "narration": "Photosynthesis chloroplasts mein hota hai, jo ki plant cells mein hote hain. Chloroplasts mein chlorophyll hota hai, ek green pigment jo light energy absorb karta hai. Is process ko aise samjha ja sakta hai:\n    - Light energy chlorophyll se absorb hota hai.\n    - Is energy ka use water molecules ko todne ke liye hota hai, aur oxygen release hota hai.\n    - Carbon dioxide hawa se liya jata hai.\n    - Light se aayi energy ka use carbon dioxide aur water ko combine karne ke liye hota hai, jisse glucose (ek sugar) banta hai.", "slide_number": "3", "image_url": "https://rsscience.com/wp-content/uploads/2020/10/photosynthesis-1024x798.jpg", "image_path": "data/videos/6001720b-644c-46e6-8ed9-7de6be35366b/images/image_3.webp"}, {"title": "Products of Photosynthesis", "content": ["- The primary product of photosynthesis is glucose, a simple sugar that provides energy for the plant.", "Oxygen is released as a by-product of photosynthesis.", "Other products include:\n    - Cellulose, a structural material used in plant cell walls.\n    - Starch, a complex carbohydrate that stores energy."], "image_desc": "A picture of a plant with its roots, stem, leaves, and flowers.", "narration": "Photosynthesis ka primary product glucose hai, ek simple sugar jo plant ko energy deta hai. Oxygen photosynthesis ka by-product hai. Iske alawa aur bhi products hain, jaise ki:\n    - Cellulose, ek structural material jo plant cell walls mein use hota hai.\n    - Starch, ek complex carbohydrate jo energy store karta hai.", "slide_number": "4", "image_url": "https://kidspressmagazine.com/wp-content/uploads/2014/04/dreamstimelarge_25428600.jpg", "image_path": "data/videos/6001720b-644c-46e6-8ed9-7de6be35366b/images/image_4.webp"}]