[{"slide_number": "1", "title": "Atoms and Molecules", "slide_type": "Title Slide", "content": "No Content", "image_desc": "No Image Description", "video_desc": "atoms molecules", "narration": "Welcome to the fascinating world of atoms and molecules In this class we will explore the fundamental building blocks of matter and understand how they combine to form everything around us. Get ready to delve into the microscopic realm and unravel the secrets of the universe.", "image_urls": ["No Image Found"], "image_path": "data/videos/d86e4dde-d26a-4a93-a19a-81fe8c97f846/images/image_1.webp", "video_urls": ["https://videos.pexels.com/video-files/10419504/10419504-sd_426_240_25fps.mp4"], "video_path": "data/videos/d86e4dde-d26a-4a93-a19a-81fe8c97f846/images/video_1.mp4"}, {"slide_number": "2", "title": "What are Atoms?", "slide_type": "Image Left", "content": "Atoms are the smallest unit of an element.\nThey cannot be broken down further by chemical means.\nAtoms consist of protons, neutrons, and electrons.", "image_desc": "Atom structure diagram showing protons, neutrons, and electrons. Type: diagram", "video_desc": "", "narration": "Atoms are the basic building blocks of all matter. They're the smallest unit of an element that can participate in a chemical reaction. An atom is composed of a nucleus containing protons and neutrons surrounded by electrons orbiting in specific energy levels.", "image_urls": ["https://s3.eu-west-2.amazonaws.com/elements.cognitoedu.org/bea256c5-26fc-47c5-9036-b5898329d237/atom-structure-diagram.png"], "image_path": "data/videos/d86e4dde-d26a-4a93-a19a-81fe8c97f846/images/image_2.webp", "video_urls": ["No Video Found"], "video_path": "data/videos/d86e4dde-d26a-4a93-a19a-81fe8c97f846/images/video_2.mp4"}, {"slide_number": "3", "title": "What are Molecules?", "slide_type": "Image Right", "content": "Molecules are formed when two or more atoms chemically bond together.\nThey can be made of the same element (e.g., O2) or different elements (e.g., H2O).\nMolecules have distinct properties different from their constituent atoms.", "image_desc": "Water molecule (H2O) and Oxygen molecule (O2) diagrams. Type: diagram", "video_desc": "", "narration": "Molecules are formed when two or more atoms are chemically bonded together. These bonds create stable arrangements of atoms. A molecule can consist of the same type of atom like oxygen gas O two or different types of atoms such as water H two O. The properties of a molecule are often very different from the properties of the individual atoms that make it up.", "image_urls": ["https://www.shutterstock.com/image-illustration/illustration-water-molecule-showcasing-composition-600nw-2540668371.jpg"], "image_path": "data/videos/d86e4dde-d26a-4a93-a19a-81fe8c97f846/images/image_3.webp", "video_urls": ["No Video Found"], "video_path": "data/videos/d86e4dde-d26a-4a93-a19a-81fe8c97f846/images/video_3.mp4"}, {"slide_number": "4", "title": "Atomic Mass and Molecular Mass", "slide_type": "Two Columns", "content": "**Atomic Mass**\nThe mass of an atom, usually expressed in atomic mass units (amu).\nApproximately equal to the number of protons plus the number of neutrons in the nucleus.\nCarbon-twelve is used as the standard for measuring atomic mass.\n**Molecular Mass**\nThe sum of the atomic masses of all the atoms in a molecule.\nExpressed in atomic mass units (amu).\nHelps determine the molar mass of a substance.", "image_desc": "Periodic table excerpt showing atomic mass. Type: chart", "video_desc": "", "narration": "Atomic mass is the mass of a single atom usually measured in atomic mass units or amu. It's essentially the sum of the number of protons and neutrons in the atom's nucleus. Molecular mass on the other hand is the sum of the atomic masses of all the atoms within a molecule. Both atomic and molecular mass are crucial for understanding chemical reactions and determining the molar mass of substances.", "image_urls": ["https://sciencenotes.org/wp-content/uploads/2020/04/PeriodicTableAtomicMassColor.png"], "image_path": "data/videos/d86e4dde-d26a-4a93-a19a-81fe8c97f846/images/image_4.webp", "video_urls": ["No Video Found"], "video_path": "data/videos/d86e4dde-d26a-4a93-a19a-81fe8c97f846/images/video_4.mp4"}]