[{"title": "What is Machine Learning?", "image_desc": "A computer screen displaying data points and a graph with a line of best fit, representing a machine learning algorithm.", "content": "- Machine learning is a type of **artificial intelligence** (AI) that allows computers to learn from data without being explicitly programmed.,It uses algorithms to analyze data and make predictions or decisions.", "narration": "આપણે શીખીએ છીએ કે મશીન લર્નિંગ શું છે. મશીન લર્નિંગ એ આર્ટિફિશિયલ ઇન્ટેલિજન્સનો એક ભાગ છે જે કમ્પ્યુટર્સને ડેટામાંથી શીખવાની ક્ષમતા આપે છે.  તે ડેટાનું વિશ્લેષણ કરવા અને ભવિષ્યવાણી કરવા માટે એલ્ગોરિધમનો ઉપયોગ કરે છે.", "slide_number": "1", "image_url": "https://img.freepik.com/premium-vector/closeup-computer-screen-displaying-series-data-points-algorithms-representing_216520-14814.jpg", "image_path": "data/videos/e4d4e45a-9f9b-4827-a3b6-bf14c887a50e/images/image_1.webp"}, {"title": "How Machine Learning Works", "image_desc": "A flowchart showing the steps of machine learning, from data collection to prediction.", "content": ["- Machine learning algorithms are trained on large datasets.", "The algorithms learn patterns and relationships in the data.", "Once trained, the algorithm can make predictions on new data."], "narration": "મશીન લર્નિંગ એલ્ગોરિધમ મોટા ડેટાસેટ પર તાલીમ પામે છે. તે ડેટામાં પેટર્ન અને સંબંધો શીખે છે. તાલીમ પછી, એલ્ગોરિધમ નવા ડેટા પર ભવિષ્યવાણી કરી શકે છે.", "slide_number": "2", "image_url": "https://www.gatevidyalay.com/wp-content/uploads/2019/12/Machine-Learning-Workflow.png", "image_path": "data/videos/e4d4e45a-9f9b-4827-a3b6-bf14c887a50e/images/image_2.webp"}, {"title": "Types of Machine Learning", "image_desc": "A diagram showing three different types of machine learning: supervised, unsupervised, and reinforcement learning.", "content": "- **Supervised Learning:** The algorithm is trained on labeled data.,**Unsupervised Learning:** The algorithm is trained on unlabeled data.,**Reinforcement Learning:** The algorithm learns through trial and error.", "narration": "મશીન લર્નિંગના ઘણા પ્રકાર છે. સુપરવાઇઝ્ડ લર્નિંગમાં, એલ્ગોરિધમ લેબલવાળા ડેટા પર તાલીમ પામે છે. અનસુપરવાઇઝ્ડ લર્નિંગમાં, એલ્ગોરિધમ લેબલ ન હોય તેવા ડેટા પર તાલીમ પામે છે. રિઇન્ફોર્સમેન્ટ લર્નિંગમાં, એલ્ગોરિધમ પ્રયોગ અને ભૂલ દ્વારા શીખે છે.", "slide_number": "3", "image_url": "https://lh6.googleusercontent.com/N-O-hAxzjvu57tlEDAzbviuctxozcl19FCQ8W5OKzl2ZCmEnDMSVXbNvIeE9S0kZRbVeQHq8aeEEvU0Dr5R22IXlNPCyv6anB2pdGmIYpCH5CSB3GaCZ51uHwD-JJmIViAt6YefW", "image_path": "data/videos/e4d4e45a-9f9b-4827-a3b6-bf14c887a50e/images/image_3.webp"}, {"title": "Applications of Machine Learning", "image_desc": "A collage of images showing different applications of machine learning, such as image recognition, natural language processing, and recommendation systems.", "content": ["- **Image Recognition:** Identifying objects in images.", "**Natural Language Processing:** Understanding and generating human language.", "**Recommendation Systems:** Suggesting products or content based on user preferences."], "narration": "મશીન લર્નિંગનો ઉપયોગ ઘણા ક્ષેત્રોમાં થાય છે. ઉદાહરણ તરીકે, છબીઓમાં વસ્તુઓ ઓળખવા માટે છબી ઓળખાણ, માનવ ભાષા સમજવા અને ઉત્પન્ન કરવા માટે નેચરલ લેંગ્વેજ પ્રોસેસિંગ, અને વપરાશકર્તાની પસંદગીઓના આધારે ઉત્પાદનો અથવા સામગ્રી સૂચવવા માટે ભલામણ સિસ્ટમ.", "slide_number": "4", "image_url": "https://datasciencedojo.com/wp-content/uploads/MicrosoftTeams-image-34-1.jpg", "image_path": "data/videos/e4d4e45a-9f9b-4827-a3b6-bf14c887a50e/images/image_4.webp"}, {"title": "Conclusion", "image_desc": "A futuristic cityscape with robots and AI systems, representing the potential of machine learning.", "content": ["- Machine learning is a powerful tool for solving complex problems.", "It is rapidly evolving and has the potential to transform many industries."], "narration": "મશીન લર્નિંગ એ જટિલ સમસ્યાઓ ઉકેલવા માટે એક શક્તિશાળી સાધન છે. તે ઝડપથી વિકાસ પામી રહ્યું છે અને ઘણા ઉદ્યોગોને બદલવાની ક્ષમતા ધરાવે છે.", "slide_number": "5", "image_url": "/data/videos/e4d4e45a-9f9b-4827-a3b6-bf14c887a50e/images/image_5.webp", "image_path": "data/videos/e4d4e45a-9f9b-4827-a3b6-bf14c887a50e/images/image_5.webp"}]