[{"slide_number": "1", "title": "रतन टाटा: एक जीवन यात्रा", "slide_type": "Title Slide", "content": ["- (No additional content for Title Slide)"], "image_desc": "- A portrait of Ratan Tata in his younger years, looking confident and determined.", "narration": "नमस्कार! आज हम रतन टाटा के जीवन और कार्यों पर नज़र डालेंगे, एक ऐसे व्यक्ति पर जिसने भारत के उद्योग जगत में क्रांति ला दी।", "image_url": "https://wp.scoopwhoop.com/wp-content/uploads/2020/01/5e2e82cf50758d4cadd4bb10_73969af1-b472-43d2-8ad4-2695d49d8df4.jpg", "image_path": "data/videos/51c62981-0ae2-41e3-b27e-756339647596/images/image_1.webp"}, {"slide_number": "2", "title": "प्रारंभिक जीवन", "slide_type": "Image Left", "content": ["- रतन टाटा का जन्म 28 दिसंबर, 1937 को मुंबई में हुआ था।", "- उन्होंने अपने शुरुआती वर्ष अपने दादाजी, जमशेदजी टाटा के साथ बिताए, जो टाटा समूह के संस्थापक थे।", "- रतन टाटा ने इंजीनियरिंग की पढ़ाई की और बाद में हार्वर्ड बिजनेस स्कूल से एमबीए किया।"], "image_desc": "- A black and white photo of a young Ratan Tata with his grandfather, Jamsetji Tata.", "narration": "रतन टाटा का जन्म 28 दिसंबर, 1937 को मुंबई में हुआ था। उनके दादाजी, जमशेदजी टाटा, टाटा समूह के संस्थापक थे। रतन टाटा ने अपने शुरुआती वर्ष अपने दादाजी के साथ बिताए और उनसे प्रेरणा ली। उन्होंने इंजीनियरिंग की पढ़ाई की और बाद में हार्वर्ड बिजनेस स्कूल से एमबीए किया।", "image_url": "https://upload.wikimedia.org/wikipedia/commons/5/55/Naval_tata.jpg", "image_path": "data/videos/51c62981-0ae2-41e3-b27e-756339647596/images/image_2.webp"}, {"slide_number": "3", "title": "टाटा समूह के नेतृत्व में", "slide_type": "Image Right", "content": ["- 1991 में, रतन टाटा टाटा समूह के चेयरमैन बने।", "- उनके नेतृत्व में, टाटा समूह ने कई नए क्षेत्रों में प्रवेश किया, जैसे कि टेलीकॉम, रिटेल और सॉफ्टवेयर।", "- उन्होंने टाटा समूह को एक वैश्विक स्तर पर स्थापित करने में महत्वपूर्ण भूमिका निभाई।"], "image_desc": "- A photo of Ratan Tata in his office, looking focused and determined.", "narration": "1991 में, रतन टाटा टाटा समूह के चेयरमैन बने। उनके नेतृत्व में, टाटा समूह ने कई नए क्षेत्रों में प्रवेश किया, जैसे कि टेलीकॉम, रिटेल और सॉफ्टवेयर। उन्होंने टाटा समूह को एक वैश्विक स्तर पर स्थापित करने में महत्वपूर्ण भूमिका निभाई।", "image_url": "https://images.pexels.com/photos/16970504/pexels-photo-16970504.jpeg", "image_path": "data/videos/51c62981-0ae2-41e3-b27e-756339647596/images/image_3.webp"}, {"slide_number": "4", "title": "सामाजिक उत्तरदायित्व", "slide_type": "Table of Contents", "content": ["- **Column 1**:", "- रतन टाटा ने हमेशा सामाजिक उत्तरदायित्व पर जोर दिया।", "- उन्होंने टाटा ट्रस्ट के माध्यम से कई सामाजिक कार्यक्रमों का समर्थन किया।", "- उन्होंने शिक्षा, स्वास्थ्य और पर्यावरण संरक्षण के क्षेत्र में महत्वपूर्ण योगदान दिया।", "- **Column 2**:", "- रतन टाटा ने कई प्राकृतिक आपदाओं के दौरान मदद की, जैसे कि 2004 के सुनामी और 2001 के गुजरात भूकंप।", "- उन्होंने गरीबी उन्मूलन और महिला सशक्तिकरण के लिए भी काम किया।", "- उनके सामाजिक कार्यों के लिए उन्हें कई पुरस्कार मिले।"], "image_desc": "- A collage of images showcasing Ratan Tata's social work, including his involvement in disaster relief efforts and educational initiatives.", "narration": "रतन टाटा ने हमेशा सामाजिक उत्तरदायित्व पर जोर दिया। उन्होंने टाटा ट्रस्ट के माध्यम से कई सामाजिक कार्यक्रमों का समर्थन किया। उन्होंने शिक्षा, स्वास्थ्य और पर्यावरण संरक्षण के क्षेत्र में महत्वपूर्ण योगदान दिया। उन्होंने कई प्राकृतिक आपदाओं के दौरान मदद की, जैसे कि 2004 के सुनामी और 2001 के गुजरात भूकंप। उन्होंने गरीबी उन्मूलन और महिला सशक्तिकरण के लिए भी काम किया। उनके सामाजिक कार्यों के लिए उन्हें कई पुरस्कार मिले।", "image_url": "https://assets.gatesnotes.com/8a5ac0b3-6095-00af-c50a-89056fbe4642/c8c6ee98-2468-47f1-af78-ade69d465d39/4338202d5d54441cacd747fba9a79e7b.jpg", "image_path": "data/videos/51c62981-0ae2-41e3-b27e-756339647596/images/image_4.webp"}, {"slide_number": "5", "title": "विरासत", "slide_type": "Image Right", "content": ["- रतन टाटा ने टाटा समूह को एक वैश्विक स्तर पर स्थापित करने में महत्वपूर्ण भूमिका निभाई।", "- उनके नेतृत्व और दूरदर्शिता ने टाटा समूह को एक सफल और सम्मानित संगठन बनाया।", "- उनकी विरासत आज भी टाटा समूह को प्रेरित करती है।"], "image_desc": "- A photo of Ratan Tata standing in front of the iconic Taj Mahal Palace Hotel in Mumbai, a symbol of the Tata Group's legacy.", "narration": "रतन टाटा ने टाटा समूह को एक वैश्विक स्तर पर स्थापित करने में महत्वपूर्ण भूमिका निभाई। उनके नेतृत्व और दूरदर्शिता ने टाटा समूह को एक सफल और सम्मानित संगठन बनाया। उनकी विरासत आज भी टाटा समूह को प्रेरित करती है।", "image_url": "https://images.pexels.com/photos/13457681/pexels-photo-13457681.jpeg", "image_path": "data/videos/51c62981-0ae2-41e3-b27e-756339647596/images/image_5.webp"}, {"slide_number": "6", "title": "निष्कर्ष", "slide_type": "Image Left", "content": ["- रतन टाटा एक प्रेरणादायक व्यक्ति हैं जिन्होंने भारत के उद्योग जगत में एक स्थायी छाप छोड़ी है।", "- उनके नेतृत्व, दूरदर्शिता और सामाजिक उत्तरदायित्व ने उन्हें एक आदर्श नेता बना दिया है।", "- उनकी कहानी हमें प्रेरित करती है कि हम अपने सपनों को पूरा करने के लिए कड़ी मेहनत करें और समाज के लिए कुछ अच्छा करें।"], "image_desc": "- A photo of Ratan Tata smiling and looking towards the future, symbolizing his legacy of innovation and progress.", "narration": "रतन टाटा एक प्रेरणादायक व्यक्ति हैं जिन्होंने भारत के उद्योग जगत में एक स्थायी छाप छोड़ी है। उनके नेतृत्व, दूरदर्शिता और सामाजिक उत्तरदायित्व ने उन्हें एक आदर्श नेता बना दिया है। उनकी कहानी हमें प्रेरित करती है कि हम अपने सपनों को पूरा करने के लिए कड़ी मेहनत करें और समाज के लिए कुछ अच्छा करें।", "image_url": "https://images.pexels.com/photos/8438969/pexels-photo-8438969.jpeg", "image_path": "data/videos/51c62981-0ae2-41e3-b27e-756339647596/images/image_6.webp"}, {"slide_number": "7", "title": "धन्यवाद", "slide_type": "Title Slide", "content": ["- (No additional content for Title Slide)"], "image_desc": "- A simple image of a thank you note with a background of the Indian flag.", "narration": "धन्यवाद!", "image_url": "https://c8.alamy.com/comp/2BF0GYJ/thank-you-message-with-india-flag-heart-3d-render-2BF0GYJ.jpg", "image_path": "data/videos/51c62981-0ae2-41e3-b27e-756339647596/images/image_7.webp"}]