[{"slide_number": "1", "title": "Atomic Structure", "slide_type": "Title Slide", "content": ["- (No additional content for Title Slide)"], "image_desc": "- A colorful illustration of an atom with a nucleus and orbiting electrons.", "narration": "Welcome to this video about atomic structure. We'll explore the fundamental building blocks of matter and how they interact.", "image_url": "https://c8.alamy.com/comp/2X6W4TB/colorful-abstract-vector-illustration-of-atom-model-with-electrons-orbiting-nucleus-representing-scientific-concept-in-chemistry-physics-biology-and-technology-2X6W4TB.jpg", "image_path": "data/videos/a878c90e-25b2-436e-85e1-1608e5f8cba8/images/image_1.webp"}, {"slide_number": "2", "title": "The Nucleus", "slide_type": "Image Left", "content": ["- The nucleus is the dense, positively charged center of an atom.", "- It contains protons and neutrons.", "- Protons have a positive charge, while neutrons have no charge."], "image_desc": "- A close-up image of an atom's nucleus with protons and neutrons represented as colored spheres.", "narration": "Let's start with the nucleus, the atom's core. It's like the sun of our atomic solar system. Inside the nucleus, we find protons and neutrons. Protons carry a positive charge, while neutrons are neutral.", "image_url": "https://www.sciencefacts.net/wp-content/uploads/2020/11/Parts-of-an-Atom-Diagram-768x768.jpg", "image_path": "data/videos/a878c90e-25b2-436e-85e1-1608e5f8cba8/images/image_2.webp"}, {"slide_number": "3", "title": "Electrons", "slide_type": "Image Right", "content": ["- Electrons are negatively charged particles that orbit the nucleus.", "- They exist in specific energy levels called shells.", "- The number of electrons in each shell determines the atom's chemical properties."], "image_desc": "- An illustration of an atom with electrons orbiting the nucleus in different energy levels.", "narration": "Orbiting the nucleus, we find electrons. These tiny particles carry a negative charge and exist in specific energy levels, like shells around the nucleus. The arrangement of electrons in these shells determines how an atom interacts with other atoms, influencing its chemical behavior.", "image_url": "https://images.pexels.com/photos/5842129/pexels-photo-5842129.jpeg", "image_path": "data/videos/a878c90e-25b2-436e-85e1-1608e5f8cba8/images/image_3.webp"}]