[{"slide_number": "1", "title": "The Human Heart: Class 7 CBSE", "slide_type": "Title Slide", "content": "(No additional content for Title Slide)", "image_desc": "A detailed anatomical illustration of the human heart, showing its chambers (atria and ventricles), valves (tricuspid, mitral, pulmonary, and aortic), major blood vessels (aorta, vena cava, pulmonary artery, pulmonary veins), and coronary arteries. Type: illustration\n\n### Video Suggestion:\nA stock footage video showing a 3D animation of a beating human heart.", "narration": "Welcome to this presentation on the human heart, a topic covered in your Class 7 CBSE curriculum.  We'll explore its structure and function.", "image_url": "http://www.mayoclinic.org/-/media/kcms/gbs/patient-consumer/images/2014/09/22/12/43/mcdc7_theheart.ashx", "image_path": "data/videos/973547a1-e0aa-48a1-825c-3a89e7448e2e/images/image_1.webp"}, {"slide_number": "2", "title": "Structure of the Heart", "slide_type": "Image Left", "content": "Four Chambers: Two atria and two ventricles.\nValves: Control blood flow between chambers.\nBlood Vessels: Carry blood to and from the heart.", "image_desc": "A simplified diagram of the human heart showing the four chambers (left and right atria, left and right ventricles), the valves between them, and the major blood vessels connected to the heart (aorta, vena cava, pulmonary artery, and pulmonary veins).  Type: diagram\n\n### Video Suggestion:\nN/A", "narration": "Let's begin by looking at the heart's structure.  As you can see, it has four chambers: two upper chambers called atria and two lower chambers called ventricles.  Valves are crucial for ensuring blood flows in the correct direction.  Blood vessels transport blood throughout the body.", "image_url": "http://www.mayoclinic.org/-/media/kcms/gbs/patient-consumer/images/2014/09/22/12/43/mcdc7_theheart.ashx", "image_path": "data/videos/973547a1-e0aa-48a1-825c-3a89e7448e2e/images/image_2.webp"}, {"slide_number": "3", "title": "The Heart's Function: Circulation", "slide_type": "Image Right", "content": "Pulmonary Circulation: Blood flow to and from the lungs.\nSystemic Circulation: Blood flow to the rest of the body.", "image_desc": "A diagram illustrating pulmonary and systemic circulation, showing the path of oxygenated and deoxygenated blood through the heart and lungs, and to the rest of the body. Type: diagram\n\n### Video Suggestion:\nN/A", "narration": "The heart's primary function is to pump blood throughout the body. This happens through two main circulatory pathways: pulmonary circulation, which involves the lungs, and systemic circulation, which supplies blood to the rest of the body.", "image_url": "http://4.bp.blogspot.com/-Yhm30NV_DyY/UXk9XEquoBI/AAAAAAAABCM/EQvL5wRrQO0/s1600/blood+circulation.jpg", "image_path": "data/videos/973547a1-e0aa-48a1-825c-3a89e7448e2e/images/image_3.webp"}, {"slide_number": "4", "title": "Keeping Your Heart Healthy", "slide_type": "Image with Caption", "content": "(Content is within the caption below the image)", "image_desc": "A photograph of a person exercising outdoors, such as jogging in a park. Type: photograph\n\n### Video Suggestion:\nN/A", "narration": "Maintaining a healthy heart is vital.  Regular exercise, a balanced diet, and avoiding smoking are key steps to ensuring a healthy cardiovascular system.\n\n\n### Slide Content (Caption):\nRegular exercise, a balanced diet, and avoiding smoking are essential for a healthy heart.", "image_url": "https://thumbs.dreamstime.com/z/group-people-exercise-walking-jogging-park-group-people-exercise-walking-jogging-park-morning-116052916.jpg", "image_path": "data/videos/973547a1-e0aa-48a1-825c-3a89e7448e2e/images/image_4.webp"}, {"slide_number": "5", "title": "Summary", "slide_type": "Table of Contents", "content": "Structure of the Heart\nFunction of the Heart: Circulation\nKeeping Your Heart Healthy", "image_desc": "N/A\n\n### Video Suggestion:\nN/A", "narration": "We've covered the structure and function of the human heart, and learned about ways to keep it healthy. Remember to maintain a healthy lifestyle! Thank you.", "image_url": "/data/videos/973547a1-e0aa-48a1-825c-3a89e7448e2e/images/image_5.webp", "image_path": "data/videos/973547a1-e0aa-48a1-825c-3a89e7448e2e/images/image_5.webp"}]