[{"title": "Introduction to HR Analytics", "content": ["- **HR analytics** is the use of data to understand and improve HR processes and decisions.", "It involves collecting, analyzing, and interpreting data to gain insights into employee performance, engagement, and other key HR metrics.", "HR analytics can be used to improve recruitment, training, retention, and overall organizational effectiveness."], "image_desc": "A graph showing the growth of HR analytics over time.", "narration": "Welcome to this presentation on HR analytics. In this presentation, we'll explore the different types of HR analytics and how they can be used to improve HR processes and decision-making.", "slide_number": "1", "image_url": "https://hrdictionary.files.wordpress.com/2012/10/evolution-of-hrm1.jpg", "image_path": "data/videos/5878df18-a406-4b8d-88e0-cb77d3ff64f4/images/image_1.webp"}, {"title": "Types of HR Analytics", "content": ["- **Descriptive HR analytics** examines historical data to see what has occurred during a specific time.", "**Diagnostic HR analytics** investigates data to ascertain the causes of past occurrences and behaviors.", "**Predictive HR analytics** explores current and historical data and uses statistical models and forecasts to predict future behaviors and events.", "**Prescriptive HR analytics** suggests potential future outcomes and scenarios and proposes recommendations for addressing them."], "image_desc": "A pie chart showing the different types of HR analytics.", "narration": "There are four main types of HR analytics: descriptive, diagnostic, predictive, and prescriptive. Let's take a closer look at each type.", "slide_number": "2", "image_url": "http://intellspot.com/wp-content/uploads/2020/03/Pie-chart-example.png", "image_path": "data/videos/5878df18-a406-4b8d-88e0-cb77d3ff64f4/images/image_2.webp"}, {"title": "Descriptive HR Analytics", "content": ["- **Descriptive HR analytics** answers the question: *What happened?*", "It focuses on summarizing past data to understand trends and patterns.", "Examples include:\n    - Employee turnover rate\n    - Average salary\n    - Time to fill open positions"], "image_desc": "A bar graph showing employee turnover rates over the past five years.", "narration": "Descriptive HR analytics is all about understanding the past. It helps us to see what has happened in our organization and to identify any trends or patterns. For example, we might use descriptive analytics to track our employee turnover rate over time.", "slide_number": "3", "image_url": "https://www.slideteam.net/media/catalog/product/cache/1280x720/b/a/bar_graph_for_rate_of_employee_turnover_example_of_ppt_presentation_Slide01.jpg", "image_path": "data/videos/5878df18-a406-4b8d-88e0-cb77d3ff64f4/images/image_3.webp"}, {"title": "Diagnostic HR Analytics", "content": ["- **Diagnostic HR analytics** answers the question: *Why did it happen?*", "It investigates the causes of past events and behaviors.", "Examples include:\n    - Identifying the reasons for high employee turnover\n    - Analyzing employee satisfaction surveys to understand why employees are unhappy\n    - Examining unplanned absence data to identify absenteeism drivers"], "image_desc": "A flowchart showing the steps involved in investigating the causes of high employee turnover.", "narration": "Diagnostic HR analytics takes things a step further by trying to understand why things happened. It helps us to identify the root causes of problems so that we can take action to address them. For example, we might use diagnostic analytics to investigate why our employee turnover rate is high.", "slide_number": "4", "image_url": "https://iedunote.com/img/21498/employee-turnover.jpg", "image_path": "data/videos/5878df18-a406-4b8d-88e0-cb77d3ff64f4/images/image_4.webp"}, {"title": "Predictive HR Analytics", "content": ["- **Predictive HR analytics** answers the question: *What will happen?*", "It uses statistical models and forecasts to predict future behaviors and events.", "Examples include:\n    - Predicting employee attrition\n    - Forecasting future hiring needs\n    - Identifying high-potential employees"], "image_desc": "A scatter plot showing the relationship between employee performance and attrition.", "narration": "Predictive HR analytics is all about looking into the future. It helps us to anticipate what might happen in our organization and to make plans accordingly. For example, we might use predictive analytics to predict which employees are most likely to leave the company.", "slide_number": "5", "image_url": "https://p16-ehi-va.gauthmath.com/tos-maliva-i-ejcjvp0zxf-us/eebca93ab8414406937db43b6271057d~tplv-ejcjvp0zxf-scale:1521:910.image", "image_path": "data/videos/5878df18-a406-4b8d-88e0-cb77d3ff64f4/images/image_5.webp"}, {"title": "Prescriptive HR Analytics", "content": ["- **Prescriptive HR analytics** answers the question: *What should we do?*", "It suggests potential future outcomes and scenarios and proposes recommendations for addressing them.", "Examples include:\n    - Developing an algorithm that predicts what type of onboarding a new hire will need according to their experience and skill level\n    - Recommending training programs based on employee skills gaps\n    - Suggesting ways to improve employee engagement"], "image_desc": "A decision tree showing the different options for addressing high employee turnover.", "narration": "Prescriptive HR analytics goes beyond simply predicting the future. It helps us to make informed decisions about how to address potential problems and opportunities. For example, we might use prescriptive analytics to develop a personalized onboarding program for each new hire.", "slide_number": "6", "image_url": "https://venngage-wordpress.s3.amazonaws.com/uploads/2021/04/Decision-Tree-Infographic-Project-Development-Decision-Tree-Template.png", "image_path": "data/videos/5878df18-a406-4b8d-88e0-cb77d3ff64f4/images/image_6.webp"}, {"title": "Benefits of HR Analytics", "content": ["- **Improved decision-making:** HR analytics provides data-driven insights that can help HR professionals make better decisions.", "**Increased efficiency:** HR analytics can help to streamline HR processes and improve efficiency.", "**Enhanced employee engagement:** HR analytics can be used to identify and address employee engagement issues.", "**Reduced costs:** HR analytics can help to reduce HR costs by improving efficiency and reducing turnover.", "**Competitive advantage:** HR analytics can help organizations to gain a competitive advantage by attracting and retaining top talent."], "image_desc": "A diagram showing the benefits of HR analytics.", "narration": "As you can see, HR analytics offers a wide range of benefits for organizations. It can help to improve decision-making, increase efficiency, enhance employee engagement, reduce costs, and give organizations a competitive advantage.", "slide_number": "7", "image_url": "https://media.publit.io/file/w_777,h_437,c_fit,q_80/chrmpWebsite/44.png", "image_path": "data/videos/5878df18-a406-4b8d-88e0-cb77d3ff64f4/images/image_7.webp"}, {"title": "Conclusion", "content": ["- HR analytics is a powerful tool that can be used to improve HR processes and decision-making.", "By understanding the different types of HR analytics and their benefits, organizations can leverage data to create a more effective and engaged workforce."], "image_desc": "A group of people working together on a computer.", "narration": "In conclusion, HR analytics is a valuable tool that can help organizations to achieve their HR goals. By embracing data-driven decision-making, organizations can create a more effective and engaged workforce.", "slide_number": "8", "image_url": "https://www.ateamsystems.com/wp-content/uploads/2020/05/Group-of-happy-computer-programmers-working-together-on-desktop-PC-at-corporate-office-scaled.jpg", "image_path": "data/videos/5878df18-a406-4b8d-88e0-cb77d3ff64f4/images/image_8.webp"}]