[{"slide_number": "1", "title": "The Human Digestive System", "slide_type": "Title Slide", "content": "(No additional content for Title Slide)", "image_desc": "A detailed anatomical illustration of the human digestive system, showing all major organs including the mouth, esophagus, stomach, small intestine, large intestine, liver, pancreas, and gallbladder.  The illustration should be labeled clearly and use vibrant colors for easy understanding.", "narration": "Welcome to this presentation on the human digestive system.  We'll explore the fascinating journey food takes through your body.", "image_url": "https://www.exploringnature.org/graphics/biology/digestive_tract72.jpg", "image_path": "data/videos/a64bb5f9-6265-4323-b582-70a2f3bb5949/images/image_1.webp"}, {"slide_number": "2", "title": "Stages of Digestion", "slide_type": "Image Left", "content": "Ingestion\nDigestion\nAbsorption\nElimination", "image_desc": "A flowchart illustrating the four main stages of digestion: ingestion, digestion, absorption, and elimination. Each stage should be clearly labeled with a brief description.  Arrows should connect the stages to show the sequential process.", "narration": "The digestive process can be broken down into four main stages. First, we have ingestion, where food enters the body.  Next is digestion, the breakdown of food into smaller molecules.  Then comes absorption, where these nutrients are absorbed into the bloodstream. Finally, elimination removes the waste products.", "image_url": "http://image1.slideserve.com/2406408/4-phases-of-digestion-n.jpg", "image_path": "data/videos/a64bb5f9-6265-4323-b582-70a2f3bb5949/images/image_2.webp"}, {"slide_number": "3", "title": "The Mouth and Esophagus", "slide_type": "Image Right", "content": "Mechanical Digestion (chewing)\nChemical Digestion (saliva)\nPeristalsis (esophagus)", "image_desc": "A close-up image showing the mouth and esophagus, highlighting the teeth, tongue, and salivary glands. The image should clearly illustrate the process of chewing and swallowing.", "narration": "Digestion begins in the mouth, with mechanical digestion through chewing and chemical digestion via saliva.  The esophagus then uses peristalsis, rhythmic muscle contractions, to move the food down to the stomach.", "image_url": "https://www.macmillan.org.uk/_images/Salivary-glands_labelled_tcm9-317511.jpg", "image_path": "data/videos/a64bb5f9-6265-4323-b582-70a2f3bb5949/images/image_3.webp"}, {"slide_number": "4", "title": "Stomach and Small Intestine", "slide_type": "Two Columns", "content": "**Stomach:**\nChurns food\nChemical digestion (acid)\nProduces chyme\n**Small Intestine:**\nNutrient absorption\nVilli and microvilli increase surface area\nEnzymes complete digestion", "image_desc": "A diagram showing the stomach and small intestine side-by-side, highlighting their key features and functions.  The villi and microvilli in the small intestine should be clearly visible.", "narration": "In the stomach, food is churned and mixed with acid for chemical digestion, creating chyme.  The small intestine is where most nutrient absorption occurs, thanks to the villi and microvilli that greatly increase its surface area.", "image_url": "http://www.muhealth.org/sites/default/files/inline-images/GITract.jpg", "image_path": "data/videos/a64bb5f9-6265-4323-b582-70a2f3bb5949/images/image_4.webp"}, {"slide_number": "5", "title": "Large Intestine and Elimination", "slide_type": "Image with Caption", "content": "(Caption below the image)  Water absorption and waste elimination.", "image_desc": "An illustration of the large intestine showing water absorption and the formation of feces.  The rectum and anus should be clearly indicated.", "narration": "The large intestine absorbs water from the remaining undigested material, forming feces.  Finally, elimination removes the waste products from the body through the rectum and anus.", "image_url": "https://www.scientificanimations.com/wp-content/uploads/2019/04/Large-Interstine.jpg", "image_path": "data/videos/a64bb5f9-6265-4323-b582-70a2f3bb5949/images/image_5.webp"}, {"slide_number": "6", "title": "Summary", "slide_type": "Table of Contents", "content": "Ingestion\nDigestion (Mouth, Stomach, Small Intestine)\nAbsorption (Small Intestine)\nElimination (Large Intestine)", "image_desc": "A simple graphic representing the digestive system as a continuous flow chart, highlighting the key stages.", "narration": "To summarize, we've covered ingestion, digestion in the mouth, stomach, and small intestine, absorption in the small intestine, and finally, elimination via the large intestine.  Thank you.", "image_url": "https://0901.static.prezi.com/preview/v2/dmvksb4u2ewlljouhpt2qvp5l36jc3sachvcdoaizecfr3dnitcq_3_0.png", "image_path": "data/videos/a64bb5f9-6265-4323-b582-70a2f3bb5949/images/image_6.webp"}]