[{"title": "Half-Subtractor", "content": ["- A half-subtractor subtracts two binary digits (minuend and subtrahend) to produce a DIFFERENCE output and a BORROW output.", "The truth table for a half-subtractor is shown in the image.", "The Boolean expressions for a half-subtractor are:\n    - D = 'B + AB' (DIFFERENCE)\n    - Bo = A'B (BORROW)", "The logic implementation of a half-subtractor is shown in the image."], "image_desc": "A truth table and logic diagram of a half-subtractor.", "narration": "A half-subtractor is a basic building block in digital circuits used for binary subtraction. It takes two bits as input, the minuend and the subtrahend, and outputs the difference and a borrow bit. The difference output represents the result of the subtraction, while the borrow output indicates whether a borrow is needed from the next higher bit position. The logic diagram shows how the difference and borrow outputs are generated using logic gates.", "slide_number": "1", "image_url": "https://electronicsdesk.com/wp-content/uploads/2019/05/truth-table-for-half-subtractor.jpg", "image_path": "data\\videos\\49889ffc-c0aa-4660-8a8e-3eaf063ed21d\\images\\image_1.webp"}, {"title": "Full Subtractor", "content": ["- A full subtractor performs subtraction of two bits (minuend and subtrahend) along with a borrow input from the previous stage.", "There are three inputs: minuend (A), subtrahend (B), and borrow-in (C).", "There are two outputs: DIFFERENCE (D) and BORROW (Bo).", "The truth table for a full subtractor is shown in the image.", "The K-maps for the two outputs are shown in the image.", "The Boolean expressions for a full subtractor are:\n    - D = A'B'C + A'BC' + AB'C' + ABC\n    - Bo = A'C + A'B + BC"], "image_desc": "A truth table, K-maps, and logic diagram of a full subtractor.", "narration": "A full subtractor is a more complex subtraction circuit that handles the borrow input from the previous stage. It takes three bits as input, the minuend, the subtrahend, and the borrow-in, and outputs the difference and the borrow-out. The borrow-out indicates whether a borrow is needed for the next stage. The K-maps and logic diagram illustrate how the difference and borrow outputs are generated using logic gates.", "slide_number": "2", "image_url": "https://grdp.co/cdn-cgi/image/f=auto/https://gs-post-images.grdp.co/2022/5/6-11-img1653043399762-92.jpg-rs-high-webp.jpg?noResize=1", "image_path": "data\\videos\\49889ffc-c0aa-4660-8a8e-3eaf063ed21d\\images\\image_2.webp"}]