[{"title": "Introduction", "content": ["- This presentation explores a research paper titled \"Bio-efficacy of Newer Insecticides Against the Shoot and Fruit Borer (Leucinodes orbonalis) of Brinjal (Solanum melongena Linn.) Cv. Kavya.\"", "The paper was published in December 2023 in The Pharma Innovation Journal.", "Authors: Swapnil Kumar Pandey, Rishikesh Mandloi, Balveer Singh, and Ashok Kumar Verma from Rabindranath Tagore University, India.", "The study aims to evaluate the effectiveness of newer insecticides against the shoot and fruit borer of brinjal."], "image_desc": "A close-up image of a brinjal plant with visible signs of insect damage, such as holes in the leaves and fruits.", "narration": "Welcome back to our channel! Today, we're diving into a fascinating research paper that investigates the effectiveness of newer insecticides against a common pest of brinjal, the shoot and fruit borer. This paper was published in December 2023 and provides valuable insights into pest management strategies for this important vegetable crop.", "slide_number": "1", "image_url": "/data/videos/de0e014a-15f8-4b00-80c6-eccab78a0951/images/image_1.webp", "image_path": "data/videos/de0e014a-15f8-4b00-80c6-eccab78a0951/images/image_1.webp"}, {"title": "Brinjal and the Shoot and Fruit Borer", "content": ["- Brinjal, also known as eggplant or aubergine, is a widely grown vegetable, especially in India.", "India is the second-largest producer of vegetables globally.", "The shoot and fruit borer, Leucinodes orbonalis, is a major pest of brinjal, causing significant yield losses.", "This pest can lead to up to 70-92% yield loss, making effective pest management crucial."], "image_desc": "A close-up image of a brinjal fruit with a visible hole, indicating damage caused by the shoot and fruit borer.", "narration": "Brinjal is a staple vegetable in many parts of the world, particularly in India, which is a leading producer. However, brinjal cultivation faces a significant challenge – the shoot and fruit borer. This destructive pest can cause massive yield losses, making it a major concern for farmers.", "slide_number": "2", "image_url": "http://krishimala.com/sites/default/files/2018-07/brinjal-fruit-borer-img-3.jpg", "image_path": "data/videos/de0e014a-15f8-4b00-80c6-eccab78a0951/images/image_2.webp"}, {"title": "Study Overview", "content": ["- The study was conducted over two Rabi seasons (2020-21 and 2021-22) at Rabindranath Tagore University's Agriculture Research Farm.", "Researchers tested various insecticides to determine their effectiveness against L. orbonalis.", "Insecticides evaluated:\n    - Emamectin benzoate 5 SG\n    - Bacillus thuringiensis SC\n    - Neem oil\n    - Spinosad 45 SC\n    - Chlorantraniliprole 18.5 SC\n    - Cypermethrin 25 EC\n    - Spinetoram 11.7 SC\n    - Thiodicarb 75 WP\n    - Chlorpyriphos 20 EC"], "image_desc": "A photo of a research field with brinjal plants, showcasing the experimental setup for the study.", "narration": "To address this issue, the researchers conducted a comprehensive study over two growing seasons, testing the effectiveness of various insecticides against the shoot and fruit borer. They meticulously evaluated nine different insecticides, including both traditional and newer options, to identify the most effective and sustainable solutions for pest management.", "slide_number": "3", "image_url": "https://www.explogrow.com/uploads/crops/_bodyImage/DSC0015.JPG", "image_path": "data/videos/de0e014a-15f8-4b00-80c6-eccab78a0951/images/image_3.webp"}, {"title": "Methodology", "content": ["- The study employed a rigorous experimental design with treatments applied at various dosages.", "The effects of each treatment were assessed at multiple intervals (3, 5, 7, and 10 days after spraying).", "Observations were made on fruit infestation levels to gauge the effectiveness of each treatment."], "image_desc": "A scientist examining a brinjal plant, carefully observing the fruit for signs of infestation.", "narration": "The study was designed to ensure accurate and reliable results. The researchers applied different doses of each insecticide and monitored the impact on fruit infestation levels at regular intervals. This meticulous approach allowed them to assess the effectiveness of each treatment over time.", "slide_number": "4", "image_url": "https://content.peat-cloud.com/w400/brinjal-shoot-and-fruit-borer-eggplant-5.jpg", "image_path": "data/videos/de0e014a-15f8-4b00-80c6-eccab78a0951/images/image_4.webp"}, {"title": "Key Findings - 2020-21 Season", "content": ["- Spinosad 45 SC emerged as the most effective insecticide, showing the lowest fruit infestation rates.", "It reduced fruit infestation by up to 80.10% after the first spray and 85.65% after the second spray.", "Spinosad 45 SC also led to the highest yield (97.78 q/ha) and net profit (Rs. 76,565.65)."], "image_desc": "A bar graph comparing the fruit infestation rates of different insecticides, highlighting the effectiveness of Spinosad 45 SC.", "narration": "In the first season of the study, one insecticide stood out as the most effective – Spinosad 45 SC. It significantly reduced fruit infestation rates, leading to a substantial increase in yield and net profit for farmers. This finding suggests that Spinosad 45 SC could be a valuable tool for managing the shoot and fruit borer in brinjal cultivation.", "slide_number": "5", "image_url": "/data/videos/de0e014a-15f8-4b00-80c6-eccab78a0951/images/image_5.webp", "image_path": "data/videos/de0e014a-15f8-4b00-80c6-eccab78a0951/images/image_5.webp"}, {"title": "Key Findings - 2021-22 Season", "content": ["- Spinosad 45 SC again proved to be the most effective, reducing fruit infestation by 80.31% after the first spray and 84.05% after the second spray.", "It resulted in the highest fruit yield (215.3 q/ha) and net profit (Rs. 67,325.50)."], "image_desc": "A table summarizing the fruit infestation rates, yield, and net profit for different insecticides in the 2021-22 season, highlighting the superiority of Spinosad 45 SC.", "narration": "The second season of the study further confirmed the effectiveness of Spinosad 45 SC. It consistently outperformed other insecticides in reducing fruit infestation, leading to the highest yield and net profit for farmers. This consistent performance across two seasons demonstrates the reliability of Spinosad 45 SC as a pest management solution.", "slide_number": "6", "image_url": "/data/videos/de0e014a-15f8-4b00-80c6-eccab78a0951/images/image_6.webp", "image_path": "data/videos/de0e014a-15f8-4b00-80c6-eccab78a0951/images/image_6.webp"}, {"title": "Cost-Benefit Analysis", "content": ["- Emamectin benzoate 5 SG had the highest incremental cost-benefit ratio, indicating a good balance between cost and effectiveness.", "The cost-benefit ratio was highest for Emamectin benzoate 5 SG followed by Chlorantraniliprole 18.5 SC and Spinosad 45 SC."], "image_desc": "A pie chart representing the cost-benefit ratios of different insecticides, highlighting the top performers.", "narration": "While Spinosad 45 SC demonstrated the highest efficacy, the study also considered the cost-benefit ratio of each insecticide. Emamectin benzoate 5 SG emerged as the most cost-effective option, offering a good balance between effectiveness and cost. This information is crucial for farmers to make informed decisions based on their budget and specific needs.", "slide_number": "7", "image_url": "/data/videos/de0e014a-15f8-4b00-80c6-eccab78a0951/images/image_7.webp", "image_path": "data/videos/de0e014a-15f8-4b00-80c6-eccab78a0951/images/image_7.webp"}, {"title": "Conclusion", "content": ["- The study highlights Spinosad 45 SC as a standout option for managing Leucinodes orbonalis in brinjal.", "It offers both high efficacy in reducing pest infestation and improved economic returns.", "The study underscores the importance of selecting effective and economically viable insecticides for pest management in brinjal cultivation."], "image_desc": "A photo of a farmer harvesting healthy brinjal fruits, showcasing the benefits of effective pest management.", "narration": "The findings of this research paper provide valuable insights into pest management strategies for brinjal. Spinosad 45 SC stands out as a highly effective and economically viable insecticide for controlling the shoot and fruit borer. This study emphasizes the importance of selecting the right tools for pest management to ensure both high yields and profitability for farmers.", "slide_number": "8", "image_url": "/data/videos/de0e014a-15f8-4b00-80c6-eccab78a0951/images/image_8.webp", "image_path": "data/videos/de0e014a-15f8-4b00-80c6-eccab78a0951/images/image_8.webp"}, {"title": "Wrap-Up", "content": ["- This research paper provides valuable insights into pest management strategies for brinjal.", "It showcases how newer insecticides can play a crucial role in enhancing crop yield and profitability."], "image_desc": "A photo of a farmer examining a brinjal plant, highlighting the importance of sustainable agricultural practices.", "narration": "This research paper offers valuable insights into the effectiveness of newer insecticides in managing a major pest of brinjal. It highlights the potential of these insecticides to improve crop yield and profitability for farmers, contributing to sustainable agricultural practices.", "slide_number": "9", "image_url": "https://c8.alamy.com/comp/2A2AYNY/bangladesh-november-25-2014-a-farmer-showing-the-bari-bt-brinjal-cultivated-in-his-field-under-the-precision-farming-technique-in-pirgong-village-2A2AYNY.jpg", "image_path": "data/videos/de0e014a-15f8-4b00-80c6-eccab78a0951/images/image_9.webp"}, {"title": "Created with CollegitesAI ", "content": ["- Check out the full paper linked in the description below.", "Use Collegites AI text-to-video tools to create engaging videos like this one."], "image_desc": "A screenshot of the Collegites AI website, showcasing its text-to-video capabilities.", "narration": "If you're interested in learning more about this research and its implications for brinjal cultivation, check out the full paper linked in the description below. And if you're looking to create engaging videos like this one, you can easily do so with Collegites AI text-to-video tools. See the link in the description for more information!", "slide_number": "10", "image_url": "/data/videos/de0e014a-15f8-4b00-80c6-eccab78a0951/images/image_10.webp", "image_path": "data/videos/de0e014a-15f8-4b00-80c6-eccab78a0951/images/image_10.webp"}, {"title": "Link in description", "content": ["- Like, comment, and subscribe for more insightful content.", "Thanks for watching, and see you next time!"], "image_desc": "A generic image of a thank you message with a thumbs-up icon.", "narration": "Don't forget to like, comment, and subscribe for more insightful content. Thanks for watching, and see you next time!", "slide_number": "11", "image_url": "/data/videos/de0e014a-15f8-4b00-80c6-eccab78a0951/images/image_11.webp", "image_path": "data/videos/de0e014a-15f8-4b00-80c6-eccab78a0951/images/image_11.webp"}]