[{"title": "What is HR Analytics?", "content": ["- **HR analytics**, also referred to as **people analytics** or **workforce analytics**, involves gathering, analyzing, and reporting HR data to drive business results.", "It enables your organization to better understand your workforce, make decisions based on data, and measure the impact of a range of HR metrics, ultimately improving overall business performance.", "In other words, HR analytics is a data-driven approach to Human Resources Management."], "image_desc": "A bar graph showing data related to employee engagement, performance, and turnover", "narration": "Welcome to this presentation on HR Analytics. We'll be exploring what HR analytics is, its benefits, and how it can be used to improve business performance. As you can see from the graph, HR analytics helps us understand important metrics like employee engagement, performance, and turnover.", "slide_number": "1", "image_url": "https://www.slideteam.net/media/catalog/product/cache/1280x720/b/a/bar_graph_for_rate_of_employee_turnover_example_of_ppt_presentation_Slide01.jpg", "image_path": "data/videos/f1b3cecc-2348-4775-8892-9e374f8dd1d1/images/image_1.webp"}, {"title": "HR Analytics vs. People Analytics", "content": ["- While the term \"HR analytics\" is widely used, there is a growing trend of referencing \"people analytics\" as well.", "The two may often be used interchangeably, but technically there is a subtle difference.", "**HR analytics** originates from data housed within Human Resources and is aimed at optimizing HR functions.", "**People analytics** expands beyond HR to incorporate data from other sources within the organization, such as marketing, finance, and customer statistics, to address a wider scope of business issues."], "image_desc": "A Venn diagram showing the overlap between HR analytics and people analytics, with HR analytics as a subset of people analytics", "narration": "Now, let's delve into the difference between HR analytics and people analytics. While they are often used interchangeably, there's a subtle distinction. HR analytics focuses on HR data, while people analytics encompasses a broader range of data from across the organization.", "slide_number": "2", "image_url": "https://dataforvisualization.com/wp-content/uploads/2020/02/venn-diagram.png", "image_path": "data/videos/f1b3cecc-2348-4775-8892-9e374f8dd1d1/images/image_2.webp"}, {"title": "The Evolution of HR", "content": ["- In the past century, Human Resource Management has made a dramatic shift from an operational discipline to a more strategic one.", "The popularity of using the phrase **Strategic Human Resource Management** exemplifies this.", "The data-driven approach that characterizes HR analytics is in line with this development."], "image_desc": "A timeline showing the evolution of HR from operational to strategic, with HR analytics as a key milestone", "narration": "This shift towards strategic HR is evident in the increasing popularity of the term \"Strategic Human Resource Management.\" HR analytics, with its data-driven approach, perfectly aligns with this evolution.", "slide_number": "3", "image_url": "https://hrdictionary.files.wordpress.com/2012/10/evolution-of-hrm1.jpg", "image_path": "data/videos/f1b3cecc-2348-4775-8892-9e374f8dd1d1/images/image_3.webp"}, {"title": "Benefits of HR Analytics", "content": ["- Analytics enables HR professionals to make data-driven decisions instead of relying solely on instinct and opinions.", "Furthermore, analytics helps test the effectiveness of HR policies and interventions."], "image_desc": "A diagram showing how HR analytics helps make data-driven decisions and measure the impact of HR initiatives", "narration": "So, what are the benefits of HR analytics? It empowers HR professionals to make informed decisions based on data, rather than relying on intuition. Additionally, it allows us to measure the effectiveness of HR policies and interventions, ensuring we're making the right choices for our workforce.", "slide_number": "4", "image_url": "https://blog.vantagecircle.com/content/images/2023/07/Process-of-HR-analytics---1---2.png", "image_path": "data/videos/f1b3cecc-2348-4775-8892-9e374f8dd1d1/images/image_4.webp"}]