[{"slide_number": "1", "title": "The Devil's Game", "slide_type": "Title Slide", "content": ["- (No additional content for Title Slide)"], "image_desc": "- A dark, shadowy figure with a wide-brimmed hat, sitting at a card table with a playing card in hand.", "narration": "Welcome to the story of The Devil's Game, a tale of greed, misfortune, and the price of a wish.\n\n-", "image_url": "https://images.stockcake.com/public/a/b/f/abf061e7-282f-4444-a22b-7d20c60fcaf1_large/mysterious-card-game-stockcake.jpg", "image_path": "data\\videos\\bcdbfa1f-fae9-4e75-beb7-b10aef5513e0\\images\\image_1.webp"}, {"slide_number": "2", "title": "A Wish for Wealth", "slide_type": "Image Right", "content": ["- A farm boy, playing cards with a stranger.", "- The boy wins a wish from the stranger.", "- He wishes for wealth."], "image_desc": "- A young farm boy, dressed in simple clothes, sitting at a table with a stranger who is wearing a wide-brimmed hat and holding a deck of cards.", "narration": "On a bustling market day, a farm boy named Thomas found himself playing cards with a mysterious stranger. The stranger, with a mischievous glint in his eye, offered Thomas a wish if he won the game.  Thomas, yearning for a better life for his family, wished for wealth.\n\n-", "image_url": "https://decastell.com/wp-content/uploads/sites/53/2021/03/Play-Shadows-HD-v1.jpg", "image_path": "data\\videos\\bcdbfa1f-fae9-4e75-beb7-b10aef5513e0\\images\\image_2.webp"}, {"slide_number": "3", "title": "The Price of Wealth", "slide_type": "Image Left", "content": ["- The boy's family initially enjoys the wealth.", "- Their happiness fades as they become spoiled and greedy.", "- The boy's family suffers tragic losses."], "image_desc": "- A family sitting at a lavish dinner table, dressed in fine clothes, surrounded by servants.", "narration": "At first, the gold brought happiness to Thomas' family. They could afford servants, fine clothes, and never went hungry. But soon, their happiness began to sour. Thomas' sisters became vain and entered unhappy marriages. His father, unable to handle his newfound wealth, died in a tragic accident. His mother, heartbroken, drank herself to death.\n\n-", "image_url": "https://images.stockcake.com/public/1/4/2/14207c36-7575-466e-8e77-2e9721db4207_large/opulent-roman-feast-stockcake.jpg", "image_path": "data\\videos\\bcdbfa1f-fae9-4e75-beb7-b10aef5513e0\\images\\image_3.webp"}, {"slide_number": "4", "title": "A Lonely Fortune", "slide_type": "Image with Caption", "content": ["- Thomas becomes a spoiled young man.", "- He loses his family and friends.", "- He finds himself alone in his great house."], "image_desc": "- A young man, dressed in luxurious clothes, sitting alone in a large, empty room of a grand house.", "narration": "Thomas himself grew into a spoiled young man, his wealth protecting him from harm, but not from bad decisions. He found himself alone in his great house, without family or friends, a prisoner of his own fortune.\n\n-", "image_url": "https://hips.hearstapps.com/hmg-prod/images/elm090122fobcover-001a-1660154342.jpg", "image_path": "data\\videos\\bcdbfa1f-fae9-4e75-beb7-b10aef5513e0\\images\\image_4.webp"}, {"slide_number": "5", "title": "The Devil's Return", "slide_type": "Image Right", "content": ["- Thomas is haunted by his past.", "- He is visited by the stranger, who is revealed to be the devil.", "- Thomas' wealth is taken away."], "image_desc": "- A shadowy figure, wearing a wide-brimmed hat, standing in a dark room, looking at a young man who is sitting on a chair, looking scared.", "narration": "As Thomas' paranoia grew, he couldn't escape the feeling that his time was running out. And it did. The law arrived, seeking to collect on his bad debts and illegal investments. The house was turned upside down, and Thomas' wealth was stripped away.\n\n-", "image_url": "https://images.stockcake.com/public/c/c/6/cc61d687-95e9-4ed5-9a41-b8641306b533_large/shadow-looms-large-stockcake.jpg", "image_path": "data\\videos\\bcdbfa1f-fae9-4e75-beb7-b10aef5513e0\\images\\image_5.webp"}, {"slide_number": "6", "title": "A Cruel Twist of Fate", "slide_type": "Two Columns", "content": ["- **Column 1: Thomas**", "- Arrested for his crimes.", "- Sentenced to death by hanging.", "- Dies instantly when the rope snaps his neck.", "- **Column 2: The Housemaid**", "- Steals jewelry during the chaos.", "- Arrested and sentenced to death by hanging.", "- Survives the hanging due to her lighter weight."], "image_desc": "- A dark, gloomy prison cell with two figures standing on a platform, being prepared for hanging.", "narration": "The housemaid, taking advantage of the chaos, stole some jewelry. But she was caught and arrested along with Thomas. They were both sentenced to death by hanging. Thomas, his neck snapping like a twig, died instantly. The housemaid, however, was too light. She thrashed at the end of the rope, her life hanging in the balance.\n\n-", "image_url": "https://cdnb.artstation.com/p/assets/images/images/057/352/123/large/bruno-piedra-roset-celdafinal.jpg?1671382968", "image_path": "data\\videos\\bcdbfa1f-fae9-4e75-beb7-b10aef5513e0\\images\\image_6.webp"}, {"slide_number": "7", "title": "The Devil's Game Continues", "slide_type": "Image with Caption", "content": ["- The devil watches the hangings with detachment.", "- He invites a man to play cards while they wait for the housemaid to die."], "image_desc": "- A shadowy figure, wearing a wide-brimmed hat, standing in a crowd, watching the hangings with a cold smile.", "narration": "In the hot, sun-baked square, the devil watched the hangings with cool detachment. He had won two souls, one with a wish, and the other with greed. Bored, he beckoned to a man nearby, \"She's going to take a while. Want to play cards while we wait?\"\n\n-", "image_url": "https://media.craiyon.com/2024-04-04/de9FzZjTSt2ouAZQZ9yUpg.webp", "image_path": "data\\videos\\bcdbfa1f-fae9-4e75-beb7-b10aef5513e0\\images\\image_7.webp"}, {"slide_number": "8", "title": "The End?", "slide_type": "Image Left", "content": ["- The story ends with the devil continuing his game.", "- The fate of the housemaid remains uncertain."], "image_desc": "- A close-up of a hand holding a deck of cards, with a shadowy figure in the background.", "narration": "And so, the devil's game continues. The fate of the housemaid remains uncertain, but one thing is clear: the price of a wish can be far greater than anyone can imagine.", "image_url": "https://media.newyorker.com/photos/64dff62f6fc77c5d2e5d3529/master/w_2560%2Cc_limit/230828_r42844web-story.jpg", "image_path": "data\\videos\\bcdbfa1f-fae9-4e75-beb7-b10aef5513e0\\images\\image_8.webp"}]