[{"title": "What is IoT?", "image_desc": "An umbrella connected to the internet with a weather app showing rain.", "content": ["- IoT stands for Internet of Things.", "It connects physical objects to the internet for data exchange.", "Example: An umbrella connected to the internet can receive weather information."], "narration": "नमस्ते दोस्तों! आज हम IoT के conceptual framework के बारे में बात करेंगे। IoT का मतलब होता है Internet of Things। ये एक ऐसा system है जहाँ हम physical objects को internet से connect करते हैं, ताकि वो data exchange कर सकें। जैसे, एक umbrella को imagine करो जो internet से connected हो। ये umbrella एक central server से data ले सकता है, जैसे weather information.", "slide_number": "1", "image_url": "https://wordlesstech.com/wp-content/uploads/2016/03/Smart-umbrella-works-as-a-weather-forecaster-1-640x360.jpg", "image_path": "data/videos/606afed2-2875-4d04-8938-fa0b02aaf8b1/images/image_1.webp"}, {"title": "IoT Equation (Simple)", "image_desc": "A diagram showing the simple IoT equation with an umbrella as the physical object.", "content": ["- Simple IoT equation: Physical Object + Controller, Sensor and Actuators + Internet = Internet of Things.", "Example: An umbrella with a sensor, actuator, and internet connection."], "narration": "अगर हम IoT को simple tareeke se define करें, तो इस equation को याद रखो: Physical object, जैसे umbrella + Controller, Sensor aur Actuators + Internet = IoT. ये एक basic framework है, जैसे हमने umbrella का example दिया। इस umbrella में एक sensor होगा जो weather को sense करेगा, एक actuator होगा जो umbrella को open या close करेगा, और internet का use होगा इस data को share करने के लिए.", "slide_number": "2", "image_url": "/data/videos/606afed2-2875-4d04-8938-fa0b02aaf8b1/images/image_2.webp", "image_path": "data/videos/606afed2-2875-4d04-8938-fa0b02aaf8b1/images/image_2.webp"}, {"title": "IoT Framework in Detail", "image_desc": "Multiple streetlights connected to a central server in a smart city.", "content": ["- Advanced IoT framework involves multiple devices communicating with each other.", "Example: Smart city with streetlights exchanging data.", "Data flow: Gather + Enrich + Stream + Manage + Acquire + Organise and Analyse."], "narration": "लेकिन IoT सिर्फ एक umbrella तक सीमित नहीं है। एक advanced framework में, multiple devices होती हैं जो एक दूसरे से communicate करती हैं। जैसे, एक smart city का example ले लो। Streetlights data exchange करती हैं और ये सब central server को भेजा जाता है, जो इस data को analyze करता है। ये एक थोड़ा complex IoT framework है जिसमें devices, यानी Things, data को gather करती हैं, फिर उस data को enrich, stream, और manage किया जाता है। इसका last step होता है data को analyse करना ताकि business या real-world processes को improve किया जा सके.", "slide_number": "3", "image_url": "/data/videos/606afed2-2875-4d04-8938-fa0b02aaf8b1/images/image_3.webp", "image_path": "data/videos/606afed2-2875-4d04-8938-fa0b02aaf8b1/images/image_3.webp"}, {"title": "Cloud-based IoT Framework (Advanced)", "image_desc": "Cloud infrastructure connected to various devices like sensors, gateways, and applications.", "content": ["- IBM's advanced IoT framework focuses on cloud-based services.", "Data flow: Gather + Consolidate + Connect + Collect + Assemble + Manage and Analyse.", "Sensors gather data, gateways consolidate it, and cloud streams the data."], "narration": "अब IBM ने एक और advanced IoT framework suggest किया है जो cloud-based services पर focus करता है। यहां पर sensors data gather करते हैं, gateways data को consolidate करते हैं, और फिर cloud में data stream होता है। ये complex equation ये दिखाती है कि कैसे data sensors से cloud तक flow करता है, real-time analysis के लिए। तो overall IoT में आप देख रहे हो काफी levels होते हैं: sensors से data collection, gateways के through data transfer, और फिर cloud में data storage aur analysis.", "slide_number": "4", "image_url": "https://c8.alamy.com/comp/2K2KARF/cloud-computing-diagram-with-various-connected-device-3d-illustration-2K2KARF.jpg", "image_path": "data/videos/606afed2-2875-4d04-8938-fa0b02aaf8b1/images/image_4.webp"}, {"title": "Applications of IoT", "image_desc": "Collage of images showing smart cities, home automation, wearable devices, and security systems.", "content": ["- IoT applications are widespread: smart cities, home automation, wearable devices, and security systems.", "The framework remains similar: data collection, processing, and analysis."], "narration": "अब practical applications की बात करें, तो IoT का use हर जगह हो रहा है - smart cities, home automation, wearable devices, और security systems. सब में IoT का framework कुछ ऐसे ही काम करता है। Data को collect करना, उसको process करना और फिर results को analyze करना, ये सब steps लगभग same होते हैं.", "slide_number": "5", "image_url": "https://cdn4.vectorstock.com/i/1000x1000/70/53/smart-home-iot-internet-of-things-control-comfort-vector-21927053.jpg", "image_path": "data/videos/606afed2-2875-4d04-8938-fa0b02aaf8b1/images/image_5.webp"}, {"title": "Recap & Conclusion", "image_desc": "A recap of the key points covered in the presentation.", "content": ["- Simple IoT framework: Object + Controller + Sensor + Internet.", "Complex frameworks: Data gathering, streaming, and analysis.", "IoT applications: Smart cities, home automation, and more."], "narration": "चलो एक quick recap करते हैं: IoT का simple framework एक object, controller, sensor और internet को मिला के बनता है। Complex frameworks में हम data gathering, streaming और analysis का use करते हैं, जैसे streetlights या cloud-based services. IoT के applications काफी broad हैं, including smart cities aur home automation. \"Subscribe for more IoT and tech tutorials!\"\n'''", "slide_number": "6", "image_url": "/data/videos/606afed2-2875-4d04-8938-fa0b02aaf8b1/images/image_6.webp", "image_path": "data/videos/606afed2-2875-4d04-8938-fa0b02aaf8b1/images/image_6.webp"}]