[{"title": "The Technology Behind IoT", "content": ["- Identification", "Sensing", "Communication", "Data Collection and Analysis"], "image_desc": "A diagram showing the interconnected components of an IoT system, including devices, sensors, networks, and a central server.", "narration": "The Internet of Things (IoT) is a network of physical devices, vehicles, buildings, and other items embedded with electronics, software, sensors, actuators, and network connectivity that enables these objects to collect and exchange data. This slide explores the key technologies that make IoT possible.", "slide_number": "1", "image_url": "https://www.shutterstock.com/shutterstock/photos/361644566/display_1500/stock-photo-the-internet-of-things-iot-concept-diagram-showing-interconnected-networked-objects-isolated-361644566.jpg", "image_path": "data/videos/2b564f4d-5efd-4096-b060-b342f1244dcd/images/image_1.webp"}, {"title": "Identification Technology for IoT", "content": ["- Radio Frequency Identification (RFID)", "Quick Response Code (QR Code)"], "image_desc": "A close-up image of an RFID tag attached to a product, with a smartphone scanning the tag.", "narration": "For billions of devices to connect to the internet, each needs a unique identifier. This is where identification technologies come in. RFID uses radio waves to communicate data from an electronic device, allowing for identification, location tracking, and environmental sensing. QR codes are machine-readable visual labels that store information about the object they are attached to, enabling easy access to information and tracking.", "slide_number": "2", "image_url": "https://i.ytimg.com/vi/ehmI9Cbf3lk/maxresdefault.jpg", "image_path": "data/videos/2b564f4d-5efd-4096-b060-b342f1244dcd/images/image_2.webp"}, {"title": "Communication Protocols Used", "content": "- Message Queue Telemetry Transport {MQTT}, Extensible Messaging and Presence Protocol (XMPP),Data Distribution Service (DDS),Advanced Message Queuing Protocol (AMQP),Constrained Application Protocol (CoAP)", "image_desc": "A diagram illustrating the flow of data between IoT devices using various communication protocols.", "narration": "Communication is essential for IoT devices to share data and interact with each other.  MQTT is a protocol designed for gathering device data and transmitting it to servers, ideal for large networks of devices. XMPP connects devices to people, allowing for user interaction and control. DDS enables device-to-device communication, facilitating efficient data sharing. AMQP is a queuing protocol used for server-based functions, while CoAP is specifically designed for low-power devices, enabling remote control and access over the internet.", "slide_number": "3", "image_url": "https://dgtlinfra.com/wp-content/uploads/2022/11/Layers-in-Internet-of-Things-IoT-Architecture.jpg", "image_path": "data/videos/2b564f4d-5efd-4096-b060-b342f1244dcd/images/image_3.webp"}]