[{"slide_number": "1", "title": "Happy Diwali from Holy Faith Convent School", "slide_type": "Title Slide", "content": ["- (No additional content for Title Slide)"], "image_desc": "- A festive image of diyas, rangoli, and fireworks.", "narration": "Welcome everyone! Happy Diwali from Holy Faith Convent School. We wish you a joyous and prosperous Diwali filled with light, love, and happiness.", "image_url": "https://img.freepik.com/premium-photo/diwali-celebration-beautifully-designed-rangoli-diyas-with-fireworks-background_1037680-2594.jpg?w=2000", "image_path": "data/videos/43fc3c26-658b-4935-bb2c-7dd2951edfe7/images/image_1.webp"}, {"slide_number": "2", "title": "Celebrating the Festival of Lights", "slide_type": "Image Left", "content": ["- Diwali is a festival of lights celebrated by Hindus, Sikhs, and Jains across the world.", "- It marks the victory of good over evil, knowledge over ignorance, and hope over despair.", "- Diwali is a time for family, friends, and community to come together and celebrate."], "image_desc": "- A group of people celebrating Diwali with diyas, fireworks, and sweets.", "narration": "Diwali is a special time for everyone. It's a festival that celebrates the triumph of good over evil, knowledge over ignorance, and hope over despair. It's a time for family, friends, and community to come together and celebrate.", "image_url": "http://www.visittnt.com/blog/wp-content/uploads/2018/07/family-deewali.jpg", "image_path": "data/videos/43fc3c26-658b-4935-bb2c-7dd2951edfe7/images/image_2.webp"}, {"slide_number": "3", "title": "Diwali Traditions", "slide_type": "Image Right", "content": ["- Lighting diyas and candles to symbolize the victory of light over darkness.", "- Decorating homes with rangoli, a colorful art form made with colored powders.", "- Sharing sweets and gifts with loved ones.", "- Setting off fireworks to celebrate the joy of the festival."], "image_desc": "- A close-up image of a diya lit with a flame.", "narration": "Diwali is filled with beautiful traditions. We light diyas and candles to symbolize the victory of light over darkness. We decorate our homes with colorful rangoli, and share sweets and gifts with loved ones. And of course, we celebrate with fireworks!", "image_url": "https://c0.wallpaperflare.com/preview/423/519/726/diya-diwali-deepavali-deepawali.jpg", "image_path": "data/videos/43fc3c26-658b-4935-bb2c-7dd2951edfe7/images/image_3.webp"}, {"slide_number": "4", "title": "The Importance of Diwali", "slide_type": "Image with Caption", "content": ["- Diwali is a time for reflection and renewal.", "- It's a reminder to spread kindness and compassion.", "- It's a celebration of the power of hope and optimism."], "image_desc": "- A family gathered together, smiling and enjoying Diwali festivities.", "narration": "Diwali is more than just a festival. It's a time for reflection and renewal. It reminds us to spread kindness and compassion, and to celebrate the power of hope and optimism.", "image_url": "http://www.visittnt.com/blog/wp-content/uploads/2018/07/family-deewali.jpg", "image_path": "data/videos/43fc3c26-658b-4935-bb2c-7dd2951edfe7/images/image_4.webp"}, {"slide_number": "5", "title": "Wishing You a Happy Diwali", "slide_type": "Image Left", "content": ["- May your Diwali be filled with joy, prosperity, and good health.", "- We wish you a happy and safe Diwali celebration."], "image_desc": "- A beautiful image of a lit diya with a warm glow.", "narration": "From all of us at Holy Faith Convent School, we wish you a very happy Diwali. May your Diwali be filled with joy, prosperity, and good health. We wish you a happy and safe Diwali celebration.", "image_url": "https://thumbs.dreamstime.com/z/intricate-design-diya-warm-glow-flame-evoke-feelings-warmth-hope-joy-diyatraditional-divali-269726829.jpg", "image_path": "data/videos/43fc3c26-658b-4935-bb2c-7dd2951edfe7/images/image_5.webp"}]