[{"slide_number": "1", "title": "Neural Controlled Prosthetics", "slide_type": "Title Slide", "content": "(No additional content for Title Slide)", "image_desc": "[Image Description in English only: A person using a prosthetic arm controlled by their thoughts.]", "narration": "Welcome to this presentation on Neural Controlled Prosthetics. We'll explore the exciting field of using brain signals to control artificial limbs.", "image_url": "https://www.ageist.com/wp-content/uploads/2024/07/Screenshot-2024-07-23-at-6.37.04 PM.jpg", "image_path": "data/videos/1b6a4833-c8b4-4d8b-98ab-03c4adfd5262/images/image_1.webp"}, {"slide_number": "2", "title": "Abstract", "slide_type": "Image Left", "content": "This presentation explores the advancements in Neural Controlled Prosthetics.\nWe'll delve into the current state of research, challenges, and future directions.\nThe focus is on how brain-computer interfaces (BCIs) enable amputees to regain control and functionality.", "image_desc": "[Image Description in English only: A diagram showing a brain-computer interface with signals being transmitted from the brain to a prosthetic limb.]", "narration": "This presentation will explore the exciting field of Neural Controlled Prosthetics. We'll delve into the current state of research, challenges, and future directions. Our focus will be on how brain-computer interfaces, or BCIs, enable amputees to regain control and functionality.", "image_url": "https://pub.mdpi-res.com/brainsci/brainsci-13-00134/article_deploy/html/images/brainsci-13-00134-ag.png?1673574815", "image_path": "data/videos/1b6a4833-c8b4-4d8b-98ab-03c4adfd5262/images/image_2.webp"}, {"slide_number": "3", "title": "Introduction", "slide_type": "Image Right", "content": "Amputees face significant challenges in regaining lost limb functionality.\nTraditional prosthetics often lack intuitive control and natural movement.\nNeural Controlled Prosthetics offer a revolutionary approach, using brain signals to directly control artificial limbs.", "image_desc": "[Image Description in English only: A person with an amputated arm struggling to use a traditional prosthetic.]", "narration": "Amputees face significant challenges in regaining lost limb functionality. Traditional prosthetics often lack intuitive control and natural movement. This is where Neural Controlled Prosthetics come in, offering a revolutionary approach by using brain signals to directly control artificial limbs.", "image_url": "http://cdn.rehabpub.com/rehabpub/2015/02/thelancet.jpg", "image_path": "data/videos/1b6a4833-c8b4-4d8b-98ab-03c4adfd5262/images/image_3.webp"}, {"slide_number": "4", "title": "Literature Survey", "slide_type": "Image Left", "content": "**Column 1**:\n**Early Research:**\n- Focused on basic brain-computer interfaces.\n- Limited control and functionality.\n- Primarily used for simple tasks.\n**Column 2**:\n**Recent Advancements:**\n- Improved BCI technology.\n- More complex control schemes.\n- Real-time feedback for improved control.\n- Increased functionality and natural movement.", "image_desc": "[Image Description in English only: A timeline showing the evolution of BCI technology from early research to recent advancements.]", "narration": "Early research in Neural Controlled Prosthetics focused on basic brain-computer interfaces, offering limited control and functionality. These early systems were primarily used for simple tasks. However, recent advancements have led to improved BCI technology, more complex control schemes, real-time feedback for improved control, and increased functionality and natural movement.", "image_url": "https://i.pinimg.com/originals/fd/8a/f6/fd8af630aafd86f8df44dfb68c66728e.png", "image_path": "data/videos/1b6a4833-c8b4-4d8b-98ab-03c4adfd5262/images/image_4.webp"}, {"slide_number": "5", "title": "Proposed Methodology", "slide_type": "Image Left", "content": "**Brain Signal Acquisition:**\n- Electroencephalography (EEG) or Electrocorticography (ECoG).\n- Signal processing and feature extraction.\n- Classification of brain signals for specific movements.\n**Prosthetic Control:**\n- Real-time decoding of brain signals.\n- Translation into control commands for the prosthetic.\n- Feedback mechanisms for improved control.", "image_desc": "[Image Description in English only: A diagram showing the process of brain signal acquisition, processing, and translation into prosthetic control commands.]", "narration": "Our proposed methodology involves acquiring brain signals using either Electroencephalography (EEG) or Electrocorticography (ECoG). These signals are then processed and features are extracted to classify them for specific movements. This information is then used to control the prosthetic in real-time. Feedback mechanisms are incorporated to improve control and provide a more natural experience.", "image_url": "https://healthcare-in-europe.com/media/story/15973/wide_image.png", "image_path": "data/videos/1b6a4833-c8b4-4d8b-98ab-03c4adfd5262/images/image_5.webp"}, {"slide_number": "6", "title": "Results", "slide_type": "Image Right", "content": "**Improved Control and Functionality:**\n- Amputees can perform a wider range of tasks with greater precision.\n- Increased dexterity and natural movement.\n- Enhanced quality of life for amputees.\n**Challenges:**\n- Signal noise and variability.\n- Calibration and adaptation.\n- Long-term stability and reliability.", "image_desc": "[Image Description in English only: A person using a neural controlled prosthetic arm to perform various tasks with ease and precision.]", "narration": "Our research has shown promising results in improving control and functionality for amputees. They can now perform a wider range of tasks with greater precision, experiencing increased dexterity and natural movement. This has led to an enhanced quality of life for amputees. However, challenges remain, such as signal noise and variability, calibration and adaptation, and long-term stability and reliability.", "image_url": "https://www.electropages.com/storage/app/media/2019/12/Pitt_UPMC_BrainComputerInterface_universal.jpg", "image_path": "data/videos/1b6a4833-c8b4-4d8b-98ab-03c4adfd5262/images/image_6.webp"}, {"slide_number": "7", "title": "Conclusion", "slide_type": "Image with Caption", "content": "Neural Controlled Prosthetics offer a revolutionary approach to restoring limb functionality for amputees.\nAdvancements in BCI technology have led to significant improvements in control and functionality.\nFuture research will focus on addressing challenges and further enhancing the technology.", "image_desc": "[Image Description in English only: A person with a neural controlled prosthetic arm smiling and interacting with their environment.]", "narration": "Neural Controlled Prosthetics offer a revolutionary approach to restoring limb functionality for amputees. Advancements in BCI technology have led to significant improvements in control and functionality. Future research will focus on addressing challenges and further enhancing the technology to improve the lives of amputees even more.", "image_url": "https://www.statnews.com/wp-content/uploads/2020/04/prosthesis-645x645.jpg", "image_path": "data/videos/1b6a4833-c8b4-4d8b-98ab-03c4adfd5262/images/image_7.webp"}, {"slide_number": "8", "title": "References", "slide_type": "Table of Contents", "content": "[Reference 1]\n[Reference 2]\n[Reference 3]\n[Reference 4]\n[Reference 5]", "image_desc": "[Image Description in English only: A list of relevant research papers and publications related to Neural Controlled Prosthetics.]", "narration": "Thank you for your time. For further information, please refer to the references listed on this slide.", "image_url": "https://image2.slideserve.com/4347105/slide1-l.jpg", "image_path": "data/videos/1b6a4833-c8b4-4d8b-98ab-03c4adfd5262/images/image_8.webp"}]