[{"slide_number": "1", "title": "Newton's Laws of Motion", "slide_type": "Title Slide", "content": "No Content", "image_desc": "No Image Description", "video_desc": "newton's laws", "narration": "Welcome to this educational video on Newton's Laws of Motion. These laws are fundamental principles that govern the motion of objects around us providing a framework for understanding how forces influence movement.", "image_url": "", "image_path": "", "video_url": "https://videos.pexels.com/video-files/6613336/6613336-sd_960_506_30fps.mp4", "video_path": "data/videos/8c271022-42f7-4c80-bf66-b244edfa6aea/images/video_1.mp4"}, {"slide_number": "2", "title": "Table of Contents", "slide_type": "Table of Contents", "content": "Introduction to Newton's Laws\nNewton's First Law: The Law of Inertia\nNewton's Second Law: The Law of Acceleration\nNewton's Third Law: The Law of Action-Reaction\nReal-World Applications\nSummary\nNarration:\nIn this video, we will explore each of Newton's three laws in detail. We'll start with an overview and then delve into each law, providing examples and explanations. Finally, we'll look at some real-world applications and summarize the key concepts.", "image_desc": "No Image Description", "video_desc": "", "narration": "In this video we will explore each of Newton's three laws in detail. We'll start with an overview and then delve into each law providing examples and explanations. Finally we'll look at some realworld applications and summarize the key concepts.", "image_url": "https://www.shutterstock.com/image-vector/no-profile-pictures-needed-describe-260nw-1439312147.jpg", "image_path": "data/videos/8c271022-42f7-4c80-bf66-b244edfa6aea/images/image_2.webp", "video_url": "", "video_path": ""}, {"slide_number": "3", "title": "Newton's First Law: The Law of Inertia", "slide_type": "Image Left", "content": "An object at rest stays at rest.\nAn object in motion stays in motion.\nUnless acted upon by an unbalanced force.", "image_desc": "Book on a table, car moving on a road. Type: illustration", "video_desc": "", "narration": "Newton's First Law also known as the Law of Inertia states that an object will remain at rest or in uniform motion in a straight line unless acted upon by an external unbalanced force. This means that objects resist changes to their state of motion.", "image_url": "https://c8.alamy.com/comp/KAPTGH/moving-and-unusual-road-traffic-a-wooden-cabinet-transported-on-the-KAPTGH.jpg", "image_path": "data/videos/8c271022-42f7-4c80-bf66-b244edfa6aea/images/image_3.webp", "video_url": "", "video_path": ""}, {"slide_number": "4", "title": "Inertia Examples", "slide_type": "Image Right", "content": "A book stays still on a table.\nA car continues moving until brakes are applied.\nSpacecraft drifting in space.", "image_desc": "Book on table, car braking, spacecraft in space. Type: illustration", "video_desc": "", "narration": "Consider a book sitting on a table it remains at rest unless someone picks it up or pushes it. Similarly a car moving at a constant speed will continue at that speed unless the brakes are applied or friction slows it down. Spacecraft drifting in space perfectly demonstrate inertia as they continue moving at a constant velocity unless acted upon by an external force.", "image_url": "https://pub.mdpi-res.com/aerospace/aerospace-11-00245/article_deploy/html/images/aerospace-11-00245-g001.png?1711099182", "image_path": "data/videos/8c271022-42f7-4c80-bf66-b244edfa6aea/images/image_4.webp", "video_url": "", "video_path": ""}, {"slide_number": "5", "title": "Newton's Second Law: The Law of Acceleration", "slide_type": "Image Left", "content": "F = ma\nF = Force (Newtons)\nm = Mass (kilograms)\na = Acceleration (m/s squared)", "image_desc": "Equation F=ma. Type: diagram", "video_desc": "", "narration": "Newton's Second Law of Motion quantifies the relationship between force mass and acceleration. The law states that the acceleration of an object is directly proportional to the net force acting on it and inversely proportional to its mass. This relationship is expressed by the equation F equals m a where F represents force m represents mass and a represents acceleration.", "image_url": "https://i.ytimg.com/vi/h6WUGR3j75M/maxresdefault.jpg?sqp=-oaymwEmCIAKENAF8quKqQMa8AEB-AH6CYAC0AWKAgwIABABGGUgZShlMA8=&rs=AOn4CLCmrsCZ7qDW0MvTI0E-OctyQF0ssg", "image_path": "data/videos/8c271022-42f7-4c80-bf66-b244edfa6aea/images/image_5.webp", "video_url": "", "video_path": ""}, {"slide_number": "6", "title": "Acceleration Examples", "slide_type": "Image Right", "content": "Pushing a light ball vs. a heavy rock.\nThe greater the force, the greater the acceleration.\nThe greater the mass, the smaller the acceleration.", "image_desc": "Person pushing a ball and a rock. Type: illustration", "video_desc": "", "narration": "Imagine pushing a light ball versus pushing a heavy rock with the same amount of force. The ball will accelerate much more than the rock because it has less mass. This illustrates that for a given force a smaller mass results in a greater acceleration and a larger mass results in a smaller acceleration.", "image_url": "https://thumbs.dreamstime.com/b/crushing-reality-black-white-cartoon-flat-illustration-crushing-reality-black-white-cartoon-flat-illustration-african-337394293.jpg", "image_path": "data/videos/8c271022-42f7-4c80-bf66-b244edfa6aea/images/image_6.webp", "video_url": "", "video_path": ""}, {"slide_number": "7", "title": "Newton's Third Law: The Law of Action-Reaction", "slide_type": "Image Left", "content": "For every action, there is an equal and opposite reaction.\nForces always occur in pairs.\nAction and reaction forces act on different objects.", "image_desc": "Person jumping off a boat, rocket launching. Type: illustration", "video_desc": "", "narration": "Newton's Third Law states that for every action there is an equal and opposite reaction. This means that when one object exerts a force on another object the second object exerts an equal force back on the first object but in the opposite direction.", "image_url": "https://media.gettyimages.com/id/918694548/vector/coming-soon.jpg?s=612x612&w=gi&k=20&c=Xs7_1X6DJ_5F8XoQO9SqQvL8zHR7q_o_m3XEDx-P2Zo=", "image_path": "data/videos/8c271022-42f7-4c80-bf66-b244edfa6aea/images/image_7.webp", "video_url": "", "video_path": ""}, {"slide_number": "8", "title": "Action-Reaction Examples", "slide_type": "Image Right", "content": "Jumping off a boat (boat moves backward).\nRocket launch (gases expelled downward, rocket moves upward).\nA person walking (pushing backward on the ground, ground pushes forward).", "image_desc": "Person jumping off a boat, rocket launching, person walking. Type: illustration", "video_desc": "", "narration": "When you jump off a boat you exert a force on the boat and the boat exerts an equal and opposite force back on you causing the boat to move backward. Similarly when a rocket launches it expels gases downward and the gases exert an equal and opposite force upward on the rocket propelling it into space. Even something as simple as walking involves actionreaction forces you push backward on the ground and the ground pushes forward on you allowing you to move.", "image_url": "https://www.shutterstock.com/image-vector/group-happy-friends-diving-sailing-600nw-2297699505.jpg", "image_path": "data/videos/8c271022-42f7-4c80-bf66-b244edfa6aea/images/image_8.webp", "video_url": "", "video_path": ""}]