[{"title": "What is a **Pharmacy**?", "content": ["A **pharmacy** is a place where medicines and other healthcare products are dispensed.", "Pharmacists are trained __professionals__ who provide advice and information about medications.", "Pharmacies also offer a variety of services, such as health screenings and vaccinations."], "image_desc": "A modern pharmacy with shelves stocked with medications and a pharmacist talking to a customer.", "narration": "Welcome to our short video on pharmacies. A pharmacy is a vital part of our healthcare system, providing essential medications and expert advice. Pharmacists are highly trained professionals who ensure that you receive the right medication and understand how to use it safely.", "slide_number": "1", "image_url": "https://thumbs.dreamstime.com/b/pharmacy-medicine-talking-to-customer-shelf-working-retail-store-pharmacist-men-pharmaceutical-medical-280570609.jpg", "image_path": "data\\videos\\6d9e2f47-a318-4e2c-9275-d0ac976019c9\\images\\image_1.webp"}, {"title": "_The Role of a Pharmacist_", "content": ["- **Computers:** From a single category, computers have divided into mainframes, minicomputers, workstations, personal computers, laptops, notebooks, pen computers, and more.", "**Cars:** Initially dominated by Chevrolet, Ford, and Plymouth, cars now have categories like luxury, moderately priced, inexpensive, full-size, intermediates, compacts, sports cars, four-wheel-drive vehicles, RVs, and minivans.", "**Television:** From ABC, CBS, and NBC, television has expanded to include network, independent, cable, pay, public, and other formats.", "**Beer:** From imported and domestic, beer now has categories like premium, popular-priced, light, draft, dry, and non-alcoholic.", "**Countries:** The number of countries has increased from 35 in 1776 to around 190 today."], "image_desc": "A pharmacist filling a prescription and explaining the instructions to a patient.", "narration": "Pharmacists play a crucial role in ensuring patient safety and well-being. They are the experts on medications, and they work closely with doctors and patients to ensure that everyone is on the same page. They are also a valuable resource for information about over-the-counter medications and other healthcare products.", "slide_number": "2", "image_url": "https://www.alamy.com/aggregator-api/download?url=https://c8.alamy.com/comp/EN6CYM/pharmacist-explaining-the-prescription-to-patient-EN6CYM.jpg", "image_path": "data\\videos\\6d9e2f47-a318-4e2c-9275-d0ac976019c9\\images\\image_2.webp"}]