[{"slide_number": "1", "title": "How to Run Project Management Team Meetings", "slide_type": "Title Slide", "content": "No Content", "image_desc": "No Image Description", "video_desc": "project management meetings", "narration": "Effective project management team meetings are crucial for project success. This presentation will guide you through the essential steps to plan conduct and follow up on meetings that drive progress and keep your team aligned.", "image_url": "", "image_path": "", "video_url": "https://videos.pexels.com/video-files/3249940/3249940-sd_640_360_25fps.mp4", "video_path": "data/videos/c0679454-6bd4-441a-92dc-e5b68a76ae18/images/video_1.mp4"}, {"slide_number": "2", "title": "Planning Effective Meetings", "slide_type": "Image Left", "content": "Define the meeting's purpose and objectives clearly.\nCreate a detailed agenda and distribute it in advance.\nSelect the right attendees and schedule the meeting appropriately.\nChoose a suitable meeting format (in-person, virtual, or hybrid).", "image_desc": "People collaborating in a meeting room. Type: stock photo", "video_desc": "", "narration": "Before scheduling any meeting clearly define its purpose. What specific outcomes do you want to achieve Once you know the purpose create a detailed agenda outlining the topics to be discussed and send it to attendees well in advance. This allows everyone to prepare and contribute effectively. Selecting the right participants and choosing the appropriate meeting format are also critical for a productive discussion.", "image_url": "https://media.gettyimages.com/id/2156201582/photo/general-view-of-a-business-entrepreneur-financial-meeting-of-a-happy-group-of-multiethnic.jpg?s=612x612&w=gi&k=20&c=tG6fp-hBhzCqBSVYegmpPyVf7FGUh278LDVyre2e2rE=", "image_path": "data/videos/c0679454-6bd4-441a-92dc-e5b68a76ae18/images/image_2.webp", "video_url": "", "video_path": ""}, {"slide_number": "3", "title": "Conducting Productive Meetings", "slide_type": "Image Right", "content": "Start on time and stick to the agenda.\nFacilitate discussion and encourage participation from all members.\nActively manage time and keep the meeting focused.\nDocument key decisions, action items, and assigned owners.", "image_desc": "A person facilitating a meeting. Type: stock photo", "video_desc": "", "narration": "Begin the meeting promptly to respect everyone's time. As the facilitator guide the discussion ensuring that all agenda items are addressed within the allocated time. Encourage participation from every team member creating an inclusive environment where everyone feels comfortable sharing their ideas. Crucially document all key decisions made action items assigned and the individuals responsible for completing them.", "image_url": "https://c8.alamy.com/comp/2STMPN4/senior-man-leading-meeting-with-diverse-group-at-home-discussing-plans-teamwork-leadership-brainstorming-strategy-collaboration-business-meetin-2STMPN4.jpg", "image_path": "data/videos/c0679454-6bd4-441a-92dc-e5b68a76ae18/images/image_3.webp", "video_url": "", "video_path": ""}, {"slide_number": "4", "title": "Following Up After the Meeting", "slide_type": "Image Left", "content": "Distribute meeting minutes promptly after the meeting.\nTrack progress on action items and follow up with assigned owners.\nSchedule follow-up meetings as needed to address outstanding issues.\nEvaluate the effectiveness of the meeting and identify areas for improvement.", "image_desc": "A person reviewing meeting notes. Type: stock photo", "video_desc": "", "narration": "Following the meeting promptly distribute detailed minutes summarizing the key discussions decisions and action items. Regularly track the progress of these action items and follow up with the assigned owners to ensure timely completion. If necessary schedule followup meetings to address any outstanding issues or continue discussions. Finally evaluate the effectiveness of each meeting to identify areas where you can improve future sessions.", "image_url": "https://media.istockphoto.com/id/1434437996/photo/woman-hand-writing-on-clipboard-with-a-pen.jpg?s=612x612&w=0&k=20&c=IaDtgURkVQ4Onq9WV04kCp1rzjYj1GPUatE0mTOYc-A=", "image_path": "data/videos/c0679454-6bd4-441a-92dc-e5b68a76ae18/images/image_4.webp", "video_url": "", "video_path": ""}]