[{"title": "Embedded Platforms for IoT", "content": ["- Embedded systems are highly customized, developed, and programmed as per user requirements.", "Conventional embedded systems are electronic components that possess a microprocessor, peripherals, memory card, and software program that run instructions, operating system and tools (debuggers, static and non-programmable), and follows firmware programming embedded in the micro-chip.", "Embedded systems will play an important role in Internet of Things (IoT) due to their unique characteristics and features such as real-time computing, low power consumption, low maintenance, and high availability are becoming the key enabler of IoT.", "Major players in embedded system hardware and software developments are aiming to bring these transformations into their products to take advantage of the growing IoT market."], "image_desc": "A generic image of an embedded system board with various components like a microprocessor, memory, and connectors.", "narration": "Embedded platforms are the foundation of the Internet of Things (IoT). They are specialized computer systems designed for specific tasks, often with limited resources and real-time constraints. These platforms are characterized by their ability to interact with the physical world through sensors and actuators, making them ideal for connecting devices to the internet and enabling data exchange.  We will explore some of the popular embedded platforms used in IoT applications.", "slide_number": "1", "image_url": "https://www.theengineeringprojects.com/wp-content/uploads/2021/03/Components-of-Embedded-System-2.png", "image_path": "data/videos/d41fd208-465b-4444-8514-b78c932c63b2/images/image_1.webp"}, {"title": "Arduino", "content": ["- Arduino is an open-source electronics platform based on easy-to-use hardware and software.", "Arduino boards can read inputs (light on a sensor, a finger on a button, Twitter message) and turn them into outputs (activating a motor, turning on an LED, publishing something online).", "You can tell your board what to do by sending a set of instructions to the microcontroller on the board.", "To do so, you use the Arduino programming language (based on Wiring) and the Arduino Software (IDE), based on Processing.", "Over the years, Arduino has been the brain of thousands of projects, from everyday objects to complex scientific instruments."], "image_desc": "An Arduino Uno board with various components like LEDs, buttons, and sensors connected to it.", "narration": "Arduino is a popular choice for hobbyists and professionals alike due to its simplicity and affordability. It provides a user-friendly environment for learning about electronics and programming, making it an excellent platform for experimenting with IoT concepts. Arduino's open-source nature allows for a vast community of developers to contribute to its development and share their projects, making it a rich resource for learning and innovation.", "slide_number": "2", "image_url": "https://electrosome.com/wp-content/uploads/2014/07/Arduino-Uno-connected-to-an-LED.jpg", "image_path": "data/videos/d41fd208-465b-4444-8514-b78c932c63b2/images/image_2.webp"}, {"title": "BeagleBone", "content": ["- BeagleBone Black Wireless is a high-expansion, maker-focused open hardware computer created by the BeagleBoard.org Foundation.", "It is an easy-to-use, credit card-sized Linux computer designed for powerful Internet of Things (IoT) applications.", "The board maximizes connectivity by trading in the 10/100 Ethernet port from Beagle Bone Black for a high-performance Texas Instruments WL1835MOD 802.11 b/g/n 2.4GHz Wi-Fi module with Bluetooth capabilities.", "Beagle Bone Black Wireless is built on an Octavo OSD3358 system-in-package (Sip), which integrates a Texas Instruments TPS65217C power management IC (PMIC), Sitara AM335x ARM Cortex-A8 microprocessor, and TL5209 low dropout (LDO) voltage regulator."], "image_desc": "A BeagleBone Black Wireless board with its various connectors and components visible.", "narration": "BeagleBone Black Wireless is a powerful and versatile embedded platform designed for IoT applications. It offers a wide range of features, including a powerful processor, Wi-Fi and Bluetooth connectivity, and a variety of expansion options. Its open-source nature and active community make it a valuable resource for developers looking to build advanced IoT projects.", "slide_number": "3", "image_url": "https://static.getiot.tech/beaglebone-black-layout.png#center", "image_path": "data/videos/d41fd208-465b-4444-8514-b78c932c63b2/images/image_3.webp"}, {"title": "Intel Galileo", "content": ["- Galileo is a microcontroller board based on the Intel® Quark SoC X1000 Application Processor, a 32-bit Intel Pentium-class system on a chip.", "It's the first board based on Intel® architecture designed to be hardware and software pin-compatible with Arduino shields designed for the Uno R3.", "Galileo is designed to support shields that operate at either 3.3V or 5V.", "The core operating voltage of Galileo is 3.3V. However, a jumper on the board enables voltage translation to 5V at the I/O pins.", "Galileo is also software compatible with the Arduino Software Development Environment (IDE), which makes usability and introduction a snap."], "image_desc": "An Intel Galileo board with its various connectors and components visible. The image should highlight the Arduino-compatible pinout and the additional features like the mini-PCI Express slot and Ethernet port.", "narration": "Intel Galileo is a powerful embedded platform that combines the familiarity of Arduino with the performance and features of Intel processors. It provides a robust platform for developing complex IoT applications, offering a balance between ease of use and advanced capabilities. Its compatibility with Arduino shields and the Arduino IDE makes it a great choice for developers who want to leverage their existing knowledge and skills.", "slide_number": "4", "image_url": "https://www.arduino.cc/en/uploads/ArduinoCertified/IntelGalileo_fabD_Front.jpg", "image_path": "data/videos/d41fd208-465b-4444-8514-b78c932c63b2/images/image_4.webp"}]