[{"slide_number": "1", "title": "Yashoda is Trying to make best quality butter for Lord Krishna", "slide_type": "Image with Caption", "content": "(No additional content for Title Slide)", "image_desc": "[Image Description in English only: A painting of Yashoda churning butter with a young Krishna playing nearby.]", "narration": "माँ यशोदा, अपने प्यारे कृष्ण के लिए सबसे अच्छा gunavatta ka makhan तैयार करना चाहती हैं, इसलिए वो बिना थके मक्खन मथ रही हैं। उनकी seva aur समर्पणा हमें सच्चे प्यार से पैदा हुई सेवा का महत्व सिखाती है। vo makhan banate huve krishna ka chintan aur krishna se jude geet gati rahti he. ", "image_url": "/data/videos/2b81ae37-7c63-4a9d-9034-1f1699bfba1c/images/image_1.webp", "image_path": "data/videos/2b81ae37-7c63-4a9d-9034-1f1699bfba1c/images/image_1.webp"}, {"slide_number": "2", "title": "Krishna is after love", "slide_type": "Image with Caption", "content": "Krishna, though the Supreme Lord, playfully disrupts Yashoda's work.\nHe demands her attention, showing that even God delights in the love of His devotees.", "image_desc": "[Image Description in English only: A painting of Krishna playfully stealing butter from a pot while Yashoda watches.]", "narration": "Krishna atmaram he phir bhi unhe bhukh lagti he aur tab ve yashoda ke pass ate he aur rote he.   कृष्ण, भले ही परमेश्वर हैं, लेकिन वो यशोदा के काम में शरारत से बाधा डालते हैं। वो उनका ध्यान चाहते हैं और ये दिखाते हैं कि भगवान भी अपने भक्तों के प्यार में खुश होते हैं । ", "image_url": "/data/videos/2b81ae37-7c63-4a9d-9034-1f1699bfba1c/images/image_2.webp", "image_path": "data/videos/2b81ae37-7c63-4a9d-9034-1f1699bfba1c/images/image_2.webp"}, {"slide_number": "3", "title": "He is self satisfied but he becomes hungry", "slide_type": "Image with Caption", "content": "As Yashoda leaves to tend the milk, Krishna, out of hunger, breaks the butter pot.\nThis act symbolizes how the Lord responds to every little need of His devotees, even when they demand more of Him.", "image_desc": "[Image Description in English only: A painting of Krishna breaking a butter pot with a mischievous smile on his face.]", "narration": "जब यशोदा दूध देखने जाती हैं, तो भूखे कृष्ण मक्खन का घड़ा तोड़ देते हैं। ये कार्य दर्शाता है कि भगवान अपने भक्तों ka attention chahte he. bhagvan jab dukhi hote he to khudi hi ghar ka makhhan khana aur bikherna shuru kar dete he. ", "image_url": "/data/videos/2b81ae37-7c63-4a9d-9034-1f1699bfba1c/images/image_3.webp", "image_path": "data/videos/2b81ae37-7c63-4a9d-9034-1f1699bfba1c/images/image_3.webp"}, {"slide_number": "4", "title": "Suprem Lord runs in fear", "slide_type": "Image with Caption", "content": "Seeing her broken pot, Yashoda chases Krishna.\nThe all-powerful Lord appears fearful of His mother's scolding, illustrating how genuine love binds even the Supreme.", "image_desc": "[Image Description in English only: A painting of Yashoda chasing Krishna, who looks playfully scared.]", "narration": "अपना टूटा हुआ घड़ा देखकर, यशोदा कृष्ण का पीछा करती हैं। सर्वशक्तिमान भगवान अपनी माँ की डाँट से डरते हुए दिखाई देते हैं, aur vo bhagna shuru karte he aur bahut der prayas karne ke bad bhi yashoda ke dwara pakde jate he. ", "image_url": "/data/videos/2b81ae37-7c63-4a9d-9034-1f1699bfba1c/images/image_4.webp", "image_path": "data/videos/2b81ae37-7c63-4a9d-9034-1f1699bfba1c/images/image_4.webp"}, {"slide_number": "5", "title": "Krishna Submits to Love", "slide_type": "Image with Caption", "content": "Despite His strength, Krishna allows Himself to be bound by Yashoda.\nThis teaches us that pure love has the power to ‘bind' the unbound Lord.", "image_desc": "[Image Description in English only: A painting of Yashoda tying Krishna with a rope.]", "narration": "अपनी ताकत के बावजूद, कृष्ण यशोदा के बंधन में आने देते हैं। ये हमें सिखाता है कि सच्चा प्यार अनबद्ध भगवान को भी ‘बांध' सकता है।", "image_url": "/data/videos/2b81ae37-7c63-4a9d-9034-1f1699bfba1c/images/image_5.webp", "image_path": "data/videos/2b81ae37-7c63-4a9d-9034-1f1699bfba1c/images/image_5.webp"}, {"slide_number": "6", "title": "The Power of Devotion", "slide_type": "Image with Caption", "content": "Yashoda's ropes are always \"two fingers short.\"\nThis teaches us that two factors are necessary for binding the Lord: the devotee's sincere efforts and the Lord's mercy.", "image_desc": "[Image Description in English only: A painting of Yashoda trying to tie Krishna with a rope that is always too short.]", "narration": "यशोदा की रस्सियाँ हमेशा \"दो उंगली कम\" होती हैं। ये हमें सिखाता है कि भगवान को बांधने के लिए दो चीजें ज़रूरी हैं:  ek he bhakto ke dwara kiya gaya prayasa aur dusra hota he bhagavan ki kripa. ", "image_url": "/data/videos/2b81ae37-7c63-4a9d-9034-1f1699bfba1c/images/image_6.webp", "image_path": "data/videos/2b81ae37-7c63-4a9d-9034-1f1699bfba1c/images/image_6.webp"}, {"slide_number": "7", "title": "Breaking Free with Mercy", "slide_type": "Image with Caption", "content": "Krishna uses this moment to grant liberation to the cursed sons of Kubera by breaking the twin Arjuna trees.\nThis act teaches that mercy is His true gift to those who seek Him.", "image_desc": "[Image Description in English only: A painting of Krishna breaking the Arjuna trees with a rope.]", "narration": "कृष्ण इस मौके का इस्तेमाल कुबेर के श्रापित पुत्रों को मुक्ति देने के लिए करते हैं, वो दो अर्जुन वृक्षों को तोड़ देते हैं। ये कार्य सिखाता है कि दया उन लोगों के लिए उनका सच्चा उपहार है जो उन्हें ढूंढते हैं।", "image_url": "/data/videos/2b81ae37-7c63-4a9d-9034-1f1699bfba1c/images/image_7.webp", "image_path": "data/videos/2b81ae37-7c63-4a9d-9034-1f1699bfba1c/images/image_7.webp"}, {"slide_number": "8", "title": "Love Beyond Fear and Power", "slide_type": "Image with Caption", "content": "Damodar Lila ends with Krishna allowing His mother to shower Him with love.\nThis proves that the Lord's greatest joy comes from relationships, not power or majesty.", "image_desc": "[Image Description in English only: A painting of Yashoda lovingly embracing Krishna.]", "narration": "Krishna jo sabhi ki raksha karte he unhe bhi raksha ki avashyakta hoti he. vo apne bhakto ke vash me akar is tarah anek lila karte he jiske dwara vo unhe anand ke kund me dubo dete he. damodar lila vatsalya rasa ki ek sarvotkrsta lila jisme bhagvan krishna yashoda ke sath bhakti ka adan pradan karte he. ", "image_url": "/data/videos/2b81ae37-7c63-4a9d-9034-1f1699bfba1c/images/image_8.webp", "image_path": "data/videos/2b81ae37-7c63-4a9d-9034-1f1699bfba1c/images/image_8.webp"}]