[{"title": "Introduction to Pulse Code Modulation", "content": ["- Pulse Code Modulation (PCM) is a technique used to convert analog signals into digital data.", "PCM involves three main steps:\n    - **Sampling:** Converting the analog signal into a discrete-time signal.\n    - **Quantization:** Representing the sampled values with a finite number of levels.\n    - **Encoding:** Assigning a unique code to each quantized level."], "image_desc": "A diagram illustrating the process of converting an analog signal to a digital signal using PCM, showing the steps of sampling, quantization, and encoding.", "narration": "PCM ek technique hai jiske sahayata se hum analog signal ko digital data mein convert kar sakte hain. PCM mein teen main steps hote hain: sampling, quantization aur encoding.", "slide_number": "1", "image_url": "/data/videos/c6a47fd2-efe7-4aa3-bf69-df87d6e27156/images/image_1.webp", "image_path": "data/videos/c6a47fd2-efe7-4aa3-bf69-df87d6e27156/images/image_1.webp"}, {"title": "Sampling", "content": ["- Sampling is the process of converting a continuous analog signal into a discrete-time signal.", "The analog signal is sampled at regular intervals, called the sampling period (Ts).", "The sampling frequency (fs) is the reciprocal of the sampling period (fs = 1/Ts).", "There are different sampling methods, including:\n    - **Ideal sampling:** An impulse at each sampling instant.\n    - **Natural sampling:** A pulse of short width with varying amplitude.\n    - **Flat-top sampling:** A pulse of short width with fixed amplitude."], "image_desc": "A graph showing an analog signal and its sampled version, illustrating different sampling methods.", "narration": "Sampling ek process hai jiske sahayata se hum ek continuous analog signal ko discrete-time signal mein convert karte hain. Analog signal ko regular intervals par sample kiya jata hai, jisko sampling period (Ts) kehte hain. Sampling frequency (fs) sampling period ka reciprocal hota hai (fs = 1/Ts).  Alag-alag sampling methods hain, jaise ki ideal sampling, natural sampling aur flat-top sampling.", "slide_number": "2", "image_url": "/data/videos/c6a47fd2-efe7-4aa3-bf69-df87d6e27156/images/image_2.webp", "image_path": "data/videos/c6a47fd2-efe7-4aa3-bf69-df87d6e27156/images/image_2.webp"}, {"title": "Quantization", "content": ["- Quantization is the process of converting the sampled values into a finite number of levels.", "Each quantized level is represented by a unique code.", "The difference between the sampled output and the quantized output is called quantization distortion.", "To reduce quantization distortion, we can increase the number of quantization levels by using more bits.", "There are two main types of quantization:\n    - **Linear quantization:**  All quantization intervals are of equal size.\n    - **Non-linear quantization:**  Quantization intervals are not of equal size."], "image_desc": "A graph showing the quantization process, illustrating the mapping of sampled values to quantized levels.", "narration": "Quantization ek process hai jiske sahayata se hum sampled values ko finite number of levels mein convert karte hain. Har quantized level ko ek unique code se represent kiya jata hai. Sampled output aur quantized output ke beech ka difference quantization distortion kehte hain. Quantization distortion ko kam karne ke liye, hum quantization levels ki sankhya badha sakte hain, jiske liye hum zyada bits use karte hain.  Do main types of quantization hain: linear quantization aur non-linear quantization.", "slide_number": "3", "image_url": "https://i.ytimg.com/vi/wp6TWFdRf_0/maxresdefault.jpg?sqp=-oaymwEmCIAKENAF8quKqQMa8AEB-AHmB4AC0AWKAgwIABABGFQgXShlMA8=&rs=AOn4CLC9unaADiQ5rVAo921AbnIJ_-n4KQ", "image_path": "data/videos/c6a47fd2-efe7-4aa3-bf69-df87d6e27156/images/image_3.webp"}, {"title": "Encoding", "content": ["- Encoding is the process of assigning a unique binary code to each quantized level.", "The number of bits used for encoding determines the number of quantization levels.", "For example, using 8 bits allows for 2^8 = 256 different quantization levels.", "The binary code is then transmitted over the communication channel."], "image_desc": "A table showing the mapping of quantized levels to binary codes.", "narration": "Encoding ek process hai jiske sahayata se hum har quantized level ko ek unique binary code assign karte hain. Encoding ke liye use kiye jaane wale bits ki sankhya quantization levels ki sankhya decide karti hai.  Jaise ki, 8 bits use karne se 2^8 = 256 different quantization levels possible hain. Binary code ko fir communication channel par transmit kiya jata hai.", "slide_number": "4", "image_url": "https://i.ytimg.com/vi/ydzcusUMVLM/maxresdefault.jpg", "image_path": "data/videos/c6a47fd2-efe7-4aa3-bf69-df87d6e27156/images/image_4.webp"}, {"title": "Advantages of Pulse Code Modulation", "content": ["- **Low noise addition:** PCM is less susceptible to noise interference during transmission.", "**Low data loss:** PCM provides a robust method for transmitting data with minimal loss.", "**Widely used:** PCM is used in various applications, including music playback CDs, DVDs, and digital telephony."], "image_desc": "A diagram showing the advantages of PCM, such as low noise and data loss.", "narration": "PCM ke kai advantages hain, jaise ki low noise addition, low data loss aur wide use.", "slide_number": "5", "image_url": "https://image3.slideserve.com/6516005/pcm-block-diagram-l.jpg", "image_path": "data/videos/c6a47fd2-efe7-4aa3-bf69-df87d6e27156/images/image_5.webp"}, {"title": "Disadvantages of Pulse Code Modulation", "content": ["- **Large bandwidth requirement:** PCM requires a large bandwidth for transmission.", "**Specialized circuitry:** PCM requires specialized circuitry for both transmission and quantization."], "image_desc": "A diagram showing the disadvantages of PCM, such as large bandwidth and specialized circuitry requirements.", "narration": "PCM ke kuchh disadvantages bhi hain, jaise ki large bandwidth requirement aur specialized circuitry ki jarurat.", "slide_number": "6", "image_url": "https://ars.els-cdn.com/content/image/3-s2.0-B9780750653190500240-u23-11-9780750653190.jpg", "image_path": "data/videos/c6a47fd2-efe7-4aa3-bf69-df87d6e27156/images/image_6.webp"}]