[{"title": "Law of the Opposite", "content": ["- The Law of the Opposite states that if you are targeting second place, your strategy should be opposite to the leader's.", "This means you need to identify the leader's strengths and turn them into weaknesses for your brand."], "image_desc": "A ladder with \"No. 1\" at the top and \"No. 2\" a few rungs down.", "narration": "Law of the Opposite ka kehna hai ki agar aap second place ke liye target kar rahe hain, to aapki strategy leader ke according honi chahiye.", "slide_number": "1", "image_url": "http://www.homenish.com/wp-content/uploads/2021/04/Parts-of-a-Step-Ladder.jpg", "image_path": "data/videos/ea118e03-266f-46c2-94a1-563d0de09ff5/images/image_1.webp"}, {"title": "Coca-Cola vs. Pepsi", "content": ["- Coca-Cola, an established brand, positioned itself as reliable and familiar.", "Pepsi, as the challenger, targeted the \"Pepsi Generation\" and positioned itself as a new and exciting alternative."], "image_desc": "Coca-Cola and Pepsi logos side-by-side with text \"Old Reliable\" and \"New Generation\" respectively.", "narration": "Jaise Coca-Cola ek 100 saal purana product hai, aur uska formula sirf 7 logon ko pata hai, ekdum secret hai. Coca-Cola ne apne aapko established aur reliable brand ke roop mein establish kiya. Pepsi ne ise ulta kar diya aur apne aapko ‘Pepsi Generation' ka choice banaya.", "slide_number": "2", "image_url": "https://i.ytimg.com/vi/95-mEnz8bdY/maxresdefault.jpg", "image_path": "data/videos/ea118e03-266f-46c2-94a1-563d0de09ff5/images/image_2.webp"}, {"title": "Newsweek vs. Time", "content": ["- Time magazine was known for its colorful writing style.", "Newsweek challenged this by adopting a straightforward writing style, differentiating itself from Time."], "image_desc": "A clip showing Newsweek and Time magazine covers.", "narration": "Agar aap ek second place brand hain, to aapko leader ke strong points ko weakness mein convert karna hoga. Example ke liye, Newsweek ne Time ke colorful writing style ko challenge kiya aur straightforward style ko apnaaya.", "slide_number": "3", "image_url": "https://media4.s-nbcnews.com/j/MSNBC/Components/Slideshows/_production/ss-121018-newsweek-covers/NW19380404_1_H.fit-760w.jpg", "image_path": "data/videos/ea118e03-266f-46c2-94a1-563d0de09ff5/images/image_3.webp"}, {"title": "Scope vs. Listerine", "content": ["- Listerine was positioned as a medicine-like mouthwash.", "Scope challenged this by positioning itself as a \"good-tasting\" mouthwash, highlighting Listerine's negative aspect."], "image_desc": "A clip showing Scope and Listerine mouthwashes.", "narration": "Scope ne Listerine ko ‘medicine breath' ke label ke saath challenge kiya, aur apne aapko ‘good-tasting' mouthwash ke roop mein present kiya.", "slide_number": "4", "image_url": "https://cdn4.bestreviews.com/images/v4desktop/image-full-page-cb/1040x585-2021-1108-scope-mouthwash-vs--listerine-mouthwash-760d37.jpg", "image_path": "data/videos/ea118e03-266f-46c2-94a1-563d0de09ff5/images/image_4.webp"}, {"title": "Beck's vs. Lowenbrau", "content": ["- Lowenbrau was positioned as a German beer.", "Beck's differentiated itself by positioning itself as the \"most popular German beer in Germany,\" highlighting its unique position."], "image_desc": "A graphic of Beck's and Lowenbrau beer labels.", "narration": "Ek aur interesting example hai Beck's beer ka. Beck's ne Lowenbrau ko position kiya as ‘German beer that's the most popular in Germany'.", "slide_number": "5", "image_url": "https://www.thebelgianbeercompany.com/wp-content/uploads/2020/03/Lowenbrau-Original.jpg", "image_path": "data/videos/ea118e03-266f-46c2-94a1-563d0de09ff5/images/image_5.webp"}, {"title": "Tylenol vs. Aspirin", "content": ["- Aspirin, an established pain reliever, had certain negative aspects.", "Tylenol capitalized on this by positioning itself as \"for the millions who should not take aspirin,\" highlighting Aspirin's weakness."], "image_desc": "A graphic of Tylenol and Aspirin bottles.", "narration": "Aspirin, jo ki 1899 se market mein tha, uske negative aspect ko highlight karte hue Tylenol ne apna position banaya.", "slide_number": "6", "image_url": "https://a57.foxnews.com/a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2018/09/640/320/1862/1048/Tylenol_Extra_Strength_AP_640.jpg?ve=1&tl=1?ve=1&tl=1", "image_path": "data/videos/ea118e03-266f-46c2-94a1-563d0de09ff5/images/image_6.webp"}, {"title": "Stolichnaya vs. American Vodkas", "content": ["- Stolichnaya positioned itself as \"real Russian vodka,\" highlighting the authenticity of its origin.", "This tactic challenged American vodkas, which were perceived as \"fake.\""], "image_desc": "A graphic of Stolichnaya and American vodkas.", "narration": "Stolichnaya ne apne aapko ‘real Russian vodka' ke roop mein position kiya aur American vodkas ko ‘fake' label laga diya.", "slide_number": "7", "image_url": "https://www.brixwineandliquor.com/wp-content/uploads/2020/04/Stoli201L.jpg", "image_path": "data/videos/ea118e03-266f-46c2-94a1-563d0de09ff5/images/image_7.webp"}, {"title": "Royal Doulton vs. Lenox", "content": ["- Lenox was positioned as American china.", "Royal Doulton challenged this by positioning itself as \"real English china,\" highlighting its heritage."], "image_desc": "A graphic of Royal Doulton and Lenox china.", "narration": "Royal Doulton ne Lenox ke American origin ko highlight kiya aur apne aapko ‘real English china' ke roop mein present kiya.", "slide_number": "8", "image_url": "https://i.etsystatic.com/21125706/r/il/a7981a/2900005586/il_794xN.2900005586_9amf.jpg", "image_path": "data/videos/ea118e03-266f-46c2-94a1-563d0de09ff5/images/image_8.webp"}, {"title": "Burger King vs. McDonald's", "content": ["- Burger King's sales were high when they attacked McDonald's.", "When they stopped targeting McDonald's, their sales declined.", "This shows the importance of a clear and aggressive approach for a strong No. 2 brand."], "image_desc": "A clip of Burger King and McDonald's logos.", "narration": "Ab baat karte hain Burger King ki. Burger King ne jab tak McDonald's ko attack kiya, uski sales high thi. Jab unhone McDonald's ko target karna band kiya, tab unki sales decline hui.", "slide_number": "9", "image_url": "https://thumbs.dreamstime.com/z/mcdonalds-kfc-burger-king-cafe-icon-mcdonalds-logo-kfc-symbol-burger-king-vector-icon-mcdonalds-kfc-burger-king-cafe-icon-232973278.jpg", "image_path": "data/videos/ea118e03-266f-46c2-94a1-563d0de09ff5/images/image_9.webp"}, {"title": "Created with CollegitesAI ", "content": ["- The Law of the Opposite is a powerful strategy for second-place brands.", "By identifying the leader's strengths and turning them into weaknesses, you can create a unique position for your brand."], "image_desc": "A graphic of a ladder with \"No. 1\" at the top and \"No. 2\" a few rungs down.", "narration": "To doston, yeh thi ‘Law of the Opposite' ki kahani. Aapko apne competitors ke strength ko weakness mein convert karna hoga aur apni unique position banani hogi.", "slide_number": "10", "image_url": "https://ecdn.teacherspayteachers.com/thumbitem/Metric-Conversion-Ladder-Graphic-Clean-Simple-1841779-1574720245/original-1841779-1.jpg", "image_path": "data/videos/ea118e03-266f-46c2-94a1-563d0de09ff5/images/image_10.webp"}]