[{"slide_number": "1", "title": "IoT Sources: Hardware, RFID, and Wireless Sensor Networks", "slide_type": "Title Slide", "content": ["- (No additional content for Title Slide)"], "image_desc": "- A colorful image of various IoT devices connected to a network, with a globe in the background.", "narration": "नमस्ते! आज हम IoT के स्रोतों के बारे में जानेंगे।  IoT, यानी Internet of Things,  एक ऐसा सिस्टम है जो हमारे आस-पास की चीजों को इंटरनेट से जोड़ता है।", "image_url": "https://images.pexels.com/photos/18509543/pexels-photo-18509543.jpeg", "image_path": "data/videos/90c40e4b-9c33-4925-a800-7372e4a76e77/images/image_1.webp"}, {"slide_number": "2", "title": "Popular IoT Development Boards", "slide_type": "Image Left", "content": ["- Arduino Yún", "- Microduino", "- Intel Galileo", "- Intel Edison", "- Beagle Board", "- Raspberry Pi Wireless Inventors Kit (RasWIK)"], "image_desc": "- A collage of images showcasing different popular IoT development boards.", "narration": "IoT प्रोटोटाइप बनाने के लिए कई तरह के हार्डवेयर बोर्ड इस्तेमाल होते हैं।  कुछ लोकप्रिय बोर्ड हैं: Arduino Yún, Microduino, Intel Galileo, Intel Edison, Beagle Board, और Raspberry Pi Wireless Inventors Kit.", "image_url": "https://i.ytimg.com/vi/EqHXCU_QYYI/maxresdefault.jpg", "image_path": "data/videos/90c40e4b-9c33-4925-a800-7372e4a76e77/images/image_2.webp"}, {"slide_number": "3", "title": "Arduino Yún", "slide_type": "Image Right", "content": ["- Uses microcontroller ATmega32u4", "- Supports Arduino and includes Wi-Fi, Ethernet, USB port, micro-SD card slot, and three reset buttons.", "- Combines with Atheros AR9331 that runs Linux."], "image_desc": "- A close-up image of an Arduino Yún board, showcasing its features.", "narration": "Arduino Yún बोर्ड में ATmega32u4 माइक्रो-कंट्रोलर है, जो Arduino को सपोर्ट करता है।  इसमें Wi-Fi, Ethernet, USB पोर्ट, micro-SD कार्ड स्लॉट, और तीन reset बटन हैं।  यह Atheros AR9331 के साथ भी काम करता है, जो Linux चलाता है।", "image_url": "https://m.media-amazon.com/images/I/71OAcMSd05L._AC_UF350,350_QL80_.jpg", "image_path": "data/videos/90c40e4b-9c33-4925-a800-7372e4a76e77/images/image_3.webp"}, {"slide_number": "4", "title": "Microduino", "slide_type": "Image Right", "content": ["- Small board compatible with Arduino.", "- Can be stacked with other boards.", "- Open-source hardware designs."], "image_desc": "- A close-up image of a Microduino board, highlighting its small size and stackable feature.", "narration": "Microduino एक छोटा बोर्ड है जो Arduino के साथ compatible है।  इसे दूसरे बोर्डों के साथ stack किया जा सकता है।  इसके सभी हार्डवेयर डिजाइन open source हैं।", "image_url": "https://thecavepearlproject.org/wp-content/uploads/2023/11/p3o_rtcjumper4_900pixw.jpg?w=900", "image_path": "data/videos/90c40e4b-9c33-4925-a800-7372e4a76e77/images/image_4.webp"}, {"slide_number": "5", "title": "Intel Galileo", "slide_type": "Image Right", "content": ["- Arduino-certified development board.", "- Based on Intel x86 architecture.", "- Open-source hardware featuring Intel SOC X1000 Quark based Soc.", "- Pin-compatible with Arduino.", "- 20 digital I/O (12 GPIOs fully native), 12-bit PWM, six analog inputs.", "- Supports power over Ethernet (PoE)."], "image_desc": "- A close-up image of an Intel Galileo board, showcasing its features and connections.", "narration": "Intel Galileo एक Arduino-certified development board है।  यह Intel x86 architecture पर आधारित है।  यह open-source hardware है जिसमें Intel SOC X1000 Quark based Soc है।  यह Arduino के साथ pin-compatible है।  इसमें 20 digital I/O, 12-bit PWM, और छह analog inputs हैं।  यह power over Ethernet (PoE) को भी सपोर्ट करता है।", "image_url": "https://cdn.sparkfun.com/assets/parts/1/0/1/3/8/13096-01.jpg", "image_path": "data/videos/90c40e4b-9c33-4925-a800-7372e4a76e77/images/image_5.webp"}, {"slide_number": "6", "title": "Intel Edison", "slide_type": "Image Right", "content": ["- Compute module for rapid prototyping.", "- Enables creation of prototypes and fast development of IoT and wearable computing devices.", "- Seamless device internetworking and device-to-cloud communication.", "- Includes foundational tools for data collection, storage, processing, and analytics."], "image_desc": "- A close-up image of an Intel Edison module, showcasing its compact size and connectivity options.", "narration": "Intel Edison एक compute module है।  यह IoT और wearable computing devices के rapid prototyping के लिए इस्तेमाल होता है।  यह seamless device internetworking और device-to-cloud communication को सपोर्ट करता है।  इसमें data collection, storage, processing, और analytics के लिए foundational tools शामिल हैं।", "image_url": "https://cdn.sparkfun.com/assets/parts/1/0/0/1/0/13024-01.jpg", "image_path": "data/videos/90c40e4b-9c33-4925-a800-7372e4a76e77/images/image_6.webp"}, {"slide_number": "7", "title": "Beagle Board", "slide_type": "Image Right", "content": ["- Low power requirement.", "- Card-like computer that can run Android and Linux.", "- Open-source hardware and software designs."], "image_desc": "- A close-up image of a Beagle Board, showcasing its compact size and connections.", "narration": "Beagle Board एक card-like computer है जो Android और Linux चला सकता है।  इसकी power requirement बहुत कम है।  इसके hardware और software designs open source हैं।", "image_url": "/data/videos/90c40e4b-9c33-4925-a800-7372e4a76e77/images/image_7.webp", "image_path": "data/videos/90c40e4b-9c33-4925-a800-7372e4a76e77/images/image_7.webp"}, {"slide_number": "8", "title": "Raspberry Pi Wireless Inventors Kit (RasWIK)", "slide_type": "Image Right", "content": ["- Enables Raspberry Pi Wi-Fi connected devices.", "- Includes documentation for 29 different projects.", "- Open-source code for building commercial products."], "image_desc": "- A close-up image of a Raspberry Pi Wireless Inventors Kit, showcasing its components and documentation.", "narration": "Raspberry Pi Wireless Inventors Kit (RasWIK) Raspberry Pi को Wi-Fi से connect करने के लिए इस्तेमाल होता है।  इसमें 29 different projects के लिए documentation शामिल है।  इसका code open source है, जिसका इस्तेमाल commercial products बनाने के लिए भी किया जा सकता है।", "image_url": "https://cdn.sparkfun.com/assets/parts/2/1/5/3/1/21702-_KIT-_01.jpg", "image_path": "data/videos/90c40e4b-9c33-4925-a800-7372e4a76e77/images/image_8.webp"}, {"slide_number": "9", "title": "Role of RFID in IoT Applications", "slide_type": "Image Left", "content": ["- Earlier IoT systems were internet-connected RFID based systems.", "- RFID enables tracking, inventory control, identification in supply chain systems, access to buildings, road tolls, and secured store centre entries.", "- RFID networks have new applications in factory design, 3PL-management, brand protection, anti-counterfeiting, and new business processes for payment, leasing, insurance, and quality management."], "image_desc": "- An image of a warehouse with RFID tags attached to products, illustrating the use of RFID in inventory management.", "narration": "पहले के IoT systems RFID based थे।  RFID tracking, inventory control, supply chain systems में identification, buildings में access, road tolls, और secured store centre entries के लिए इस्तेमाल होता है।  RFID networks का इस्तेमाल factory design, 3PL-management, brand protection, anti-counterfeiting, और payment, leasing, insurance, और quality management जैसे नए business processes में भी होता है।", "image_url": "https://www.peerbits.com/static/b9b7174447115b3a650642267d933e5d/189bc/warehouse-management-rfid-retails.jpg", "image_path": "data/videos/90c40e4b-9c33-4925-a800-7372e4a76e77/images/image_9.webp"}, {"slide_number": "10", "title": "Wireless Sensor Networks (WSNs)", "slide_type": "Image Left", "content": ["- Sensors can be networked using wireless technology to monitor physical or environmental conditions.", "- Sensors acquire data from remote locations.", "- Each wireless sensor has communication abilities using a radio-frequency transceiver.", "- Each node has an analog sensor with a signal conditioner circuit or a digital sensor.", "- Sensing can be done to monitor temperature, light intensity, presence of darkness, metal proximity, traffic, physical, chemical, and biological data."], "image_desc": "- An image of a network of wireless sensors deployed in a forest, monitoring environmental conditions like temperature and humidity.", "narration": "Wireless Sensor Networks (WSNs)  wireless technology का इस्तेमाल करके sensors को network करते हैं।  यह sensors physical या environmental conditions को monitor करते हैं।  यह sensors remote locations से data acquire करते हैं।  हर wireless sensor में radio-frequency transceiver का इस्तेमाल करके communication की ability होती है।  हर node में analog sensor with a signal conditioner circuit या digital sensor होता है।  यह temperature, light intensity, presence of darkness, metal proximity, traffic, physical, chemical, और biological data को monitor कर सकते हैं।", "image_url": "https://pub.mdpi-res.com/sensors/sensors-21-07243/article_deploy/html/images/sensors-21-07243-g001.png?1635839484", "image_path": "data/videos/90c40e4b-9c33-4925-a800-7372e4a76e77/images/image_10.webp"}, {"slide_number": "11", "title": "WSN Definition", "slide_type": "Image Right", "content": ["- A network in which each sensor node connects wirelessly and has capabilities of computations for data compaction, aggregation, and analysis plus communication and networking.", "- WSN node is autonomous with independent computing power, ability to send requests and receive responses, and data forward and routing capabilities."], "image_desc": "- A diagram illustrating the structure of a Wireless Sensor Network (WSN), showing interconnected sensor nodes.", "narration": "WSN, यानी Wireless Sensor Network, एक ऐसा network है जिसमें हर sensor node wirelessly connect होता है।  इसमें data compaction, aggregation, और analysis के लिए computations की ability होती है।  यह communication और networking भी करता है।  WSN node autonomous होता है।  इसमें independent computing power, requests send करने और responses receive करने की ability, और data forward और routing capabilities होती हैं।", "image_url": "https://www.mdpi.com/sensors/sensors-22-02087/article_deploy/html/images/sensors-22-02087-g001-550.jpg", "image_path": "data/videos/90c40e4b-9c33-4925-a800-7372e4a76e77/images/image_11.webp"}, {"slide_number": "12", "title": "WSN Node", "slide_type": "Image Left", "content": ["- Limited computing power.", "- Rapidly changing topology.", "- Functions as an ad-hoc network in a topology-changing environment.", "- Self-configuring, self-organising, self-healing, and self-discovering."], "image_desc": "- A close-up image of a single WSN node, highlighting its components and communication capabilities.", "narration": "WSN node में limited computing power होती है।  इसकी topology rapidly change हो सकती है।  topology-changing environment में यह ad-hoc network की तरह काम करता है।  यह self-configuring, self-organising, self-healing, और self-discovering होता है।", "image_url": "https://www.mdpi.com/technologies/technologies-11-00117/article_deploy/html/images/technologies-11-00117-g001.png", "image_path": "data/videos/90c40e4b-9c33-4925-a800-7372e4a76e77/images/image_12.webp"}, {"slide_number": "13", "title": "Reconfirm Your Understanding", "slide_type": "Two Columns", "content": ["- **Column 1**:", "- IoT sources are microcontroller-based boards—Arduino, Intel Galileo, Intel Edison, Beagle Board, and Raspberry Pi.", "- The sources have open-source IDEs and development tools.", "- Arduino uses a microcontroller, for example, ATmega 328 or ATmega 32u4.", "- Raspberry Pi uses ARM Cortex and ARM LPC microcontroller-based boards.", "- **Column 2**:", "- RFIDs are identifying devices which communicate their identity and have a number of IoT applications, such as inventory control, tracking, and supply chain.", "- Wireless Sensor Nodes are wireless sensors which form a self-configuring and self-discovering network."], "image_desc": "- A simple image of a question mark, prompting viewers to think about the key takeaways from the presentation.", "narration": "तो, आज हमने IoT के स्रोतों के बारे में जाना।  हमने microcontroller-based boards, RFID, और Wireless Sensor Networks के बारे में सीखा।  अब आप इन स्रोतों को IoT projects में कैसे इस्तेमाल कर सकते हैं, इस बारे में सोचें!", "image_url": "https://cdn.slidemodel.com/wp-content/uploads/20550-01-key-takeaways-slide-for-powerpoint-16x9-2-870x489.jpg", "image_path": "data/videos/90c40e4b-9c33-4925-a800-7372e4a76e77/images/image_13.webp"}, {"slide_number": "14", "title": "Thank You!", "slide_type": "Image with Caption", "content": ["- Thank you for watching!"], "image_desc": "- A colorful image of a handshake, symbolizing appreciation and collaboration.", "narration": "आपका समय देने के लिए धन्यवाद!  अगर आपको यह वीडियो पसंद आया, तो इसे like करें और अपने दोस्तों के साथ शेयर करें।  और हमारे channel को subscribe करना न भूलें!", "image_url": "https://img.freepik.com/premium-photo/vibrant-collaboration-colorful-handshake-fine-line-art_983420-16278.jpg", "image_path": "data/videos/90c40e4b-9c33-4925-a800-7372e4a76e77/images/image_14.webp"}]