[{"title": "10. The Law of Division", "content": ["- The Law of Division states that over time, a category will divide into two or more categories.", "This is similar to how an amoeba divides in a petri dish, creating more amoebas.", "The marketing arena is also an expanding sea of categories."], "image_desc": "A petri dish with amoebas dividing", "narration": "दोस्तों, Law of Division कहता है कि समय के साथ, एक category दो या ज़्यादा categories में divide हो जाती है। जैसे एक amoeba जो petri dish में divide होता है, वैसे ही marketing arena भी एक expanding sea of categories बन जाती है।", "slide_number": "1", "image_url": "https://as1.ftcdn.net/v2/jpg/05/61/74/02/1000_F_561740222_2xordrSTvdV8tKNB0sGc7u4KxADWwY8S.jpg", "image_path": "data/videos/1aab0f32-8272-47c5-8cc3-21682bd85390/images/image_1.webp"}, {"title": "Examples of Division", "content": ["- **Computers:** From a single category, computers have divided into mainframes, minicomputers, workstations, personal computers, laptops, notebooks, pen computers, and more.", "**Cars:** Initially dominated by Chevrolet, Ford, and Plymouth, cars now have categories like luxury, moderately priced, inexpensive, full-size, intermediates, compacts, sports cars, four-wheel-drive vehicles, RVs, and minivans.", "**Television:** From ABC, CBS, and NBC, television has expanded to include network, independent, cable, pay, public, and other formats.", "**Beer:** From imported and domestic, beer now has categories like premium, popular-priced, light, draft, dry, and non-alcoholic.", "**Countries:** The number of countries has increased from 35 in 1776 to around 190 today."], "image_desc": "A collage of images representing computers, cars, televisions, beer bottles, and a world map", "narration": "पहले, एक simple example लेते हैं। Computers का category देखिए। पहले एक ही category थी। लेकिन धीरे-धीरे, ये category divide हुई और आज हमारे पास है mainframes, minicomputers, workstations, personal computers, laptops, notebooks, pen computers, और भी बहुत कुछ।\n\nSame बात cars के साथ भी होती है। जब cars ने market में entry दी, तो सिर्फ़ तीन brands dominate करते थे: Chevrolet, Ford, और Plymouth. अब देखिए कितने categories हैं! Luxury cars, moderately priced cars, और inexpensive cars. Full-size, intermediates, और compacts. Sports cars, four-wheel-drive vehicles, RVs, और minivans. ये सब अलग-अलग categories हैं, जो time के साथ develop हुई हैं।\n\nTelevision industry भी इससे अलग नहीं है। पहले सिर्फ़ ABC, CBS, और NBC थे जो 90% audience को cover करते थे। अब network television, independent television, cable, pay television, public television, और भी नए formats आ गए हैं।\n\nऔर beer! हाँ, beer भी इससे बचा नहीं है। पहले imported और domestic beer होती थी। अब है premium और popular-priced beers, light, draft, dry beers, और non-alcoholic beer. ये सब categories time के साथ divide हुई हैं।\n\nCountries भी इससे बचा नहीं है। 1776 में 35 empires, kingdoms, countries, और states थे। World War II तक ये number double हो गया। 1970 तक 130 से ज़्यादा countries हो गई थी। आज के time पे around 190 countries हैं।", "slide_number": "2", "image_url": "https://i.etsystatic.com/7920846/r/il/01e46a/1187750426/il_fullxfull.1187750426_d6el.jpg", "image_path": "data/videos/1aab0f32-8272-47c5-8cc3-21682bd85390/images/image_2.webp"}, {"title": "Division in Music", "content": ["- Music has also divided from classical and popular to 11 different hit lists on Billboard: classical, contemporary jazz, country, crossover, dance, Latin, jazz, pop, rap, rhythm and blues, and rock.", "Each category has its own leader."], "image_desc": "A music player with different genres of music playing", "narration": "अब, music field की बात करते हैं। पहले classical और popular music होती थी। Top 40 hits देखना होता था। आज Billboard के पास 11 अलग hit lists हैं! Classical, contemporary jazz, country, crossover, dance, Latin, jazz, pop, rap, rhythm and blues, और rock. और हर category का अपना leader होता है।", "slide_number": "3", "image_url": "https://www.runthemusic.com/wp-content/uploads/2022/05/istockphoto-1142915732-612x612-1.jpg", "image_path": "data/videos/1aab0f32-8272-47c5-8cc3-21682bd85390/images/image_3.webp"}, {"title": "The Trend of Segmentation", "content": ["- When a category divides, each segment has its own reason for existence.", "For example, IBM is the leader in mainframes, DEC in minis, and Sun in workstations.", "This is the trend of segmentation."], "image_desc": "A diagram showing a category dividing into segments", "narration": "जब एक category divide होती है, तो हर segment का अपना reason for existence होता है। जैसे IBM mainframes में leader है, DEC minis में, और Sun workstations में। ये segmentation का trend है।", "slide_number": "4", "image_url": "https://i.pinimg.com/originals/20/2d/88/202d882548109b01c785e1123492dd15.png", "image_path": "data/videos/1aab0f32-8272-47c5-8cc3-21682bd85390/images/image_4.webp"}, {"title": "Categories Combine or Divide?", "content": ["- Many corporate leaders believe that categories are combining due to synergy and corporate alliances.", "However, the reality is that categories are dividing, not combining."], "image_desc": "A diagram showing two categories merging and another diagram showing a category dividing", "narration": "बहुत सारे corporate leaders को लगता है कि categories combine हो रही हैं। Synergy और corporate alliances के buzzwords सुनने को मिलते हैं। IBM भी ये ही सोचता है कि technology की convergence से वो industries को capture करेगा। लेकिन reality ये है कि categories combine नहीं हो रही, वो divide हो रही हैं।", "slide_number": "5", "image_url": "https://static.cameramath.com/jkyx9y2yhe/222da9ab78ba569ea42637d7aa7efeb1", "image_path": "data/videos/1aab0f32-8272-47c5-8cc3-21682bd85390/images/image_5.webp"}, {"title": "The Case of Financial Services", "content": ["- Some predict that in the future, there will be one large financial services company instead of separate banks, insurance companies, stockbrokers, and mortgage lenders.", "However, this has not happened yet. People prefer to get stocks, life insurance, and bank accounts from different companies."], "image_desc": "A collage of images representing a bank, an insurance company, a stockbroker, and a mortgage lender", "narration": "एक और example लेते हैं – financial services. लोग कह रहे हैं कि future में हमारे पास banks, insurance companies, stockbrokers, और mortgage lenders नहीं होंगे। एक बड़ा financial services company होगा। लेकिन ये अब तक नहीं हुआ है। लोग stocks, life insurance, और bank accounts अलग-अलग companies से लेना पसंद करते हैं।", "slide_number": "6", "image_url": "https://c8.alamy.com/comp/DN571T/collection-of-vector-logos-for-banks-and-finance-companies-DN571T.jpg", "image_path": "data/videos/1aab0f32-8272-47c5-8cc3-21682bd85390/images/image_6.webp"}, {"title": "The Importance of Brand Names", "content": ["- Brands should have different names to cover different categories.", "General Motors successfully used Chevrolet, Pontiac, Oldsmobile, Buick, and Cadillac for different market segments.", "Volkswagen initially tried to sell all models under one brand name, which resulted in only the Beetle selling well."], "image_desc": "A collage of images representing different car brands, including Chevrolet, Pontiac, Oldsmobile, Buick, Cadillac, and Volkswagen", "narration": "Brands को अलग categories cover करने के लिए अलग names रखने चाहिए। General Motors ने Chevrolet, Pontiac, Oldsmobile, Buick, और Cadillac जैसे अलग brands के साथ market में entry की। Volkswagen ने भी ये mistake की। Volkswagen ने अपने एक brand name से सब models बेचने की कोशिश की, जिसका result ये हुआ कि Beetle ही sell होती रही।", "slide_number": "7", "image_url": "https://i.ytimg.com/vi/J9FPV9NYeQw/hqdefault.jpg", "image_path": "data/videos/1aab0f32-8272-47c5-8cc3-21682bd85390/images/image_7.webp"}, {"title": "The Success of Honda Acura", "content": ["- Volkswagen eventually followed the right strategy by introducing a new family of cars.", "However, the small-car category had expanded, and people shifted towards Toyota, Honda, and Nissan.", "Honda introduced Acura with separate dealerships, establishing dominance in the Japanese luxury car market."], "image_desc": "A collage of images representing Volkswagen, Toyota, Honda, and Acura", "narration": "Volkswagen ने सही strategy follow की और नई family of cars के साथ market में आया, पर तब तक small-car category expand हो चुकी थी और लोग Toyota, Honda, और Nissan की तरफ shift हो गए।\n\nHonda ने Acura introduce किया और अलग dealerships set up किए। Result? Acura ने Japanese luxury car market में dominance establish किया।", "slide_number": "8", "image_url": "https://thumbs.dreamstime.com/b/car-brands-collage-15306689.jpg", "image_path": "data/videos/1aab0f32-8272-47c5-8cc3-21682bd85390/images/image_8.webp"}, {"title": "Timing is Key", "content": ["- Leaders should launch new brands for new categories, and timing is crucial.", "Early entry allows for establishing a strong market position.", "Late entry faces tougher competition."], "image_desc": "A clock with hands pointing to different times", "narration": "तो दोस्तों, Law of Division के according, leaders को new categories के लिए new brands launch करने चाहिए और timing भी important होती है। अगर आप early होते हैं, तो आप market में अपना position बना सकते हैं। लेकिन late entry के साथ competition tough होता है।", "slide_number": "9", "image_url": "https://images.teachthis.com.au/Product/image/original/1484241935ClockDisplay_PointingHands.png", "image_path": "data/videos/1aab0f32-8272-47c5-8cc3-21682bd85390/images/image_9.webp"}, {"title": "Conclusion", "content": ["- The Law of Division is an important principle for marketers to understand.", "By recognizing the trend of category division, businesses can create new brands and capture market share."], "image_desc": "A hand holding a magnifying glass over a map with different categories highlighted", "narration": "तो ये था Chapter 10 – The Law of Division. आपको ये video कैसा लगा? Comments में ज़रूर बताएं और video को like और share करना ना भूलें। और हाँ, हमारे channel को subscribe करना मत भूलिए, ताकि आपको हमारे आगे के episodes की updates मिलती रहें।", "slide_number": "10", "image_url": "https://img.freepik.com/free-photo/crop-hand-holding-magnifying-glass-map_23-2147793523.jpg?w=996&t=st=1659986653~exp=1659987253~hmac=d7891d665243c2e4039d5123452c042f9f15b93b431ec8824e9021371b403744", "image_path": "data/videos/1aab0f32-8272-47c5-8cc3-21682bd85390/images/image_10.webp"}]