[{"title": "The Wolves of Cernogratz - Part 5", "content": ["- There was a moment of constrained silence, and then the banker's wife spoke.", "\"It is the intense cold that is splitting the trees. It is also the cold that has brought the wolves out in such numbers. It is many years since we have had such a cold winter.\"", "The Baroness eagerly agreed that the cold was responsible for these things. It was the cold of the open window, too, which caused the heart failure that made the doctor's ministrations unnecessary for the old Fraulein. But the notice in the newspapers looked very well -", "\"On December 29th, at Schloss Cernogratz, Amalie von Cernogratz, for many years the valued friend of Baron and Baroness Gruebel.\""], "image_desc": "A snowy forest scene with a large, imposing castle in the background. Wolves are howling in the distance.", "narration": "ek kshan ke liye chuppee chha gayi, aur fir bank ki patni ne kaha. \"yah teevr thand hai jo pedon ko tod rahi hai. yahi thand hai jisse bhaluon ko itni badi sankhya mein bahar laya hai. kai varshon se hamen itni thandi sardi ka samna nahin karna pada.\" Baroness ne jaldi se sahmati jatayi ki thand in sab cheezon ke liye zimmedar hai. yahi khuli khidki ki thand thi jisse dil ki vipalta ka karan bani, jisse purani governess ke liye doctor ki dekhbhal ki avashyakta nahin padi. lekin samachar patron mein jo notice chhapa, woh bahut achcha lag raha tha - \"29 December ko, Schloss Cernogratz mein, Amalie von Cernogratz, kai varshon tak Baron aur Baroness Gruebel ki mulyaavan mitr.\"", "slide_number": "1", "image_url": "https://thumbs.dreamstime.com/z/image-titled-icy-reflections-night-winter-landscape-mountains-coniferous-forest-depicts-stunning-scene-cold-273795470.jpg", "image_path": "data\\videos\\a15b5a7f-7503-45b7-855c-e753adb992c5\\images\\image_1.webp"}, {"title": "The End of an Era", "content": ["- This notice marks the end of the story, but it also shows how an old family tale, a tradition, and a cold night combined to have a profound impact.", "With Amalie's death, an entire generation of the von Cernogratz family came to an end, and the echoing howls of the wolves marked her final farewell in a way."], "image_desc": "A portrait of an elderly woman in a grand, old-fashioned setting. The portrait is slightly faded and has a sense of melancholy.", "narration": "yah notice kahani ka ant to batata hai, lekin yah bhi dikhaata hai ki kaise ek purani parivaarik kahani, ek parampara aur ek thandi raat ne milkar ek gahra prabhav dala. Amalie ki mrityu ke saath hi, von Cernogratz parivar ki ek puri pidhi samapt ho gayi, aur bhaluon ki goonjti aavazon ne uski antim vidaai ko ek tarah se darj kiya.", "slide_number": "2", "image_url": "http://maundymitchell.com/wp-content/uploads/2014/11/©2014-Maundy-Mitchell_0183.jpg", "image_path": "data\\videos\\a15b5a7f-7503-45b7-855c-e753adb992c5\\images\\image_2.webp"}, {"title": "Legacy and Memories", "content": ["- As we reflect on this story, we realize how traditions and legends can leave a real impact, and how individual stories become woven into history.", "Amalie's story also teaches us that peace of mind and family heritage never truly end; they always live on, no matter the circumstances."], "image_desc": "A group of people gathered around a fireplace, sharing stories and laughter. The scene is warm and inviting, with a sense of connection and belonging.", "narration": "jab hum is kahani par vichar karte hain, to humein ehsaas hota hai ki paramparaein aur kinvadantiyaan kaise ek vastuvik prabhav chhod sakti hain, aur kaise vyaktiगत kahaniyan itihaas mein samahit ho jati hain. Amalie ki kahani humein yah bhi sikhati hai ki aatma ki shanti aur parivar ki dharohar kabhi bhi khatam nahin hoti; ve hamesha jeevit rahti hain, chahe paristhitiyan kaisi bhi hon.", "slide_number": "3", "image_url": "https://img.freepik.com/premium-photo/group-friends-gathered-around-crackling-bonfire-sharing-stories-laughter-against-backd_890329-1679.jpg", "image_path": "data\\videos\\a15b5a7f-7503-45b7-855c-e753adb992c5\\images\\image_3.webp"}]