[{"slide_number": "1", "title": "Internet of Things: Examples of IoT Usages", "slide_type": "Title Slide", "content": ["- (No additional content for Title Slide)"], "image_desc": "- A collage of various IoT devices like smartwatches, smart home appliances, and smart city infrastructure.", "narration": "नमस्ते! आज हम IoT के कुछ ज़बरदस्त उदाहरणों के बारे में बात करेंगे। \n\n-", "image_url": "https://www.mdpi.com/sensors/sensors-23-08015/article_deploy/html/images/sensors-23-08015-g001.png", "image_path": "data/videos/4d89c82e-6ca5-419c-a757-2e8ddc49d506/images/image_1.webp"}, {"slide_number": "2", "title": "Wearable Devices", "slide_type": "Image Left", "content": ["- Wearable devices like smartwatches, fitness trackers, and health monitors are becoming increasingly popular.", "- These devices use sensors to collect data about your activity, sleep, and health.", "- This data can be used to improve your fitness, track your health, and even help you manage chronic conditions."], "image_desc": "- A person wearing a smartwatch and fitness tracker.", "narration": "पहले, हम wearable devices पर नज़र डालते हैं।  ये devices जैसे smartwatches, fitness trackers, और heart monitors  जीवन को आसान बना रहे हैं।  ये devices sensors का इस्तेमाल करके आपकी activity, sleep, और health के बारे में data collect करते हैं।  \n\n-", "image_url": "https://answers.childrenshospital.org/wp-content/uploads/2022/03/CPR_FitnessTracker-Blog-1.jpg", "image_path": "data/videos/4d89c82e-6ca5-419c-a757-2e8ddc49d506/images/image_2.webp"}, {"slide_number": "3", "title": "Smart Homes", "slide_type": "Image Right", "content": ["- Smart homes use sensors and actuators to automate tasks like lighting, temperature control, and security.", "- These devices can be controlled remotely using a smartphone or other device.", "- Smart homes can save energy, improve comfort, and enhance security."], "image_desc": "- A modern living room with smart home devices like smart lights, a smart thermostat, and a smart speaker.", "narration": "अब, आइए smart homes की बात करते हैं।  Smart homes में sensors और actuators का इस्तेमाल करके lighting, temperature control, और security जैसे कामों को automate किया जाता है।  ये devices आपके smartphone से remote control किए जा सकते हैं।  Smart homes energy saving, comfort, और security में सुधार करते हैं।\n\n-", "image_url": "https://images.squarespace-cdn.com/content/v1/615b670a57ca9c41c085b5fb/1634857714485-4SPI80RMQDGIT2XICA0R/r-architecture-T6d96Qrb5MY-unsplash.jpg", "image_path": "data/videos/4d89c82e-6ca5-419c-a757-2e8ddc49d506/images/image_3.webp"}, {"slide_number": "4", "title": "Smart Cities", "slide_type": "Two Columns", "content": ["- **Column 1**: Smart cities use IoT to improve the quality of life for residents.", "- **Column 2**:  Sensors and actuators are used to monitor traffic, manage waste, and optimize energy consumption."], "image_desc": "- A cityscape with various IoT devices like smart traffic lights, smart waste bins, and smart streetlights.", "narration": "आखिर में, हम smart cities के बारे में बात करते हैं।  Smart cities IoT का इस्तेमाल करके residents के लिए जीवन की quality को बेहतर बनाते हैं।  Sensors और actuators का इस्तेमाल करके traffic monitor किया जाता है, waste manage किया जाता है, और energy consumption optimize किया जाता है।\n\n-", "image_url": "https://intelilight.eu/wp-content/uploads/2021/08/inteliLIGHT_Smart-street-lighting-paves-the-way-for-smart-cities-all-over-the-world.jpg", "image_path": "data/videos/4d89c82e-6ca5-419c-a757-2e8ddc49d506/images/image_4.webp"}, {"slide_number": "5", "title": "Conclusion", "slide_type": "Image with Caption", "content": ["- IoT is transforming the way we live, work, and interact with the world around us.", "- As the technology continues to evolve, we can expect to see even more innovative and impactful applications of IoT in the future."], "image_desc": "- A graphic showing a network of interconnected devices representing the Internet of Things.", "narration": "IoT  हमारे जीवन, काम, और दुनिया के साथ interaction को बदल रहा है।  जैसे-जैसे ये technology evolve होती है, हम भविष्य में IoT के और भी innovative और impactful applications देखने की उम्मीद कर सकते हैं।\n\n-", "image_url": "https://images.pexels.com/photos/22610370/pexels-photo-22610370.jpeg", "image_path": "data/videos/4d89c82e-6ca5-419c-a757-2e8ddc49d506/images/image_5.webp"}, {"slide_number": "6", "title": "Thank You!", "slide_type": "Image with Caption", "content": ["- Thank you for watching!"], "image_desc": "- A simple image of a thank you message with a smiling face.", "narration": "आपका समय देने के लिए धन्यवाद!", "image_url": "https://thumbs.dreamstime.com/b/thank-you-vector-13903086.jpg", "image_path": "data/videos/4d89c82e-6ca5-419c-a757-2e8ddc49d506/images/image_6.webp"}]