[{"title": "The Wolves of Cernogratz - Part 2", "content": ["- \"I am a von Cernogratz myself,\" said the old woman, \"that is why I know the family history.\"", "\"You a von Cernogratz? You!\" came in an incredulous chorus.", "\"When we became very poor,\" she explained, \"and I had to go out and give teaching lessons, I took another name; I thought it would be more in keeping. But my grandfather spent much of his time as a boy in this castle, and my father used to tell me many stories about it, and, of course, I knew all the family legends and stories. When one has nothing left to one but memories, one guards and dusts them with especial care. I little thought when I took service with you that I should one day come with you to the old home of my family. I could wish it had been anywhere else.\""], "image_desc": "A portrait of an elderly woman with a kind but determined expression, holding a book. She is wearing a simple but elegant dress. The background is a dimly lit room with bookshelves and a fireplace.", "narration": "\"मैं खुद भी एक von Cernogratz हूं,\" बुढ़िया ने कहा, \"इसीलिए मुझे परिवार का इतिहास पता है।\" \"आप एक von Cernogratz? आप!\" सब ने हैरान होकर कहा। \"जब हम बहुत गरीब हो गए,\" उसने समझाया, \"और मुझे पढ़ाने के लिए बाहर जाना पड़ा, तो मैंने एक और नाम अपनाया; मुझे लगा कि यही उचित होगा। लेकिन मेरे दादा का बचपन का अधिकांश समय इस किले में बीता, और मेरे पिता मुझे इसके बारे में बहुत सी कहानियाँ सुनाया करते थे, और,当然, मैं सभी पारिवारिक किंवदंतियों और कहानियों को जानती थी। जब एक के पास केवल यादें बच जाती हैं, तो उन्हें विशेष ध्यान से संजोया जाता है। मुझे नहीं पता था कि जब मैंने आपके साथ सेवा की, तो मैं कभी अपने परिवार के पुराने घर में आऊँगी। काश, यह कहीं और होता।\"", "slide_number": "1", "image_url": "https://c8.alamy.com/comp/BEA3B7/portrait-of-a-determined-elderly-woman-BEA3B7.jpg", "image_path": "data\\videos\\d7589729-9c63-4481-9460-f6a59ec2e7a4\\images\\image_1.webp"}, {"title": "Disbelief and Derision", "content": ["- There was silence when she finished speaking, and then the Baroness turned the conversation to a less embarrassing topic than family histories. But afterwards, when the old governess had slipped away quietly to her duties, there arose a clamour of derision and disbelief.", "\"It was an impertinence,\" snapped out the Baron, his protruding eyes taking on a scandalised expression; \"fancy the woman talking like that at our table. She almost told us we were nobodies, and I don't believe a word of it. She is just Schmidt and nothing more. She has been talking to some of the peasants about the old Cernogratz family, and raked up their history and their stories.\""], "image_desc": "A scene of a grand dining room with a long table set for a formal dinner. The Baron and Baroness are seated at the head of the table, their faces contorted in anger and disbelief. The other guests are looking on in a mixture of amusement and discomfort.", "narration": "जब उसने बोलना खत्म किया, तो चुप्पी छा गई, और फिर बारोनेस ने बातचीत को परिवार की कहानियों से हटाकर किसी कम शर्मिंदगी वाले विषय की ओर मोड़ दिया। लेकिन बाद में, जब पुरानी गवर्नेस चुपचाप अपने काम में चली गई, तो उपहास और अविश्वास की आवाजें उठने लगीं। \"यह एक अभद्रता थी,\" बारोन ने कहा, उसकी बाहर निकली आँखों में एक आश्चर्यचकित भाव था; \"सोचिए, उस महिला ने हमारे सामने ऐसा कैसे कहा। उसने लगभग हमें बता दिया कि हम कुछ नहीं हैं, और मैं एक शब्द भी विश्वास नहीं करता। वह बस 'श्मिट' है और कुछ नहीं। उसने कुछ किसानों से पुराने Cernogratz परिवार के बारे में बात की है, और उनकी कहानियाँ और इतिहास को उखाड़कर सामने लाया है।\"", "slide_number": "2", "image_url": "https://i.pinimg.com/originals/0f/f6/9a/0ff69a5c0fc4aaaa325098e72e76b907.jpg", "image_path": "data\\videos\\d7589729-9c63-4481-9460-f6a59ec2e7a4\\images\\image_2.webp"}, {"title": "The Baroness's Disdain", "content": ["- \"She wants to make herself out of some consequence,\" said the Baroness; \"she knows she will soon be past work and she wants to appeal to our sympathies. Her grandfather, indeed!\"", "The Baroness had the usual number of grandfathers, but she never, never boasted about them."], "image_desc": "A close-up of the Baroness's face, her expression haughty and dismissive. She is wearing a luxurious gown and jewels, and her hair is elaborately styled.", "narration": "\"वह खुद को महत्वपूर्ण दिखाना चाहती है,\" बारोनेस ने कहा; \"उसे पता है कि वह जल्द ही काम से बाहर हो जाएगी और वह हमारी सहानुभूति को आकर्षित करना चाहती है। उसके दादा, वास्तव में!\" बारोनेस के पास सामान्य संख्या में दादा-दादी थे, लेकिन उसने कभी भी उनके बारे में गर्व नहीं किया।", "slide_number": "3", "image_url": "https://i.redd.it/h5yikkznsxy61.jpg", "image_path": "data\\videos\\d7589729-9c63-4481-9460-f6a59ec2e7a4\\images\\image_3.webp"}, {"title": "The Baron's Sneer", "content": ["- \"I dare say her grandfather was a pantry boy or something of the sort in the castle,\" sniggered the Baron; \"that part of the story may be true.\""], "image_desc": "A caricature of the Baron, his features exaggerated to emphasize his arrogance and disdain. He is wearing a formal suit and a monocle, and his expression is one of smug superiority.", "narration": "\"मुझे लगता है कि उसके दादा किले में एक रसोई घर के लड़के या कुछ ऐसा ही होंगे,\" बारोन ने हंसते हुए कहा; \"इस कहानी का वह हिस्सा सच हो सकता है।\"", "slide_number": "4", "image_url": "https://c8.alamy.com/comp/MNWXEB/caricature-of-baron-ma-de-rothschild-mp-caption-read-the-winner-of-the-race-1871-carlo-pellegrini-18391889-alternative-names-singe-ape-description-italian-artist-and-caricaturist-date-of-birthdeath-25-march-1839-22-january-1889-location-of-birthdeath-capua-london-work-location-london-authority-control-q935877-viaf91408204-isni0000-0001-1684-9584-ulan500106277-lccnn94116782-nla35070756-worldcat-1074-mayer-amschel-de-rothschild-vanity-fair-1871-05-27-MNWXEB.jpg", "image_path": "data\\videos\\d7589729-9c63-4481-9460-f6a59ec2e7a4\\images\\image_4.webp"}, {"title": "The Merchant's Silence", "content": ["- The merchant from Hamburg said nothing; he had seen tears in the old woman's eyes when she spoke of guarding her memories -- or, being of an imaginative disposition, he thought he had."], "image_desc": "A portrait of the merchant from Hamburg, his face thoughtful and introspective. He is wearing a simple but well-tailored suit, and his expression is one of quiet observation.", "narration": "हैम्बर्ग का व्यापारी कुछ नहीं कहा; उसने देखा था कि जब बुढ़िया ने अपनी यादों को संजोने की बात की थी, तो उसकी आँखों में आँसू थे -- या, अपने कल्पनाशील स्वभाव के कारण, उसने ऐसा सोचा था।", "slide_number": "5", "image_url": "https://i.pinimg.com/originals/da/a8/64/daa8648bec1918ed6f5950a1e4ce1d95.jpg", "image_path": "data\\videos\\d7589729-9c63-4481-9460-f6a59ec2e7a4\\images\\image_5.webp"}, {"title": "The End of Part 2", "content": ["- Subscribe for more!"], "image_desc": "A black screen with the text \"Subscribe for more!\" in white letters.", "narration": "उम्मीद है कि इस वीडियो से आपको कहानी का अगला भाग समझने में मदद मिली होगी। अगर आपको हमारा वीडियो पसंद आया हो तो कृपया लाइक और सब्सक्राइब जरूर करें। और हां, अगला भाग देखने के लिए चैनल पर बने रहें! धन्यवाद!", "slide_number": "6", "image_url": "https://www.alfredocreates.com/wp-content/uploads/2019/06/Free-Black-YouTube-Subscribe-Button-PNG-Download-By-AlfredoCreates-20-768x432.jpg", "image_path": "data\\videos\\d7589729-9c63-4481-9460-f6a59ec2e7a4\\images\\image_6.webp"}]