[{"title": "Introduction", "image_desc": "A graphic of a connected city with smart devices, highlighting the various levels of IoT architecture.", "content": ["- This video will explain IoT architecture in an easy-to-understand way.", "We'll cover the different levels of the architecture and provide examples."], "narration": "नमस्ते दोस्तों! आज हम एक बहुत ही interesting topic पर बात करेंगे - Internet of Things, और उसका Architectural View. अगर आप engineering student हो या IoT samajhna chahte ho, to yeh video aapke liye hai. Toh shuru karte hain!", "slide_number": "1", "image_url": "https://www.adeunis.com/wp-content/uploads/2019/06/Smart-City-web2-1920x1087.jpg", "image_path": "data/videos/341b26b5-6a1d-4848-8c16-e1fd0e904ee3/images/image_1.webp"}, {"title": "CISCO's 7-Layer Model", "image_desc": "An infographic of CISCO's 7-layer model with each layer labeled and a brief description.", "content": ["- CISCO's 7-layer model is a popular reference for understanding IoT architecture.", "Each layer represents a different aspect of the IoT system."], "narration": "Sabse pehle baat karte hain IoT ke multiple levels ke baare mein, jinhe hum tiers bhi bolte hain. Yeh levels ek reference model ke through explain kiye jaate hain, jisme CISCO ka 7-level model kaafi famous hai.", "slide_number": "2", "image_url": "/data/videos/341b26b5-6a1d-4848-8c16-e1fd0e904ee3/images/image_2.webp", "image_path": "data/videos/341b26b5-6a1d-4848-8c16-e1fd0e904ee3/images/image_2.webp"}, {"title": "Level 1: Physical Devices and Controllers", "image_desc": "A close-up image of various sensors, like temperature sensors, motion sensors, and smart meters.", "content": ["- This level includes sensors, machines, and other IoT devices.", "These devices collect data from the physical world."], "narration": "Level 1 me humare sensors, machines, aur IoT ke devices aate hain. Yeh sari cheezen data collect karti hain.", "slide_number": "3", "image_url": "https://thumbs.dreamstime.com/z/close-up-industrial-sensors-temperature-measurement-59305392.jpg", "image_path": "data/videos/341b26b5-6a1d-4848-8c16-e1fd0e904ee3/images/image_3.webp"}, {"title": "Level 2: Connectivity", "image_desc": "A diagram showing a network of connected devices, with arrows representing data flow.", "content": ["- This level handles data communication between devices.", "It involves processors and networks."], "narration": "Yaha data communication hoti hai, jisme processors aur networks involve hote hain.", "slide_number": "4", "image_url": "https://www.conceptdraw.com/How-To-Guide/picture/CISCO-example.png", "image_path": "data/videos/341b26b5-6a1d-4848-8c16-e1fd0e904ee3/images/image_4.webp"}, {"title": "Level 3: Edge Computing", "image_desc": "A graphic showing data being processed and analyzed at the edge of the network, with a simplified diagram of an edge server.", "content": ["- This level analyzes and transforms data to make it useful.", "It helps to reduce the amount of data that needs to be sent to the cloud."], "narration": "Is level pe data ko analyse aur transform kiya jaata hai, taki yeh useful ban sake.", "slide_number": "5", "image_url": "https://www.wipro.com/content/dam/nexus/en/infrastructure/infographics/simple-edge-computing-architecture.jpg", "image_path": "data/videos/341b26b5-6a1d-4848-8c16-e1fd0e904ee3/images/image_5.webp"}, {"title": "Level 4: Data Accumulation", "image_desc": "A visual representation of a data center with servers storing large amounts of data.", "content": ["- This level stores the collected data.", "It acts as a central repository for all IoT data."], "narration": "Ab chalte hain Level 4 pe – Data Accumulation. Yeh level data ko store karta hai.", "slide_number": "6", "image_url": "https://thumbs.dreamstime.com/b/data-center-computers-large-facility-servers-storage-solution-generative-ai-data-center-computers-large-facility-servers-267915351.jpg", "image_path": "data/videos/341b26b5-6a1d-4848-8c16-e1fd0e904ee3/images/image_6.webp"}, {"title": "Level 5: Data Abstraction", "image_desc": "A graphic showing data being aggregated and presented in a user-friendly dashboard.", "content": ["- This level aggregates and provides access to data.", "It allows users to easily query and retrieve data."], "narration": "Iske baad aata hai Data Abstraction – yeh Level 5, jahan data ko aggregate kiya jaata hai aur access kiya jaata hai jab zarurat ho.", "slide_number": "7", "image_url": "https://s3.amazonaws.com/noupe/2017/01/20-inspirational-dashboard-designs-story_ipad.png", "image_path": "data/videos/341b26b5-6a1d-4848-8c16-e1fd0e904ee3/images/image_7.webp"}, {"title": "Level 6: Application Layer", "image_desc": "A screenshot of a user interface showing data visualizations, reports, and control options.", "content": ["- This level handles reporting, analysis, and control of the IoT system.", "It provides the user interface and tools for interacting with the system."], "narration": "Ab baari aati hai Level 6 ki – Application Layer. Yaha reporting, analysis, aur control ka kaam hota hai.", "slide_number": "8", "image_url": "https://mir-s3-cdn-cf.behance.net/project_modules/1400/7088f384206783.5d552ece0b27b.jpg", "image_path": "data/videos/341b26b5-6a1d-4848-8c16-e1fd0e904ee3/images/image_8.webp"}, {"title": "Level 7: Collaboration and Processes", "image_desc": "A graphic showing people working together on a project, with data from the IoT system being displayed on a screen.", "content": ["- This level integrates people and business processes with the IoT system.", "It enables seamless collaboration and decision-making."], "narration": "Aur finally, sabse upar hai Level 7 – Collaboration and Processes. Yahaan par logon aur business processes ko integrate kiya jaata hai!", "slide_number": "9", "image_url": "https://img.freepik.com/premium-photo/global-network-connection-concept-with-people-working-together-cloud-computing-vector-illustration-network-community-teamwork-social-network-concept-illustration-ai-generated_585735-6829.jpg", "image_path": "data/videos/341b26b5-6a1d-4848-8c16-e1fd0e904ee3/images/image_9.webp"}, {"title": "Oracle's IoT Architecture", "image_desc": "A diagram of Oracle's IoT architecture, highlighting key components like sensors, gateways, databases, and applications.", "content": ["- Oracle's model is more comprehensive than CISCO's.", "It includes features like device identity management and access management."], "narration": "Yeh toh hogaya CISCO ka model, ab dekhte hain Oracle ka IoT architecture. Oracle ne ek thoda aur comprehensive model suggest kiya hai jisme device identity management aur access management jaise features hain.", "slide_number": "10", "image_url": "/data/videos/341b26b5-6a1d-4848-8c16-e1fd0e904ee3/images/image_10.webp", "image_path": "data/videos/341b26b5-6a1d-4848-8c16-e1fd0e904ee3/images/image_10.webp"}, {"title": "IEEE's P2413 Standard", "image_desc": "A graphic showing the key principles of IEEE's P2413 standard, with icons representing security, privacy, and interoperability.", "content": ["- This standard focuses on data security, privacy, and architecture divergence.", "It provides a reference architecture for various IoT verticals."], "narration": "Aur aakhri me, IEEE ka P2413 standard discuss karte hain. Is framework ka main focus hai data security, privacy, aur architecture divergence ko manage karna. Yeh IoT ke multiple verticals ke liye ek reference architecture provide karta hai jaise smart cities, e-health, aur intelligent transport.", "slide_number": "11", "image_url": "https://nmsconsulting.com/wp-content/uploads/2023/05/data-privacy-and-cybersecurity-1024x512-1300x600.jpeg", "image_path": "data/videos/341b26b5-6a1d-4848-8c16-e1fd0e904ee3/images/image_11.webp"}, {"title": "Conclusion", "image_desc": "A graphic showing the complete IoT architecture model, with all the key elements and layers highlighted.", "content": ["- This video has provided an overview of IoT architecture.", "You now have a better understanding of how IoT systems work."], "narration": "Yeh thi IoT architecture ki overview. Aapko samajh aa gaya hoga ki IoT systems kaise kaam karte hain aur unme har layer ka kya importance hai. Agar aapko yeh video helpful laga, toh like karein, subscribe karein, aur share karein apne engineering friends ke saath!\n\n(End with upbeat music and call-to-action: \"IoT aur technology ke aur bhi videos ke liye, channel ko subscribe karna na bhule!\")", "slide_number": "12", "image_url": "https://dgtlinfra.com/wp-content/uploads/2022/11/Layers-in-Internet-of-Things-IoT-Architecture.jpg", "image_path": "data/videos/341b26b5-6a1d-4848-8c16-e1fd0e904ee3/images/image_12.webp"}]