[{"title": "CollegitesAI Research Review", "content": ["- This research review explores the study \"Perceived Organizational Support, Organizational Citizenship Behavior, and Job Performance: Evidence from the IT Sector\" by Gitu Nijhawan, Dr. Harminder Kaur Gujral, and Kavita Singh.", "We will delve into the key findings, methodologies, and implications of this study."], "image_desc": "A stylized image of a research paper with a magnifying glass over it, highlighting the title of the study.", "narration": "Welcome to our channel! Today, we're diving into a fascinating research study that explores the connection between perceived organizational support, organizational citizenship behavior, and job performance in the IT sector. This study, authored by Gitu Nijhawan, Dr. Harminder Kaur Gujral, and Kavita Singh, provides valuable insights into how these factors influence employee performance. Let's explore the key findings and implications together!", "slide_number": "1", "image_url": "/data/videos/529c98cb-603d-4834-8394-535d6b5ec9e4/images/image_1.webp", "image_path": "data/videos/529c98cb-603d-4834-8394-535d6b5ec9e4/images/image_1.webp"}, {"title": "Research Objectives", "content": ["- Examine the impact of Perceived Organizational Support (POS) on job performance.", "Understand the influence of POS on Organizational Citizenship Behavior (OCB).", "Evaluate the relationship between OCB and job performance.", "Explore the mediating role of OCB in the relationship between POS and job performance."], "image_desc": "A flowchart depicting the relationships between POS, OCB, and job performance, with arrows indicating the direction of influence.", "narration": "The study aims to investigate several crucial aspects within the IT sector. The researchers set out to examine how perceived organizational support affects employees' job performance, understand the impact of POS on organizational citizenship behavior, evaluate how OCB influences job performance, and explore the mediating role of OCB in the relationship between POS and job performance.", "slide_number": "2", "image_url": "https://www.collidu.com/media/catalog/product/img/2/d/2d304a2685cda6833c20ce0155199dead1e2b744ded8badc6ecdd15eddb40ea9/direction-of-influence-slide2.png", "image_path": "data/videos/529c98cb-603d-4834-8394-535d6b5ec9e4/images/image_2.webp"}, {"title": "Research Hypotheses", "content": ["- H1: POS positively impacts job performance.", "H2: POS has a positive effect on OCB.", "H3: OCB positively influences job performance.", "H4: OCB mediates the relationship between POS and job performance."], "image_desc": "A visual representation of the four hypotheses, displayed as statements with arrows indicating the expected direction of relationships.", "narration": "To guide their study, the researchers formulated four main hypotheses. These hypotheses predict that perceived organizational support will positively impact both job performance and organizational citizenship behavior, and that OCB will in turn positively influence job performance. Additionally, they hypothesize that OCB mediates the relationship between POS and job performance, suggesting that OCB acts as a mechanism through which POS influences job performance.", "slide_number": "3", "image_url": "/data/videos/529c98cb-603d-4834-8394-535d6b5ec9e4/images/image_3.webp", "image_path": "data/videos/529c98cb-603d-4834-8394-535d6b5ec9e4/images/image_3.webp"}, {"title": "Methodology", "content": ["- Sample: 380 employees working in the IT sector in India.", "Data Collection: Structured questionnaire on POS, OCB, and job performance.", "Analysis Techniques: SPSS for basic statistical analysis and AMOS for Structural Equation Modeling (SEM)."], "image_desc": "A diagram illustrating the data collection and analysis process, including the questionnaire, statistical analysis, and SEM.", "narration": "To test these hypotheses, the researchers employed a comprehensive methodology. They collected data from 380 employees working in the IT sector in India, ensuring a robust sample size for reliable results. Data was gathered using a structured questionnaire to measure POS, OCB, and job performance consistently. The researchers then utilized SPSS for basic statistical analysis and AMOS for Structural Equation Modeling (SEM), a powerful technique for understanding complex relationships between variables.", "slide_number": "4", "image_url": "https://www.questionpro.com/blog/wp-content/uploads/2018/09/Survey-Data-Collection-and-Analysis.jpg", "image_path": "data/videos/529c98cb-603d-4834-8394-535d6b5ec9e4/images/image_4.webp"}, {"title": "Data Analysis and Results", "content": ["- Correlation Analysis: Significant positive correlations between POS, OCB, and job performance.", "Factor Analysis: Confirmed the reliability and validity of the measurement scales.", "Structural Equation Modeling (SEM): Supported all four hypotheses."], "image_desc": "A combination of graphs and charts depicting the correlation analysis, factor analysis, and SEM results.", "narration": "The results of the study were quite revealing. Correlation analysis revealed significant positive correlations between POS and job performance, POS and OCB, and OCB and job performance, indicating strong relationships between these variables. Factor analysis confirmed the reliability and validity of the measurement scales used, ensuring that the constructs of POS, OCB, and job performance were accurately captured. Structural Equation Modeling (SEM) results provided further support for all four hypotheses, confirming the positive impact of POS on both job performance and OCB, the positive influence of OCB on job performance, and the mediating role of OCB in the relationship between POS and job performance.", "slide_number": "5", "image_url": "/data/videos/529c98cb-603d-4834-8394-535d6b5ec9e4/images/image_5.webp", "image_path": "data/videos/529c98cb-603d-4834-8394-535d6b5ec9e4/images/image_5.webp"}, {"title": "Implications and Practical Tips", "content": ["- Enhancing POS: Create a supportive work environment through practices like providing resources, recognizing efforts, and ensuring fair treatment.", "Promoting OCB: Encourage extra-role behaviors that benefit the organization by recognizing and rewarding them.", "Improving Job Performance: Focus on enhancing POS and encouraging OCB to see improvements in overall job performance."], "image_desc": "A visual representation of practical tips for managers and HR professionals, such as a supportive work environment, recognition programs, and employee engagement activities.", "narration": "The study's findings offer valuable insights for organizations. By enhancing perceived organizational support through practices such as providing adequate resources, recognizing employees' efforts, and ensuring fair treatment, organizations can create a supportive work environment that fosters employee engagement and performance. Promoting organizational citizenship behavior by recognizing and rewarding employees who go above and beyond their job requirements can further enhance performance and create a culture of support. By focusing on both POS and OCB, organizations can see a noticeable improvement in overall job performance.", "slide_number": "6", "image_url": "/data/videos/529c98cb-603d-4834-8394-535d6b5ec9e4/images/image_6.webp", "image_path": "data/videos/529c98cb-603d-4834-8394-535d6b5ec9e4/images/image_6.webp"}, {"title": "Conclusion", "content": ["- This study highlights the significant role of POS and OCB in enhancing job performance.", "A big thank you to the authors for their valuable research contributions.", "Like, share, and subscribe for more research reviews."], "image_desc": "A concluding slide with a call to action, encouraging viewers to like, share, and subscribe to the channel.", "narration": "In conclusion, this study underscores the significant role that perceived organizational support and organizational citizenship behavior play in enhancing job performance. A big thank you to Gitu Nijhawan, Dr. Harminder Kaur Gujral, and Kavita Singh for their valuable research contributions. If you found this breakdown helpful, please like, share, and subscribe to our channel for more in-depth research reviews. We'd love to hear your thoughts and questions in the comments below!", "slide_number": "7", "image_url": "/data/videos/529c98cb-603d-4834-8394-535d6b5ec9e4/images/image_7.webp", "image_path": "data/videos/529c98cb-603d-4834-8394-535d6b5ec9e4/images/image_7.webp"}]