[{"title": "What is SBRT?", "content": ["- SBRT stands for Stereotactic Body Radiotherapy.", "It is a highly precise form of radiation therapy that delivers high doses of radiation to a small, well-defined tumor.", "SBRT uses advanced imaging techniques to precisely target the tumor while minimizing damage to surrounding healthy tissues."], "image_desc": "A diagram illustrating the delivery of radiation to a tumor using SBRT, highlighting the precise targeting and minimal damage to surrounding tissues.", "narration": "Welcome to our presentation on SBRT, a revolutionary treatment option for various cancers. SBRT, or Stereotactic Body Radiotherapy, is a highly precise form of radiation therapy that delivers high doses of radiation to a small, well-defined tumor. This advanced technique utilizes advanced imaging techniques to precisely target the tumor while minimizing damage to surrounding healthy tissues.", "slide_number": "1", "image_url": "https://blueridgeradonc.com/wp-content/uploads/2016/10/SBRT-dose-distribution-example.png", "image_path": "data/videos/daabc1fc-c633-42d8-b9bd-80f16bf1bb52/images/image_1.webp"}, {"title": "How SBRT Works", "content": ["- SBRT uses advanced imaging techniques, such as CT scans and MRI, to create a 3D image of the tumor and surrounding tissues.", "This image is used to plan the radiation treatment, ensuring that the radiation is delivered to the tumor with pinpoint accuracy.", "Multiple beams of radiation are delivered from different angles to target the tumor from all sides."], "image_desc": "A 3D image of a tumor with multiple radiation beams converging on it from different angles.", "narration": "SBRT leverages advanced imaging techniques, such as CT scans and MRI, to create a detailed 3D image of the tumor and surrounding tissues. This image is crucial for planning the radiation treatment, ensuring that the radiation is delivered to the tumor with pinpoint accuracy. Multiple beams of radiation are then delivered from different angles to target the tumor from all sides, maximizing the effectiveness of the treatment.", "slide_number": "2", "image_url": "https://dam.upmc.com/-/media/cancercenter/cancer-care/images/3ddosecropped.jpg?h=249&w=250&la=en&rev=89c092000ca849ca8ecda26f54bf5360&hash=AE8604A70B56598ADBDED7984AB7BF5C", "image_path": "data/videos/daabc1fc-c633-42d8-b9bd-80f16bf1bb52/images/image_2.webp"}, {"title": "Benefits of SBRT", "content": ["- Highly precise targeting of the tumor, minimizing damage to surrounding healthy tissues.", "Shorter treatment duration compared to conventional radiation therapy.", "Fewer side effects and improved quality of life for patients.", "Can be used to treat a wide range of cancers, including lung, liver, prostate, and brain tumors."], "image_desc": "A smiling patient receiving SBRT treatment, highlighting the minimal discomfort and improved quality of life associated with the procedure.", "narration": "SBRT offers numerous benefits for patients. Its highly precise targeting of the tumor minimizes damage to surrounding healthy tissues, leading to fewer side effects and improved quality of life. Compared to conventional radiation therapy, SBRT requires a shorter treatment duration, making it a more convenient option for patients. Furthermore, SBRT can be used to treat a wide range of cancers, including lung, liver, prostate, and brain tumors.", "slide_number": "3", "image_url": "https://c8.alamy.com/comp/2JN9H52/female-cosmetologist-using-diode-laser-scanner-device-while-performing-resurfacing-skincare-procedure-smiling-woman-patient-in-protective-goggles-receiving-laser-facial-treatment-in-beauty-salon-2JN9H52.jpg", "image_path": "data/videos/daabc1fc-c633-42d8-b9bd-80f16bf1bb52/images/image_3.webp"}, {"title": "SBRT vs. Conventional Radiation Therapy", "content": ["- SBRT delivers higher doses of radiation in fewer treatment sessions compared to conventional radiation therapy.", "SBRT is more precise and targeted, minimizing damage to surrounding healthy tissues.", "SBRT is often a better option for patients with small, well-defined tumors."], "image_desc": "A table comparing SBRT and conventional radiation therapy, highlighting the key differences in treatment duration, dose, and precision.", "narration": "Let's compare SBRT to conventional radiation therapy. SBRT delivers higher doses of radiation in fewer treatment sessions compared to conventional radiation therapy. This allows for more efficient treatment while minimizing the overall treatment time. Additionally, SBRT is more precise and targeted, minimizing damage to surrounding healthy tissues, making it a preferred option for patients with small, well-defined tumors.", "slide_number": "4", "image_url": "http://radiologykey.com/wp-content/uploads/2020/04/f067.jpg", "image_path": "data/videos/daabc1fc-c633-42d8-b9bd-80f16bf1bb52/images/image_4.webp"}, {"title": "SBRT: A Promising Treatment Option", "content": ["- SBRT is a promising treatment option for various cancers, offering high precision, shorter treatment duration, and improved quality of life.", "It is a cutting-edge technology that is constantly evolving, with ongoing research and development to further enhance its effectiveness and safety."], "image_desc": "A futuristic image representing the advancement of SBRT technology, emphasizing its potential for future improvements.", "narration": "SBRT is a promising treatment option for various cancers, offering high precision, shorter treatment duration, and improved quality of life. It is a cutting-edge technology that is constantly evolving, with ongoing research and development to further enhance its effectiveness and safety. As we continue to explore and refine this technology, SBRT holds great potential for improving cancer treatment outcomes in the future.", "slide_number": "5", "image_url": "https://thumbs.dreamstime.com/b/futuristic-abstract-city-hub-technology-progress-metaverse-cyber-concept-idea-innovation-advancement-ai-generated-268216407.jpg", "image_path": "data/videos/daabc1fc-c633-42d8-b9bd-80f16bf1bb52/images/image_5.webp"}]