[{"slide_number": "1", "title": "Collegites AI: शिक्षा और व्यावसायिक प्रशिक्षण में क्रांति", "slide_type": "Title Slide", "content": "(No additional content for Title Slide)", "image_desc": "A futuristic-looking image depicting a diverse group of people interacting with holographic projections of an AI avatar, showcasing a blend of educational and corporate settings.", "narration": "नमस्ते! आज हम Collegites AI की दुनिया में कदम रखेंगे, जहाँ शिक्षा और व्यावसायिक प्रशिक्षण एकदम नए आयाम पर पहुँच जाते हैं।", "image_url": "https://img.freepik.com/premium-photo/diverse-group-people-standing-together-outdoor-event-abstract-figures-coming-together-form-holographic-futuristic-illusion-ai-generated_538213-30342.jpg", "image_path": "data/videos/3cec9f84-bda3-443a-8170-54aa1a1dff02/images/image_1.webp"}, {"slide_number": "2", "title": "न्यूटन के गति के नियम: सरल व्याख्या", "slide_type": "Image Left", "content": "प्रथम नियम: जड़त्व का नियम\nद्वितीय नियम: बल = द्रव्यमान × त्वरण\nतृतीय नियम: क्रिया-प्रतिक्रिया का नियम", "image_desc": "An animated graphic illustrating Newton's three laws of motion with simple, clear visuals.  For example, a ball at rest, a ball accelerating, and two balls colliding.", "narration": "आइये, सबसे पहले न्यूटन के गति के तीनों नियमों को एकदम आसान तरीके से समझते हैं।  पहला नियम, जड़त्व का नियम, बताता है कि कोई वस्तु अपनी अवस्था में तब तक बनी रहती है जब तक उस पर कोई बाहरी बल नहीं लगता। दूसरा नियम, बल बराबर द्रव्यमान गुणा त्वरण,  गति और बल के बीच का संबंध बताता है। और तीसरा नियम, क्रिया-प्रतिक्रिया का नियम, बताता है कि हर क्रिया के बराबर और विपरीत दिशा में प्रतिक्रिया होती है।", "image_url": "https://i.makeagif.com/media/7-12-2015/VRFrpi.gif", "image_path": "data/videos/3cec9f84-bda3-443a-8170-54aa1a1dff02/images/image_2.webp"}, {"slide_number": "3", "title": "Collegites AI: एक गतिशील शिक्षण अनुभव", "slide_type": "Image Right", "content": "हर भाषा में शिक्षा\nस्पष्ट अवधारणाएँ\nपूरी तरह से जुड़ाव", "image_desc": "A diverse classroom setting where students are actively engaged with interactive learning materials facilitated by an AI avatar.", "narration": "Collegites AI  के साथ, शिक्षा हर भाषा में, हर अवधारणा को स्पष्ट रूप से समझाते हुए, और हर छात्र को पूरी तरह से जोड़ते हुए, एक गतिशील अनुभव बन जाती है।", "image_url": "https://blog.kinems.com/content/images/2021/01/kids_group.jpg", "image_path": "data/videos/3cec9f84-bda3-443a-8170-54aa1a1dff02/images/image_3.webp"}, {"slide_number": "4", "title": "व्यावसायिक प्रशिक्षण: एक नया आयाम", "slide_type": "Image with Caption", "content": "(Caption below the image)  Collegites AI द्वारा संचालित इंटरैक्टिव प्रशिक्षण मॉड्यूल।", "image_desc": "A modern corporate office setting with employees using tablets and interacting with an AI-powered training module.", "narration": "लेकिन Collegites AI केवल कक्षाओं तक सीमित नहीं है।  यह कार्यालयों और कार्यस्थलों में भी उतना ही प्रभावी है।  हमारे AI-संचालित कॉर्पोरेट गाइड, HR नीतियाँ, और प्रशिक्षण मॉड्यूल,  प्रशिक्षण को एक इंटरैक्टिव और आकर्षक यात्रा बना देते हैं।", "image_url": "https://www.learnworlds.com/app/uploads/2022/09/employees-using-digital-devices-1.jpg", "image_path": "data/videos/3cec9f84-bda3-443a-8170-54aa1a1dff02/images/image_4.webp"}, {"slide_number": "5", "title": "AI अवतार: आपका वर्चुअल गाइड", "slide_type": "Image Left", "content": "इंटरैक्टिव प्रशिक्षण\nव्यक्तिगत अनुभव\nअनुकूलनीय सामग्री", "image_desc": "A friendly, realistic-looking AI avatar interacting with a group of people in a virtual training environment.", "narration": "हमारे AI अवतार आपके वर्चुअल इंस्ट्रक्टर और गाइड हैं, जो इंटरैक्टिव प्रशिक्षण, व्यक्तिगत अनुभव, और अनुकूलनीय सामग्री प्रदान करते हैं।", "image_url": "https://imgcdn.stablediffusionweb.com/2024/5/3/608284e2-1cb5-4056-a2de-be38112c4466.jpg", "image_path": "data/videos/3cec9f84-bda3-443a-8170-54aa1a1dff02/images/image_5.webp"}, {"slide_number": "6", "title": "Collegites AI: भविष्य की शिक्षा और प्रशिक्षण", "slide_type": "Image Right", "content": "हाइपर-रियलिस्टिक AI अवतार\nकस्टमाइज़्ड वॉयस क्लोनिंग\nवैश्विक पहुँच", "image_desc": "A montage showcasing various applications of Collegites AI, including virtual classrooms, corporate training sessions, and global presentations delivered by AI avatars.", "narration": "हाइपर-रियलिस्टिक AI अवतार, कस्टमाइज़्ड वॉयस क्लोनिंग, और वैश्विक पहुँच के साथ, Collegites AI शिक्षा और प्रशिक्षण के भविष्य को आकार दे रहा है।  आइये, आज ही हमसे जुड़ें और अपने संवाद की शैली में क्रांति लाएँ!", "image_url": "https://elearningimages.adobe.com/files/2019/10/education.jpeg", "image_path": "data/videos/3cec9f84-bda3-443a-8170-54aa1a1dff02/images/image_6.webp"}, {"slide_number": "7", "title": "अभी संपर्क करें!", "slide_type": "Image with Caption", "content": "(Caption below the image)  अपनी यात्रा शुरू करने के लिए, नीचे दिए गए अनुरोध फ़ॉर्म को भरें।", "image_desc": "A simple, clean image with a clear call to action, such as a QR code linking to a contact form or website.", "narration": "अपनी यात्रा शुरू करने के लिए,  हमारे वेबसाइट पर जाएं और संपर्क फ़ॉर्म भरें।  हम आपसे जल्द ही संपर्क करेंगे!", "image_url": "/data/videos/3cec9f84-bda3-443a-8170-54aa1a1dff02/images/image_7.webp", "image_path": "data/videos/3cec9f84-bda3-443a-8170-54aa1a1dff02/images/image_7.webp"}]