[{"slide_number": "1", "title": "Newton's Laws of Motion", "slide_type": "Title Slide", "content": "No Content", "image_desc": "No Image Description", "video_desc": "newton's laws", "narration": "Welcome to this educational video on Newton's Laws of Motion These three fundamental laws form the bedrock of classical mechanics explaining how objects move and interact with forces in our universe. Let's dive in and explore these fascinating concepts.", "image_url": "", "image_path": "", "video_url": "https://videos.pexels.com/video-files/6613336/6613336-sd_960_506_30fps.mp4", "video_path": "data/videos/2911e3eb-2aa9-415c-b050-a0e832640ec1/images/video_1.mp4"}, {"slide_number": "2", "title": "Table of Contents", "slide_type": "Table of Contents", "content": "Introduction to Newton's Laws\nNewton's First Law: The Law of Inertia\nNewton's Second Law: The Law of Acceleration\nNewton's Third Law: The Action-Reaction Law\nReal-World Applications\nSummary and Conclusion\nNarration:\nIn this video, we'll cover the basics of Newton's Laws, starting with an introduction and then delving into each law individually. We'll explore the Law of Inertia, the Law of Acceleration, and the Action-Reaction Law. Finally, we'll look at some real-world applications and summarize what we've learned.", "image_desc": "No Image Description", "video_desc": "", "narration": "In this video we'll cover the basics of Newton's Laws starting with an introduction and then delving into each law individually. We'll explore the Law of Inertia the Law of Acceleration and the ActionReaction Law. Finally we'll look at some realworld applications and summarize what we've learned.", "image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/15/No_image_available_600_x_450.svg/600px-No_image_available_600_x_450.svg.png", "image_path": "data/videos/2911e3eb-2aa9-415c-b050-a0e832640ec1/images/image_2.webp", "video_url": "", "video_path": ""}, {"slide_number": "3", "title": "Newton's First Law: Law of Inertia", "slide_type": "Image Left", "content": "An object at rest stays at rest.\nAn object in motion stays in motion.\nUnless acted upon by an unbalanced external force.", "image_desc": "Book resting on a table, car moving at constant speed. Type: illustration", "video_desc": "", "narration": "Newton's First Law also known as the Law of Inertia states that an object will remain at rest or in uniform motion in a straight line unless acted upon by an external force. This means that objects resist changes to their state of motion whether they are stationary or moving. Think of a book sitting still on a table it will stay there until someone picks it up.", "image_url": "https://d1yqpar94jqbqm.cloudfront.net/styles/media_full/s3/images/d8f0037618615c1a8b6f5009c2db4cb6322ecae4.jpg?itok=Q5o7Qb16", "image_path": "data/videos/2911e3eb-2aa9-415c-b050-a0e832640ec1/images/image_3.webp", "video_url": "", "video_path": ""}, {"slide_number": "4", "title": "Examples of Inertia", "slide_type": "Image Right", "content": "A book on a table stays at rest.\nA moving car continues moving unless brakes are applied.\nInertia keeps you moving forward in a car when it suddenly stops.", "image_desc": "Car braking suddenly, person leaning forward. Type: illustration", "video_desc": "", "narration": "Consider a car moving at a constant speed. It will continue moving at that speed unless friction air resistance or the brakes slow it down. Another example is when a car suddenly stops and you feel yourself moving forward this is due to your body's inertia resisting the change in motion.", "image_url": "https://www.shutterstock.com/image-vector/woman-crashes-into-back-her-260nw-2438743367.jpg", "image_path": "data/videos/2911e3eb-2aa9-415c-b050-a0e832640ec1/images/image_4.webp", "video_url": "", "video_path": ""}, {"slide_number": "5", "title": "Newton's Second Law: Law of Acceleration", "slide_type": "Image Left", "content": "F = ma\nF = Force (Newtons)\nm = Mass (kilograms)\na = Acceleration (m/s squared)", "image_desc": "Equation F=ma. Type: diagram", "video_desc": "", "narration": "Newton's Second Law describes the relationship between force mass and acceleration. It states that the acceleration of an object is directly proportional to the net force acting on it and inversely proportional to its mass. This relationship is mathematically expressed as F equals ma where F is force m is mass and a is acceleration.", "image_url": "http://electron6.phys.utk.edu/PhysicsProblems/Mechanics/1-Simple%20point%20particles/images/proble3.gif", "image_path": "data/videos/2911e3eb-2aa9-415c-b050-a0e832640ec1/images/image_5.webp", "video_url": "", "video_path": ""}, {"slide_number": "6", "title": "Understanding F = ma", "slide_type": "Image Right", "content": "More force = more acceleration.\nMore mass = less acceleration (for the same force).\nA heavier object requires more force to accelerate.", "image_desc": "Pushing a light ball versus pushing a heavy rock. Type: illustration", "video_desc": "", "narration": "This means that if you apply a greater force to an object it will accelerate more. Conversely if you have two objects and apply the same force the heavier object will accelerate less than the lighter one. Pushing a light ball is much easier than pushing a heavy rock with the same amount of force because the rock has more mass.", "image_url": "https://www.shutterstock.com/image-vector/man-pushing-big-boulder-uphill-260nw-2302643685.jpg", "image_path": "data/videos/2911e3eb-2aa9-415c-b050-a0e832640ec1/images/image_6.webp", "video_url": "", "video_path": ""}, {"slide_number": "7", "title": "Newton's Third Law: Action-Reaction Law", "slide_type": "Image Left", "content": "For every action, there is an equal and opposite reaction.\nForces always occur in pairs.\nWhen you apply a force on an object, it applies an equal force back on you.", "image_desc": "Person jumping off a boat, rocket launching. Type: illustration", "video_desc": "", "narration": "Newton's Third Law states that for every action there is an equal and opposite reaction. This means that when one object exerts a force on another object the second object exerts an equal force back on the first object but in the opposite direction. Forces always come in pairs.", "image_url": "https://www.shutterstock.com/shutterstock/photos/2462916959/display_1500/stock-vector-rocket-takes-spewing-smoke-vector-illustration-isolated-on-white-background-2462916959.jpg", "image_path": "data/videos/2911e3eb-2aa9-415c-b050-a0e832640ec1/images/image_7.webp", "video_url": "", "video_path": ""}, {"slide_number": "8", "title": "Examples of Action-Reaction", "slide_type": "Image Right", "content": "Jumping off a boat (boat moves backward).\nRocket launching (gases expelled downward, rocket moves upward).\nWalking (you push the Earth backward, and it pushes you forward).", "image_desc": "Walking person, showing force on the ground. Type: illustration", "video_desc": "", "narration": "When you jump off a boat you exert a force on the boat pushing it backward while the boat exerts an equal force on you propelling you forward. Similarly when a rocket launches it expels gases downward and the gases exert an equal and opposite force upward on the rocket causing it to accelerate into space. Even when you walk you push the Earth backward and the Earth pushes you forward.", "image_url": "https://i.ytimg.com/vi/PfHNOwmmik4/maxresdefault.jpg", "image_path": "data/videos/2911e3eb-2aa9-415c-b050-a0e832640ec1/images/image_8.webp", "video_url": "", "video_path": ""}]