[{"title": "Introduction to Electrons", "content": ["- **What are Electrons?** Electrons are subatomic particles with a negative charge.", "**Location:** They orbit the nucleus of an atom.", "**Role:** Electrons are responsible for chemical bonding and electrical conductivity."], "image_desc": "A stylized image of an atom with a nucleus and orbiting electrons.", "narration": "Welcome to this short video on electrons. We'll start by defining what electrons are and where they are found. Electrons are tiny, negatively charged particles that orbit the atom's nucleus. They play a crucial role in chemical bonding and electrical conductivity.", "slide_number": "1", "image_url": "https://c8.alamy.com/comp/2X6W4TB/colorful-abstract-vector-illustration-of-atom-model-with-electrons-orbiting-nucleus-representing-scientific-concept-in-chemistry-physics-biology-and-technology-2X6W4TB.jpg", "image_path": "data/videos/a6f03258-8f13-48f0-9d12-c38b7bec03d2/images/image_1.webp"}, {"title": "Electron Behavior and Applications", "content": ["- **Electron Behavior:** Electrons can move freely in conductors, creating electric current.", "**Applications:** Electrons are used in various technologies like:\n    - Electronics (transistors, integrated circuits)\n    - Medical imaging (X-rays, CT scans)\n    - Energy production (nuclear power)"], "image_desc": "A schematic diagram showing electrons flowing through a wire, representing electric current.", "narration": "Now, let's explore how electrons behave and their applications. Electrons can move freely in materials called conductors, creating electric current. This property is essential for electronics, where electrons flow through transistors and integrated circuits. Electrons also play a vital role in medical imaging, powering X-rays and CT scans. And in the realm of energy, electrons are harnessed in nuclear power plants to generate electricity.", "slide_number": "2", "image_url": "https://i.ytimg.com/vi/t6pqrkWSWL8/maxresdefault.jpg", "image_path": "data/videos/a6f03258-8f13-48f0-9d12-c38b7bec03d2/images/image_2.webp"}]