[{"title": "Introduction", "image_desc": "A person with a prosthetic limb interacting with a computer.", "content": ["- This is an introduction to the challenges of neuroprosthetic interfacing for prosthetic limbs.", "It covers the need for intuitive control, the limitations of current technologies, and the potential of new approaches."], "narration": "नमस्ते! आज हम प्रोस्थेटिक लिम के लिए न्यूरोप्रोस्थेटिक इंटरफेसिंग के चुनौतियों के बारे में बात करेंगे।  हम देखेंगे कि कैसे इंट्यूटिव कंट्रोल की ज़रूरत है, मौजूदा तकनीकों की सीमाएँ क्या हैं, और नए तरीकों की संभावनाएँ क्या हैं।", "slide_number": "1", "image_url": "https://www.alamy.com/aggregator-api/download?url=https://c8.alamy.com/comp/2JM14FM/motivated-woman-using-prosthetic-arm-working-notebook-computer-typing-text-girl-with-disability-leads-normal-life-artificial-prosthetic-limb-people-2JM14FM.jpg", "image_path": "data/videos/9c734a6f-a92e-42be-b0c7-f8d8a96e14fa/images/image_1.webp"}, {"title": "The Motorised Prosthetic Limb", "image_desc": "A diagram showing different types of prosthetic limbs, including myoelectric, peripheral nerve, and brain-computer interfaces.", "content": ["- Current prosthetic limbs are limited by their lack of intuitive control.", "They are often controlled by surface electrodes, which are not as precise or responsive as neural signals.", "This disconnect between the user's intent and the device's response hinders functionality."], "narration": "आज के प्रोस्थेटिक लिम इंट्यूटिव कंट्रोल की कमी से जूझ रहे हैं।  वे अक्सर सरफेस इलेक्ट्रोड्स द्वारा नियंत्रित होते हैं, जो न्यूरल सिग्नल जितने सटीक या प्रतिक्रियाशील नहीं होते हैं।  इससे यूजर के इरादे और डिवाइस की प्रतिक्रिया के बीच एक अंतर पैदा होता है, जिससे कार्यक्षमता कम होती है।", "slide_number": "2", "image_url": "http://media.ottobock.com/prosthetics/arms/_general/images/above_elbow_tmr_prosthesis_graphic_16_9_teaser_onecolumn.jpg", "image_path": "data/videos/9c734a6f-a92e-42be-b0c7-f8d8a96e14fa/images/image_2.webp"}, {"title": "The Challenges of Tissue-Electronic Interfacing", "image_desc": "A microscopic image of a foreign-body giant cell surrounding an implanted electrode.", "content": ["- The foreign-body response (FBR) is a major challenge for long-term neural interfacing.", "The body's immune system reacts to implanted electrodes, leading to inflammation, scarring, and device failure.", "This is particularly problematic in the brain, where the delicate neural tissue is sensitive to damage."], "narration": "लंबे समय तक न्यूरल इंटरफेसिंग के लिए एक बड़ी चुनौती है विदेशी शरीर की प्रतिक्रिया (FBR)।  शरीर की प्रतिरक्षा प्रणाली प्रत्यारोपित इलेक्ट्रोड्स पर प्रतिक्रिया करती है, जिससे सूजन, निशान और डिवाइस की विफलता होती है।  यह मस्तिष्क में विशेष रूप से समस्याग्रस्त है, जहाँ नाजुक तंत्रिका ऊतक क्षति के प्रति संवेदनशील होता है।", "slide_number": "3", "image_url": "https://www.mdpi.com/materials/materials-08-05269/article_deploy/html/images/materials-08-05269-g004-1024.png", "image_path": "data/videos/9c734a6f-a92e-42be-b0c7-f8d8a96e14fa/images/image_3.webp"}, {"title": "Grafting Skeletal Muscle onto Residual Nerves", "image_desc": "A diagram showing a muscle graft being attached to a residual nerve.", "content": ["- A promising approach is to use skeletal muscle as a surrogate for neural interfacing.", "Muscle grafts can be innervated by residual nerves, providing a more robust and reliable signal source.", "This technique has shown potential for achieving intuitive prosthetic control."], "narration": "न्यूरल इंटरफेसिंग के लिए एक आशाजनक दृष्टिकोण कंकाल की मांसपेशियों का उपयोग करना है।  मांसपेशियों के ग्राफ्ट को अवशिष्ट नसों द्वारा इनर्वेट किया जा सकता है, जो एक अधिक मजबूत और विश्वसनीय सिग्नल स्रोत प्रदान करता है।  इस तकनीक ने इंट्यूटिव प्रोस्थेटिक नियंत्रण प्राप्त करने की क्षमता दिखाई है।", "slide_number": "4", "image_url": "https://surgicaleducation.wustl.edu/files/2017/01/110421-1-1024x741.jpg", "image_path": "data/videos/9c734a6f-a92e-42be-b0c7-f8d8a96e14fa/images/image_4.webp"}, {"title": "Tissue Engineering in the Neuroprosthetic Interface", "image_desc": "A 3D model of a bioprinted muscle graft with integrated electrodes.", "content": ["- Tissue engineering offers the potential to create custom-made bioelectronic devices.", "This involves growing neural and muscle tissue on electrodes, creating a seamless integration between the device and the body.", "This approach could overcome the limitations of current technologies and lead to more advanced prosthetics."], "narration": "टिशू इंजीनियरिंग कस्टम-मेड बायोइलेक्ट्रॉनिक डिवाइस बनाने की क्षमता प्रदान करता है।  इसमें इलेक्ट्रोड्स पर तंत्रिका और मांसपेशियों के ऊतकों को उगाना शामिल है, जिससे डिवाइस और शरीर के बीच एक सहज एकीकरण होता है।  यह दृष्टिकोण मौजूदा तकनीकों की सीमाओं को दूर कर सकता है और अधिक उन्नत प्रोस्थेटिक्स का नेतृत्व कर सकता है।", "slide_number": "5", "image_url": "https://scitechdaily.com/images/WFIRM-3D-Bioprinter.jpg", "image_path": "data/videos/9c734a6f-a92e-42be-b0c7-f8d8a96e14fa/images/image_5.webp"}, {"title": "Bioprinting and 3D Printing", "image_desc": "A 3D bioprinter creating a muscle graft with embedded electrodes.", "content": ["- Bioprinting and 3D printing are revolutionizing the field of tissue engineering.", "These technologies allow for the precise fabrication of complex 3D structures, including bioelectronic devices.", "This opens up new possibilities for creating personalized prosthetic limbs with integrated neural interfaces."], "narration": "बायोप्रिंटिंग और 3डी प्रिंटिंग टिशू इंजीनियरिंग के क्षेत्र में क्रांति ला रहे हैं।  ये तकनीकें जटिल 3डी संरचनाओं के सटीक निर्माण की अनुमति देती हैं, जिसमें बायोइलेक्ट्रॉनिक डिवाइस भी शामिल हैं।  यह एकीकृत तंत्रिका इंटरफेस के साथ व्यक्तिगत प्रोस्थेटिक लिम बनाने के लिए नई संभावनाएं खोलता है।", "slide_number": "6", "image_url": "https://scitechdaily.com/images/WFIRM-3D-Bioprinter.jpg", "image_path": "data/videos/9c734a6f-a92e-42be-b0c7-f8d8a96e14fa/images/image_6.webp"}, {"title": "Conclusions", "image_desc": "A person with a prosthetic limb smiling and engaging in a physical activity.", "content": ["- The future of neuroprosthetic interfacing is bright, with exciting advancements in tissue engineering and biofabrication.", "These technologies hold the promise of creating intuitive, personalized, and long-lasting prosthetic limbs.", "This will revolutionize the lives of amputees and enable them to live more fulfilling and independent lives."], "narration": "न्यूरोप्रोस्थेटिक इंटरफेसिंग का भविष्य उज्ज्वल है, टिशू इंजीनियरिंग और बायोफैब्रिकेशन में रोमांचक प्रगति के साथ।  ये तकनीकें इंट्यूटिव, व्यक्तिगत और लंबे समय तक चलने वाले प्रोस्थेटिक लिम बनाने का वादा करती हैं।  यह विकलांग लोगों के जीवन में क्रांति लाएगा और उन्हें अधिक पूर्ण और स्वतंत्र जीवन जीने में सक्षम बनाएगा।\n'''", "slide_number": "7", "image_url": "https://images.pexels.com/photos/9623761/pexels-photo-9623761.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1", "image_path": "data/videos/9c734a6f-a92e-42be-b0c7-f8d8a96e14fa/images/image_7.webp"}]