[{"title": "एक अच्छे शिक्षक के गुण", "content": ["- **अनुकूलनशीलता** (Anukulanasheelata):  एक शिक्षक को बदलते परिस्थितियों के अनुसार खुद को ढालना आना चाहिए।", "**सहानुभूति** (Sahanubhooti): छात्रों की भावनाओं को समझना और उनसे सहानुभूति रखना।", "**धैर्य** (Dhairya):  छात्रों की धीमी गति से सीखने या गलतियाँ करने पर धैर्य रखना।", "**जुड़ाव** (Judav):  छात्रों को सीखने के लिए प्रेरित करना और उनकी रुचि बनाए रखना।", "**सक्रिय श्रवण** (Sakriya Shravan):  छात्रों की बात ध्यान से सुनना और उनकी बातों को समझना।", "**आजीवन सीखना** (Aajeevan Seekhna):  नई चीजें सीखने के लिए हमेशा उत्सुक रहना।"], "image_desc": "A teacher interacting with students in a classroom setting, emphasizing active listening and engagement.", "narration": "Aap sabhi jaante hain ki ek acha shikshak kitna mahatvpurn hota hai.  Ek acha shikshak sirf padhaai nahi karta, balki apne students ko motivate bhi karta hai.  Is slide mein, hum ek ache shikshak ke kuchh mahatvpurn gunon ke baare mein jaanenge.", "slide_number": "1", "image_url": "https://www.teachhub.com/wp-content/uploads/2021/05/May-19-Using-Interactive-Learning-to-Improve-Student-Engagement_web.jpg", "image_path": "data/videos/89a04ed3-4fcc-4efe-a1a1-af8a2386feaf/images/image_1.webp"}, {"title": "एक अच्छे शिक्षक के गुण (जारी)", "content": ["- **पूर्वाग्रह से मुक्त** (Poorvagrah Se Mukt):  सभी छात्रों के साथ समान व्यवहार करना और किसी के साथ भेदभाव न करना।", "**सम्मानजनक रवैया** (Sammanjanak Ravaya):  छात्रों का सम्मान करना और उनकी बातों को गंभीरता से लेना।", "**रचनात्मकता** (Rachnatmakta):  नए तरीके से पढ़ाने और छात्रों को सीखने में रुचि रखने के लिए रचनात्मक होना।", "**सहयोगात्मक** (Sahayogatkmak):  अन्य शिक्षकों और स्कूल के कर्मचारियों के साथ मिलकर काम करना।", "**तैयारी** (Taiyaari):  पढ़ाने के लिए अच्छी तरह से तैयार रहना और छात्रों की ज़रूरतों को पहले से समझना।", "**विकास की मानसिकता को बढ़ावा दें** (Vikas Ki Manasikta Ko Badhava Den):  छात्रों को यह समझाना कि वे हमेशा सीख सकते हैं और बेहतर बन सकते हैं।"], "image_desc": "A teacher working with a student on a project, showcasing collaboration and a growth mindset.", "narration": "Is slide mein, hum ek ache shikshak ke kuchh aur mahatvpurn gunon ke baare mein jaanenge.  Yeh gun ek shikshak ko apne students ko behtar seekhne mein madad karte hain.", "slide_number": "2", "image_url": "https://soeonline.american.edu/wp-content/uploads/sites/2/2023/05/au-blog-teacher-collaboration-importance.jpeg", "image_path": "data/videos/89a04ed3-4fcc-4efe-a1a1-af8a2386feaf/images/image_2.webp"}, {"title": "एक अच्छे शिक्षक के गुण (जारी)", "content": ["- **छात्रों से वहीं मिलें जहां वे हैं** (Chhatron Se Vaheen Milen Jahan Ve Hain):  छात्रों के अलग-अलग स्तरों को समझना और उनके अनुसार पढ़ाना।", "**अंतर-अनुशासन शिक्षण** (Antar-Anushaasan Shikshan):  विभिन्न विषयों को आपस में जोड़कर पढ़ाना ताकि छात्रों को वास्तविक जीवन के अनुभवों से सीखने का मौका मिले।"], "image_desc": "A teacher using a multi-disciplinary approach to teaching, incorporating different subjects and real-world examples.", "narration": "Is slide mein, hum ek ache shikshak ke kuchh aur mahatvpurn gunon ke baare mein jaanenge.  Yeh gun ek shikshak ko apne students ko behtar seekhne mein madad karte hain.", "slide_number": "3", "image_url": "https://1.bp.blogspot.com/-XrWsR81DRhQ/WL-6ArV1KiI/AAAAAAAABY0/adEHiXhnsFUigBAKROYSo3kqJkUUnOFewCEw/s1600/multidisciplinary-approach.png", "image_path": "data/videos/89a04ed3-4fcc-4efe-a1a1-af8a2386feaf/images/image_3.webp"}, {"title": "एक अच्छे शिक्षक का महत्व", "content": ["- **छात्रों को प्रेरित करना** (Chhatron Ko Prerit Karna):  एक अच्छा शिक्षक छात्रों को सीखने के लिए प्रेरित करता है और उन्हें अपनी पूरी क्षमता तक पहुँचने में मदद करता है।", "**समाज में योगदान देना** (Samaj Mein Yogdaan Dena):  शिक्षक समाज के भविष्य को आकार देते हैं और छात्रों को अच्छे नागरिक बनने में मदद करते हैं।", "**आजीवन सीखने को बढ़ावा देना** (Aajeevan Seekhne Ko Badhava Dena):  एक अच्छा शिक्षक छात्रों को सीखने के लिए जीवन भर प्रेरित करता है।"], "image_desc": "A group of students working together on a project, showcasing the positive impact of a good teacher.", "narration": "Ek ache shikshak ka mahatvpurn role hota hai.  Ve sirf padhaai nahi karte, balki students ko apne sapno ko pura karne mein madad karte hain.  Unka yogdaan samaj ke vikas mein bahut mahatvpurn hota hai.", "slide_number": "4", "image_url": "https://www.gettingsmart.com/wp-content/uploads/2018/04/Diverse-Students-Working-on-Maps-Project-with-teacher-Feature-Image-1.jpg", "image_path": "data/videos/89a04ed3-4fcc-4efe-a1a1-af8a2386feaf/images/image_4.webp"}]