[{"slide_number": "1", "title": "AI vs ML vs DL: Understanding the Differences", "slide_type": "Title Slide", "content": "No Content", "image_desc": "No Image Description", "video_desc": "ai ml dl explained", "narration": "Hello everyone and welcome In this video we'll demystify the world of artificial intelligence by exploring the differences between artificial intelligence machine learning and deep learning. These terms are often used interchangeably but they represent distinct concepts with varying levels of complexity and capability. Let's dive in", "image_url": "", "image_path": "", "video_url": "https://videos.pexels.com/video-files/11584395/11584395-sd_640_360_30fps.mp4", "video_path": "data/videos/1d4d3545-d298-41e6-8a64-2db08b9e4e1c/images/video_1.mp4"}, {"slide_number": "2", "title": "Artificial Intelligence (AI) - The Big Picture", "slide_type": "Image Left", "content": "AI aims to create machines that can perform tasks that typically require human intelligence.\nThese tasks include problem-solving, learning, reasoning, and perception.\nAI is a broad field encompassing many different approaches.", "image_desc": "Robot thinking. Type: illustration", "video_desc": "", "narration": "Artificial intelligence or AI is the overarching concept of creating machines that can mimic human intelligence. It's about enabling computers to perform tasks that usually require human cognitive abilities. This includes things like understanding language recognizing patterns making decisions and solving problems. AI is a vast field that includes many different techniques and approaches.", "image_url": "https://www.littleinventors.org/media/image/f9b3c80cc-7781-c997-f701-3076fd4922de?cts=1740611197", "image_path": "data/videos/1d4d3545-d298-41e6-8a64-2db08b9e4e1c/images/image_2.webp", "video_url": "", "video_path": ""}, {"slide_number": "3", "title": "Machine Learning (ML) - Learning from Data", "slide_type": "Image Right", "content": "ML is a subset of AI that focuses on enabling machines to learn from data without explicit programming.\nAlgorithms are trained on data to identify patterns and make predictions.\nExamples include spam filtering, recommendation systems, and fraud detection.", "image_desc": "Machine learning algorithm processing data. Type: diagram", "video_desc": "", "narration": "Machine learning or ML is a subset of artificial intelligence. Instead of explicitly programming a machine to perform a task machine learning algorithms learn from data. These algorithms are trained on large datasets to identify patterns make predictions and improve their performance over time. Think of things like spam filters recommendation systems on ecommerce sites and fraud detection systems  these are all examples of machine learning in action.", "image_url": "https://www.mdpi.com/applsci/applsci-15-03609/article_deploy/html/images/applsci-15-03609-g001.png", "image_path": "data/videos/1d4d3545-d298-41e6-8a64-2db08b9e4e1c/images/image_3.webp", "video_url": "", "video_path": ""}, {"slide_number": "4", "title": "Deep Learning (DL) - Neural Networks", "slide_type": "Image Left", "content": "DL is a subset of ML that uses artificial neural networks with multiple layers (deep neural networks).\nThese networks can learn complex patterns from large amounts of data.\nDL is used in image recognition, natural language processing, and speech recognition.", "image_desc": "Deep neural network diagram. Type: illustration", "video_desc": "", "narration": "Deep learning or DL is an even more specialized subset of machine learning. It utilizes artificial neural networks with many layers often referred to as deep neural networks. These networks are capable of learning extremely complex patterns from vast amounts of data. Deep learning powers many of the advanced AI applications we see today such as image recognition in selfdriving cars natural language processing in chatbots and speech recognition in virtual assistants.", "image_url": "https://images.prismic.io/turing/652ebde9fbd9a45bcec8186a_Feed_Forward_Neural_Networks_11zon_c684fbdfee.webp?auto=format,compress", "image_path": "data/videos/1d4d3545-d298-41e6-8a64-2db08b9e4e1c/images/image_4.webp", "video_url": "", "video_path": ""}, {"slide_number": "5", "title": "AI, ML, and DL - The Relationship", "slide_type": "Image with Caption", "content": "AI is the broadest concept, ML is a subset of AI, and DL is a subset of ML.", "image_desc": "Venn diagram showing AI, ML, and DL as nested sets. Type: diagram", "video_desc": "", "narration": "To summarize think of it this way artificial intelligence is the overarching goal of creating intelligent machines. Machine learning is one way to achieve AI by enabling machines to learn from data. And deep learning is a specific type of machine learning that uses deep neural networks. They are nested concepts with deep learning being a subset of machine learning which in turn is a subset of artificial intelligence.", "image_url": "https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fb3ad7c4b-9e49-4f4a-a7aa-b389416ba654_1210x927.png", "image_path": "data/videos/1d4d3545-d298-41e6-8a64-2db08b9e4e1c/images/image_5.webp", "video_url": "", "video_path": ""}, {"slide_number": "6", "title": "Key Differences Summarized", "slide_type": "Two Columns", "content": "**Artificial Intelligence (AI)**\nBroad concept of intelligent machines.\nFocuses on mimicking human intelligence.\nIncludes various approaches and techniques.\n**Machine Learning (ML)**\nSubset of AI.\nLearns from data without explicit programming.\nUses algorithms to identify patterns.\n**Deep Learning (DL)**\nSubset of ML.\nUses deep neural networks.\nLearns complex patterns from large datasets.", "image_desc": "Comparison table of AI, ML, and DL. Type: diagram", "video_desc": "", "narration": "Let's quickly recap the key differences. AI is the broadest concept aiming to create machines that can perform tasks requiring human intelligence. Machine learning is a subset of AI that focuses on learning from data to make predictions. And deep learning is a specialized form of machine learning that uses deep neural networks to learn complex patterns from large datasets.", "image_url": "https://www.frontiersin.org/files/Articles/1278232/fmed-10-1278232-HTML/image_m/fmed-10-1278232-g001.jpg", "image_path": "data/videos/1d4d3545-d298-41e6-8a64-2db08b9e4e1c/images/image_6.webp", "video_url": "", "video_path": ""}, {"slide_number": "7", "title": "Applications of AI, ML, and DL", "slide_type": "Image Right", "content": "AI: Robotics, expert systems, game playing.\nML: Spam filtering, recommendation systems, fraud detection.\nDL: Image recognition, natural language processing, speech recognition.", "image_desc": "Collage of AI, ML, and DL applications. Type: montage", "video_desc": "", "narration": "The applications of these technologies are vast and evergrowing. AI is used in robotics expert systems and even game playing. Machine learning powers spam filters recommendation systems and fraud detection. And deep learning is behind image recognition natural language processing and speech recognition. These technologies are transforming industries and shaping the future.", "image_url": "https://media.springernature.com/lw1200/springer-static/image/art%3A10.1038%2Fs41592-023-01783-5/MediaObjects/41592_2023_1783_Fig1_HTML.png", "image_path": "data/videos/1d4d3545-d298-41e6-8a64-2db08b9e4e1c/images/image_7.webp", "video_url": "", "video_path": ""}, {"slide_number": "8", "title": "Conclusion", "slide_type": "Title Slide", "content": "No Content", "image_desc": "No Image Description", "video_desc": "ai future", "narration": "And that concludes our explanation of the differences between artificial intelligence machine learning and deep learning. Understanding these distinctions is crucial for navigating the rapidly evolving landscape of AI. Thank you for watching and I hope you found this video informative", "image_url": "", "image_path": "", "video_url": "https://videos.pexels.com/video-files/6153453/6153453-sd_960_506_25fps.mp4", "video_path": "data/videos/1d4d3545-d298-41e6-8a64-2db08b9e4e1c/images/video_8.mp4"}]