[{"slide_number": "1", "title": "Ratan Tata: A Legacy of Innovation and Growth", "slide_type": "Title Slide", "content": "-", "image_desc": "- A portrait of Ratan Tata, smiling and looking confident.", "narration": "નમસ્કાર! આજે આપણે ભારતના એક મહાન ઉદ્યોગપતિ, રતન ટાટા વિશે વાત કરીશું.", "image_url": "https://media.assettype.com/fortuneindia/2022-09/305e0299-2791-4cf0-a2aa-97492d492bcb/Rich_list__Tata_1.jpg?w=700", "image_path": "data%%videos%Ô865995-0b09-4cd5-be5c-3e7fa4085a0f%%images%%image_1.webp"}, {"slide_number": "2", "title": "The Tata Group: A Global Empire", "slide_type": "Image Left", "content": ["- Founded in 1868, the Tata Group is one of India's oldest and largest conglomerates.", "- It operates in diverse industries, including steel, automobiles, hospitality, and technology.", "- The group employs over 700,000 people worldwide."], "image_desc": "- A collage of images showcasing various Tata Group companies and products, including Tata Steel, Tata Motors, Taj Hotels, and TCS.", "narration": "ટાટા ગ્રુપ, 1868માં સ્થાપિત, ભારતના સૌથી મોટા અને સૌથી જૂના વ્યાવસાયિક સમૂહોમાંથી એક છે. તે સ્ટીલ, ઓટોમોબાઈલ, હોટેલ અને તકનીક જેવા વિવિધ ક્ષેત્રોમાં કાર્ય કરે છે. દુનિયામાં, ટાટા ગ્રુપ 700,000થી વધુ લોકોને રોજગાર આપે છે.", "image_url": "https://cdn.prod.website-files.com/5f73bbd13fa8b95aedaf300b/608ff4d5058de65d0a94f4fa_tata.png", "image_path": "data%%videos%Ô865995-0b09-4cd5-be5c-3e7fa4085a0f%%images%%image_2.webp"}, {"slide_number": "3", "title": "Ratan Tata's Leadership", "slide_type": "Image Right", "content": ["- Ratan Tata served as Chairman of Tata Sons from 1991 to 2012.", "- He is credited with transforming the Tata Group into a global powerhouse.", "- His leadership was marked by innovation, social responsibility, and a focus on long-term growth."], "image_desc": "- A photo of Ratan Tata addressing a gathering of employees, showcasing his leadership style.", "narration": "1991થી 2012 સુધી, રતન ટાટા ટાટા સન્સના અધ્યક્ષ તરીકે કાર્યરત રહ્યા. તેમણે ટાટા ગ્રુપને વૈશ્વિક શક્તિમાં પરિવર્તિત કરવામાં મહત્વપૂર્ણ ભૂમિકા ભજવી. તેમના નેતૃત્વને નવીનતા, સામાજિક જવાબદારી અને લાંબા ગાળાના વિકાસ પર ધ્યાન કેન્દ્રિત કરવા માટે ઓળખવામાં આવે છે.", "image_url": "https://www.ourbusinessladder.com/wp-content/uploads/2024/01/Ratan-tata-blog.jpg", "image_path": "data%%videos%Ô865995-0b09-4cd5-be5c-3e7fa4085a0f%%images%%image_3.webp"}, {"slide_number": "4", "title": "The Question of Succession", "slide_type": "Two Columns", "content": ["- **Column 1**: Ratan Tata had no children, leaving a void in leadership.", "- **Column 2**: The Tata Group is now worth over Rs 30 lakh crore, making succession a critical issue."], "image_desc": "- A graphic representation of the Tata Group's diverse business portfolio, highlighting its vast size and global reach.", "narration": "રણ ટાટાના કોઈ બાળકો ન હતા, જેના કારણે નેતૃત્વમાં એક ખાલી જગ્યા બની ગઈ. ટાટા ગ્રુપ આજ રોજ 30 લાખ કરોડ રૂપિયાના છે, જે উত্তরાધિકારને એક મહત્વપૂર્ણ મુદ્દો બનાવે છે.", "image_url": "https://static.businessworld.in/Up Close3_20240705113255_original_image_13.webp", "image_path": "data%%videos%Ô865995-0b09-4cd5-be5c-3e7fa4085a0f%%images%%image_4.webp"}, {"slide_number": "5", "title": "Potential Successors", "slide_type": "Table of Contents", "content": ["- N Chandrasekaran", "- Noel Tata", "- Leah Tata", "- Maya Tata", "- Neville Tata"], "image_desc": "- A business-themed background with icons representing leadership, succession, and family.", "narration": "તો, ટાટા ગ્રુપનું નેતૃત્વ કોણ સંભાળશે? ઘણા સંભવિત વારસેદારોમાં એન ચંદ્રશેખરન, નોયલ ટાટા, અને રતન ટાટાના ભત્રીજાઓ, લીયા, માયા અને નેવિલ ટાટા સામેલ છે.", "image_url": "https://businesscoachingofpa.com/wp-content/uploads/2016/05/Leadership-27939370_ml.jpg", "image_path": "data%%videos%Ô865995-0b09-4cd5-be5c-3e7fa4085a0f%%images%%image_5.webp"}, {"slide_number": "6", "title": "N Chandrasekaran: The Current Leader", "slide_type": "Image Right", "content": ["- N Chandrasekaran has been Chairman of Tata Sons since 2017.", "- He previously served as CEO of Tata Consultancy Services (TCS).", "- He is known for his calm and efficient management style."], "image_desc": "- A photo of N Chandrasekaran, looking confident and focused, while addressing a business meeting.", "narration": "એન ચંદ્રશેખરન 2017થી ટાટા સન્સના અધ્યક્ષ છે. તેઓ પહેલાં ટાટા કન્સલ્ટન્સી સર્વિસિસ (ટીસીએસ)ના સીઇઓ રહ્યા છે. તેઓ તેમના શાંત અને કાર્યકુશળ વ્યવસ્થાપન શૈલી માટે જાણીતું છે.", "image_url": "https://images.pexels.com/photos/8518856/pexels-photo-8518856.jpeg", "image_path": "data%%videos%Ô865995-0b09-4cd5-be5c-3e7fa4085a0f%%images%%image_6.webp"}, {"slide_number": "7", "title": "Noel Tata: A Strong Contender", "slide_type": "Image Left", "content": ["- Noel Tata is Ratan Tata's half-brother.", "- He has held key positions within the Tata Group, including Trent.", "- He is considered a strong candidate for leadership."], "image_desc": "- A photo of Noel Tata, looking confident and experienced, while attending a business event.", "narration": "નોએલ ટાટા, રતન ટાટાના સૌતેલ ભાઈ છે. તેમણે ટાટા ગ્રુપમાં મહત્વના પદો પર કાર્ય કર્યો છે, જેમાં ટ્રેન્ટ પણ સામેલ છે. તેમને નેતૃત્વ માટે એક મજબૂત ઉમેદવાર માનવામાં આવે છે.", "image_url": "https://www.smiths.com/media/4chbszki/noal-tata-india-visit.jpg?width=922&height=636&format=webp&quality=100&v=1da42ec1c1c1b10", "image_path": "data%%videos%Ô865995-0b09-4cd5-be5c-3e7fa4085a0f%%images%%image_7.webp"}, {"slide_number": "8", "title": "The Next Generation", "slide_type": "Two Columns", "content": ["- **Column 1**: Leah Tata, Maya Tata, and Neville Tata are the children of Noel Tata.", "- **Column 2**: They are all involved in various Tata Group companies and are seen as potential future leaders."], "image_desc": "- A photo of Leah, Maya, and Neville Tata, looking confident and ambitious, while attending a family event.", "narration": "લીયે ટાટા, માયા ટાટા, અને નેવિલ ટાટા, નોયલ ટાટાના બાળકો છે. તેઓ બધા વિવિધ ટાટા ગ્રુપ કંપનીઓમાં જોડાયેલા છે અને તેમને ભવિષ્યના સંભવિત નેતાઓ તરીકે જોવામાં આવે છે.", "image_url": "https://indian-retailer.s3.ap-south-1.amazonaws.com/s3fs-public/2024-08/112668701(1).jpg", "image_path": "data%%videos%Ô865995-0b09-4cd5-be5c-3e7fa4085a0f%%images%%image_8.webp"}, {"slide_number": "9", "title": "The Future of the Tata Group", "slide_type": "Image with Caption", "content": ["- The Tata Group's future is uncertain, but the legacy of Ratan Tata will continue to inspire.", "- The group's commitment to innovation, social responsibility, and long-term growth will guide its path forward."], "image_desc": "- A silhouette of a person standing tall, with a bright light shining behind them, symbolizing the Tata Group's legacy and future potential.", "narration": "ટાટા ગ્રુપનું ભવિષ્ય અનિશ્ચિત છે, પરંતુ રતન ટાટાની વારસામાં પ્રેરણા મળશે. નવીનતા, સામાજિક જવાબદારી, અને લાંબા ગાળાના વિકાસ માટે ગ્રુપની પ્રતિબદ્ધતા, આગળનો માર્ગ દર્શાવશે.", "image_url": "https://indian-retailer.s3.ap-south-1.amazonaws.com/s3fs-public/2024-08/Raymond.jpg", "image_path": "data%%videos%Ô865995-0b09-4cd5-be5c-3e7fa4085a0f%%images%%image_9.webp"}]