[{"slide_number": "1", "title": "HMPV Virus Cases in India: Live Updates", "slide_type": "Title Slide", "content": "(No additional content for Title Slide)", "image_desc": "A microscopic image of the HMPV virus. Type: micrograph\n\n### Video Suggestion:\nA stock footage video showing healthcare professionals working in a hospital setting.", "narration": "Welcome to this update on the recent increase in HMPV virus cases across India.  We'll be looking at the current situation and what health experts are saying.", "image_url": "/data/videos/f10354e9-2d77-4e97-afa3-1f9b815eba47/images/image_1.webp", "image_path": "data\\videos\\f10354e9-2d77-4e97-afa3-1f9b815eba47\\images\\image_1.webp"}, {"slide_number": "2", "title": "Current Situation: HMPV Cases in India", "slide_type": "Image Left", "content": "Eleven cases reported across India.\nLocations: Mumbai (3), Bengaluru (2), Gujarat (1), Chennai (2), Kolkata (3).\nOne case involves a six-month-old infant.", "image_desc": "A map of India with markers indicating the locations where HMPV cases have been reported. Type: map\n\n### Video Suggestion:\nN/A", "narration": "As of today, eleven cases of HMPV have been confirmed across several Indian states.  Three cases are in Mumbai, two in Bengaluru, one in Gujarat, two in Chennai, and three in Kolkata.  One of the cases involves a six-month-old baby, highlighting the vulnerability of infants.", "image_url": "https://media.springernature.com/lw685/springer-static/image/art%3A10.1038%2Fs41467-021-25120-6/MediaObjects/41467_2021_25120_Fig1_HTML.png", "image_path": "data\\videos\\f10354e9-2d77-4e97-afa3-1f9b815eba47\\images\\image_2.webp"}, {"slide_number": "3", "title": "Expert Opinions & Advice", "slide_type": "Two Columns", "content": "**Column 1: Dr. Randeep Guleria**\nHMPV is not a new virus.\nUsually causes mild illness.\nCan cause pneumonia in infants, elderly, and those with comorbidities.\nSymptomatic treatment is usually sufficient (rest, hydration, fever medication).\nAvoid crowded places.\n**Column 2: Union Health Minister JP Nadda & Others**\nNo need for widespread panic.\nSituation is being closely monitored.\nGovernment is taking proactive measures.\nPublic urged to remain calm and follow guidelines.", "image_desc": "A split image showing photos of Dr. Randeep Guleria and Union Health Minister JP Nadda. Type: photo collage\n\n### Video Suggestion:\nN/A", "narration": "Leading health experts, including Dr. Randeep Guleria, former AIIMS director, have reassured the public that HMPV is not a novel virus and typically causes mild illness.  However, he stressed the importance of vigilance, especially for infants, the elderly, and those with underlying health conditions.  The Union Health Minister, JP Nadda, and other officials have echoed this sentiment, urging calm and emphasizing the government's monitoring of the situation.  Dr. Guleria advises symptomatic treatment – rest, hydration, and managing fever – and recommends avoiding crowded areas to prevent the spread of infection.", "image_url": "https://images.pexels.com/photos/296649/pexels-photo-296649.jpeg", "image_path": "data\\videos\\f10354e9-2d77-4e97-afa3-1f9b815eba47\\images\\image_3.webp"}, {"slide_number": "4", "title": "Prevention & Mitigation", "slide_type": "Image with Caption", "content": "(Caption below image)  While there's no specific vaccine for HMPV,  regular flu shots and COVID-19 vaccination can offer some level of protection.", "image_desc": "An image depicting a person receiving a flu shot. Type: photo\n\n### Video Suggestion:\nN/A", "narration": "Although there isn't a specific vaccine for HMPV, health experts suggest that regular flu vaccinations and the COVID-19 vaccine may offer some level of cross-protection.  Maintaining good hygiene practices, such as regular handwashing, also remains crucial.", "image_url": "https://static01.nyt.com/images/2022/10/18/well/11WELL-FLU-SHOT-EXPLAINER1/11WELL-FLU-SHOT-EXPLAINER1-videoSixteenByNine3000.jpg", "image_path": "data\\videos\\f10354e9-2d77-4e97-afa3-1f9b815eba47\\images\\image_4.webp"}, {"slide_number": "5", "title": "Stay Informed & Updated", "slide_type": "Image Right", "content": "Monitor official health advisories.\nPractice good hygiene.\nConsult a doctor if you experience symptoms.", "image_desc": "An image of a doctor consulting with a patient. Type: photo\n\n### Video Suggestion:\nN/A", "narration": "It's important to stay informed by monitoring official health advisories and consulting a doctor if you experience any symptoms. Remember, practicing good hygiene and taking preventative measures can help minimize the risk of infection.  Thank you for watching.", "image_url": "https://images.pexels.com/photos/8376277/pexels-photo-8376277.jpeg", "image_path": "data\\videos\\f10354e9-2d77-4e97-afa3-1f9b815eba47\\images\\image_5.webp"}]